{"inkVersion":21,"root":[["\n","\n","\n","\n","\n","\n",{"->":"Main"},["done",{"#f":5,"#n":"g-0"}],null],"done",{"Main":[["ev",{"VAR?":"debug"},"!","/ev",[{"->":".^.b","c":true},{"b":["^ ",{"->":"FullGame"},{"->":"Main.0.5"},null]}],"nop","\n","ev","str","^tmp-background","/str",{"f()":"change_background"},"pop","/ev","\n","ev",235,"srnd","pop","/ev","\n",["ev","str","^Full","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Fanias","/str","/ev",{"*":".^.c-1","flg":4},"ev","str","^Yousef","/str","/ev",{"*":".^.c-2","flg":4},"ev","str","^LiYan","/str","/ev",{"*":".^.c-3","flg":4},"ev","str","^Farewell","/str","/ev",{"*":".^.c-4","flg":4},"ev","str","^Finale","/str","/ev",{"*":".^.c-5","flg":4},{"c-0":["^ ",{"->t->":"FullGame"},"\n",{"->":"Main.0.g-0"},{"#f":5}],"c-1":["\n",["ev","str","^Fanias Full","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Fanias 1","/str","/ev",{"*":".^.c-1","flg":4},"ev","str","^Fanias 2","/str","/ev",{"*":".^.c-2","flg":4},"ev","str","^Fanias 3","/str","/ev",{"*":".^.c-3","flg":4},{"c-0":["^ ",{"->t->":"Fanias"},"\n",{"->":"Main.0.g-0"},{"#f":5}],"c-1":["^ ",{"->t->":"Fanias.First"},"\n",{"->":"Main.0.g-0"},{"#f":5}],"c-2":["^ ",{"->t->":"Fanias.Second"},"\n",{"->":"Main.0.g-0"},{"#f":5}],"c-3":["^ ",{"->t->":"Fanias.Third"},"\n",{"->":"Main.0.g-0"},{"#f":5}]}],{"#f":5}],"c-2":["\n",["ev","str","^Yousef Full","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Yousef 1","/str","/ev",{"*":".^.c-1","flg":4},"ev","str","^Yousef 2","/str","/ev",{"*":".^.c-2","flg":4},"ev","str","^Yousef 3","/str","/ev",{"*":".^.c-3","flg":4},{"c-0":["^ ",{"->t->":"Yousef"},"\n",{"->":"Main.0.g-0"},{"#f":5}],"c-1":["^ ",{"->t->":"Yousef.First"},"\n",{"->":"Main.0.g-0"},{"#f":5}],"c-2":["^ ",{"->t->":"Yousef.Second"},"\n",{"->":"Main.0.g-0"},{"#f":5}],"c-3":["^ ",{"->t->":"Yousef.Third"},"\n",{"->":"Main.0.g-0"},{"#f":5}]}],{"#f":5}],"c-3":["\n",["ev","str","^LiYan Full","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^LiYan 1","/str","/ev",{"*":".^.c-1","flg":4},"ev","str","^LiYan 2","/str","/ev",{"*":".^.c-2","flg":4},"ev","str","^LiYan 3","/str","/ev",{"*":".^.c-3","flg":4},{"c-0":["^ ",{"->t->":"LiYan"},"\n",{"->":"Main.0.g-0"},{"#f":5}],"c-1":["^ ",{"->t->":"LiYan.First"},"\n",{"->":"Main.0.g-0"},{"#f":5}],"c-2":["^ ",{"->t->":"LiYan.Second"},"\n",{"->":"Main.0.g-0"},{"#f":5}],"c-3":["^ ",{"->t->":"LiYan.Third"},"\n",{"->":"Main.0.g-0"},{"#f":5}]}],{"#f":5}],"c-4":["^ ",{"->t->":"Spaceport_Intro"},"\n",{"->":"Main.0.g-0"},{"#f":5}],"c-5":["^ ",{"->t->":"Finale"},"\n",{"->":"Main.0.g-0"},{"#f":5}],"#f":5,"#n":"top"}],{"g-0":[{"->":".^.^.top"},{"#f":5}]}],{"#f":1}],"FullGame":[{"->t->":"Intro"},{"->t->":"next_visit","var":true},{"->t->":"next_visit","var":true},{"->t->":"next_visit","var":true},{"->t->":"next_visit","var":true},{"->t->":"next_visit","var":true},{"->t->":"next_visit","var":true},{"->t->":"next_visit","var":true},{"->t->":"next_visit","var":true},{"->t->":"next_visit","var":true},{"->t->":"LiYan.Farewell"},{"->t->":"Yousef.Farewell"},{"->t->":"Fanias.Farewell"},{"->t->":"Finale"},"end",{"#f":1}],"shuffle_next_choices":["^< DEBUG > NEXT CHOICES SHOULD BE SHUFFLED","\n",{"#f":1}],"quit_game":["^< DEBUG > GAME SHOULD QUIT","\n",{"#f":1}],"finish":["^< DEBUG > RETURN TO MAIN MENU","\n",{"#f":1}],"change_background_ext":[{"temp=":"bg"},"^< DEBUG > CHANGE BACKGROUND TO ","ev",{"VAR?":"bg"},"out","/ev","\n",{"#f":1}],"change_background":[{"temp=":"bg"},"ev",{"VAR?":"bg"},"/ev",{"VAR=":"last_background","re":true},"ev",{"VAR?":"bg"},{"x()":"change_background_ext","exArgs":1},"pop","/ev","\n",{"#f":1}],"Intro":[["ev","str","^train","/str",{"f()":"change_background"},"pop","/ev","\n","^Something is making a rhythmic noise. [i]badunk, badunk, badunk.[/i] It's odd, you think; you've never been on a train that's physically attached to a rail. Of course it's going to make a noise when it's physically attached to something. You muse briefly on what it might be that's making the sound. The wheels on the rail? The bouncing of the seats?","\n","^[i]Badunk, badunk, badunk.[/i] This train is so much slower than a maglev. It took you probably twenty minutes to make it out to Ring Six from the Main Station on a maglev. But from Ring Six to this out-station - it's been nearly an hour and you still haven't reached your destination.","\n","^[i]Badunk, badunk, badunk[/i]. You shake your head. You'll have to put up with this sound on a regular basis, but you won't like it.","\n",["ev","str","^Look out the window.","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^Check time to your destination.","/str","/ev",{"*":".^.c-1","flg":20},"ev","str","^Check your calendar.","/str","/ev",{"*":".^.c-2","flg":20},"ev","str","^Check your messages.","/str","/ev",{"*":".^.c-3","flg":20},"ev","str","^Check the weather.","/str","/ev",{"*":".^.c-4","flg":20},"ev","str","^You're almost at your destination.","/str",{"VAR?":"finished_intro"},"/ev",{"*":".^.c-5","flg":21},{"c-0":["\n","^You take a look out the window. On this side of the train - the starward side - the window is heavily tinted, enabling you to look out at the dying star that powers Nova Station.","\n","^Out here, far from the hustle and bustle of the Main Station, there's not much to look at other than the flickers of fusion from the star. You can just make out the station's string-like slingshot launchpad. Beyond that lies the Horse Nebula, light-years away.","\n","^You idly wonder whether your homeworld is on this or the other side.","\n",{"->":".^.^"},{"->":".^.^.^.g-0"},{"#f":5}],"c-1":["\n","^You rotate your wrist counterclockwise and flick your fingers. An abstract map of the railway you're is projected at your eyes.","\n","^\"Current time: 06:33 Nova Time.\"","\n","^\"ETA: 06:45 Nova Time\".","\n","^The map displays a few stops, and then your final destination: the Barakhunian Refugee Housing Block.","\n",{"->":".^.^"},{"->":".^.^.^.g-0"},{"#f":5}],"c-2":["\n","^You touch your forefinger and thumb together, and a calendar comes up. It matches Nova Station's standard time, as well as Ring Six's particular orbit. Nine days per week, twenty-four hours per day.","\n","^Yesterday's calendar entry: \"See father off. First day at the housing block.\"","\n","^Today's calendar entry: \"Meet with one of the assigned residents.\"","\n",{"->":".^.^"},{"->":".^.^.^.g-0"},{"#f":5}],"c-3":["\n","^You use your left hand to tap the knuckle of your first finger. A series of messages come up.","\n","^You keep a tidy inbox, so there's only a few in here, relevant to your current journey.","\n",[["ev","str","^Subject: Help at the Housing Block?","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^Subject: Arrived at Barakhun","/str","/ev",{"*":".^.c-1","flg":20},"ev","str","^Subject: Your Duties at BRHB","/str","/ev",{"*":".^.c-2","flg":20},"ev","str","^That's enough messages.","/str",{"VAR?":"finished_intro"},"/ev",{"*":".^.c-3","flg":21},{"c-0":["\n","^You read the messages with the subject \"Help at the Housing Block?\" You sent this, one week ago.","\n","^The message explains that you'd heard that the housing block could use some help. Seems the Great Resettlement to Barakhun is causing quite a bit of turmoil. Although the housing block will be closing soon, and most of its residents have already been resettled to other camps, the few folks that are left could use some support.","\n","^The head of the housing block put out a call for help, and so, you wrote this message to offer help before you made the move with your family to Barakhun. The head of the housing block responded warmly to your inquiry.","\n","^The message chain is mostly logistics from there, concluding just yesterday, with your arrival at Ring Six of Nova Station.","\n",{"->":".^.^"},{"->":"Intro.0.g-0"},{"#f":5}],"c-1":["\n","^You read the message chain with the subject \"Arrived at Barakhun\". It was sent by your father yesterday at 17:37 Nova Time.","\n","^The message indicates that your father arrived on Barakhun safely. He says it's a beautiful place, and he can't wait for you to see it.","\n","^He continues, saying you're doing a noble thing, helping out the housing block in its final days. He expects it'll be a good experience for you. His three points of advice: actively listen to people, remember their story is different than yours, and have fun.","\n","^Finally, he says that he is eagerly awaiting you on Barakhun. The Great Resettlement begins in just a couple of weeks.","\n",{"->":".^.^"},{"->":"Intro.0.g-0"},{"#f":5}],"c-2":["\n","^The message with the subject \"Your duties at BRHB\" is from the head of the housing block. It was sent at 05:50 Nova Time.","\n","^The message says that you should check in with one of your three assigned refugees on each day this week. Since the housing block is closing soon, all three residents will be resettled, and you should assist them with any final tasks they have before that occurs.","\n","^The message goes on to describe three residents of the refugee housing block.","\n",[["ev","str","^Read Fanias' bio.","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^Read Yousef's bio.","/str","/ev",{"*":".^.c-1","flg":20},"ev","str","^Read LiYan's bio.","/str","/ev",{"*":".^.c-2","flg":20},{"*":".^.c-3","flg":24},{"c-0":["\n","^You read through Fanias' bio.","\n","^\"Fanias is a member of the royal family of the Khas, from the world Nidaroen, administered by the Urun. The Khas empire has recently been toppled, and Fanias has been on the run. The Barakhun granted him safe haven (against the Urun's wishes). He has been at the housing block for two weeks.\"","\n",{"->":".^.^"},{"->":"Intro.0.g-0"},{"#f":5}],"c-1":["\n","^You read through Yousef's bio.","\n","^\"Yousef is a refugee from the well-known Yisua-Falas conflict. He managed to escape Falas through unknown means, and the Barakhun have recognized his status as a refugee. His two sisters still remain behind in Falas, where starvation and disease rage through the population. He, his wife, and his daughter have been in the housing block for several months; they'll be moving to New Tarnaeum soon, where they will settle permanently.\"","\n",{"->":".^.^"},{"->":"Intro.0.g-0"},{"#f":5}],"c-2":["\n","^You read through LiYan's bio.","\n","^\"LiYan is from the planet Calaneth. We believe they are Calanethi (the Calanethi being the repressed majority of the planet), but we're unsure, as they seem to speak some dialect of Calanethi that our translator can't quite pick up. Not much is known about them, other than they've been moved between many different temporary refugee camps. The Barakhunian Housing Block is the seventh one they've been sent to.\"","\n",{"->":".^.^"},{"->":"Intro.0.g-0"},{"#f":5}],"c-3":["\n","^That's all the bios in the message.","\n","^You'll be expected to check up on each of these folks until they leave the housing block, at the end of the week. After that, if all goes well, you'll be joining your father on Barakhun.","\n","ev",true,"/ev",{"VAR=":"finished_intro","re":true},{"->":".^.^.^.^.^"},{"->":"Intro.0.g-0"},{"#f":5}],"#f":5,"#n":"bios"}],null],{"#f":5}],"c-3":["\n","^You're done checking your messages.","\n",{"->":".^.^.^.^.^"},{"->":"Intro.0.g-0"},{"#f":5}],"#f":5,"#n":"messages"}],null],{"#f":5}],"c-4":["\n","^You flick your wrist to the right to check the weather. \"No results\" is displayed.","\n","^Oh, right, you think. No weather on Ring Six. You shake your head. You're too used to the fake weather generated by the Climate Controller on the Main Station.","\n",{"->":".^.^"},{"->":".^.^.^.g-0"},{"#f":5}],"c-5":["\n","^\"Barakhunian Refugee Housing Block\", the train announces, as the doors open. You stand up and exit the train. Seems you're the only one getting off at this stop.","\n","^You have a choice to make; which resident of the housing block will you visit today? You're certain you will have time to visit all of the residents in your time here, so who you visit first is entirely up to you.","\n",{"->t->":"Visit"},{"->":".^.^.^.g-0"},{"#f":5}],"#f":5,"#n":"choices"}],{"g-0":["ev","void","/ev","->->",{"#f":5}]}],{"#f":3}],"Fanias":["ev",{"CNT?":".^"},"/ev",["du","ev",1,"==","/ev",{"->":".^.b","c":true},{"b":["pop","\n",{"->t->":"Fanias.First"},{"->":"Fanias.7"},null]}],["du","ev",2,"==","/ev",{"->":".^.b","c":true},{"b":["pop","\n",{"->t->":"Fanias.Second"},{"->":"Fanias.7"},null]}],["du","ev",3,"==","/ev",{"->":".^.b","c":true},{"b":["pop","\n",{"->t->":"Fanias.Third"},{"->":"Fanias.7"},null]}],[{"->":".^.b"},{"b":["pop","\n","^PROBLEM IN Fanias! ","done","\n",{"->":"Fanias.7"},null]}],"nop","\n","ev","void","/ev","->->",{"First":[["ev","str","^barakhun_office_hallway","/str",{"f()":"change_background"},"pop","/ev","\n","^You walk through a plasteel corridor, dimly lit from the overhead lights. Doors, in an old style, line the corridor. People, mostly humanoid, walk in small groups, chatting about something or other. It reminds you a little of your old school.","\n","^The doors you pass have small plaques on them; \"L. Sequim, Notary\"; \"J. Brakar, Housing Deputy\"; \"M. Pith, Placement Authority\".","\n","^As you reach the end of the hallway, you stop in front of one particular door: \"B. Breet, Interspecies Relations\".","\n","^It seems someone is arguing very loudly on the other side.","\n","ev","str","^Open the door.","/str","/ev",{"*":".^.c-0","flg":20},{"c-0":["\n",{"->":".^.^.g-0"},{"#f":5}],"g-0":["^You enter the office of Mr. Breet.","\n","ev","str","^barakhun_office","/str",{"f()":"change_background"},"pop","/ev","\n","^It's overflowing with books in here; books are on every surface, in stacks on the floor, lining the bookshelves, and threatening the stability of the chair and the desk in the back of the room.","\n","^Behind the desk sits Mr. Breet, a large humanoid. His face is quite strained, and though he is attempting to look calm, his face is quite red. He seems to be sweating a little through his suit.","\n","^And in front of the desk is seated a young man. He is wearing a very expensive tailored vest and pants, and is currently turned around, looking at you, to see who has interrupted his tirade.","\n","^\"And who might you be?\" The young man inquires haughtily.","\n","ev","str","^Someone from the housing block to check in on you.","/str","/ev",{"*":".^.c-1","flg":20},"ev","str","^No - who might you be?","/str","/ev",{"*":".^.c-2","flg":20},{"c-1":["\n","^Just someone from the housing block, here to check on you, you say. Fanias, you presume?","\n","^He scoffs. \"Presume indeed, right though you may be. And that is _prince_ Fanias to you, you lowly ingrate. You presume to come here and interrupt my meeting?\"","\n",{"->":".^.^.^.g-1"},{"#f":5}],"c-2":["\n","^You quickly fire back, no - who might [i]you[/i] be?","\n","^The young man sputters a bit. \"Well - I never!\" He pauses, and draws himself up a bit. \"Fah, I suppose mother always told me to speak well to those below me. I am Prince Fanias - you may address me as 'your majesty' - of the Khas.\"","\n","^\"And now,\" he says, looking down on you, \"Why have you interrupted my meeting?\"","\n",{"->":".^.^.^.g-1"},{"#f":5}],"#f":5}],"g-1":["ev","str","^Continue","/str","/ev",{"*":".^.c-3","flg":20},{"c-3":["\n",{"->":".^.^.^.g-2"},{"#f":5}],"#f":5}],"g-2":["^\"Ah, actually,\" Mr. Breet says, \"I asked them to come. Perhaps they may, ah, help us out with the situation.\"","\n","^\"The situation!? There is no situation.\" Fanias stands up and points at Breet. He explains, very slowly. \"I. Wish. For. An. Audience. With. The Urun. It should be easy! Is your translator picking this up or are your ears merely malfunctioning?\"","\n","^Mr. Breet stammers. \"You - I already said, you shall have a meeting with the Urun! In a month, pending their availability. And of course, we will find accomodation for you -\"","\n","^\"A month!!\" Fanias roars. \"Again with this month! I need it sooner! You do not understand! It is a matter of life and death!\"","\n",["ev",{"CNT?":".^"},5,">=","/ev",[{"->":".^.b","c":true},{"b":["^ ",{"->":".^.^.^.^.^.quiet_listening"},{"->":".^.^.^.6"},null]}],"nop","\n","ev","str","^Keep quiet.","/str","/ev",{"*":".^.c-4","flg":4},"ev","str","^Jump in.","/str","/ev",{"*":".^.c-5","flg":20},{"c-4":["\n",["ev","visit",3,"MIN","/ev","ev","du",0,"==","/ev",{"->":".^.s0","c":true},"ev","du",1,"==","/ev",{"->":".^.s1","c":true},"ev","du",2,"==","/ev",{"->":".^.s2","c":true},"ev","du",3,"==","/ev",{"->":".^.s3","c":true},"nop",{"s0":["pop","^Fanias points at Breet again. \"I must see justice done! A grave injustice has been done me, and my people, and the only way to right this wrong is to petition the Urun!\"",{"->":".^.^.29"},null],"s1":["pop","^\"If I do not get this meeting soon, there will be injustice heaped upon injustice, so much so until the very crust of the world cannot stand it!\"",{"->":".^.^.29"},null],"s2":["pop","^\"Do you not feel it in your bones, as I do, when a wrong is done to you? When a blackguard gets their way? When the bandit makes off with the jewels? I cannot stand by idly!\"",{"->":".^.^.29"},null],"s3":["pop","^\"And so I order you, you must help me, in the name of all that is good, to get me an audience with the Urun as soon as possible!\"",{"->":".^.^.29"},null],"#f":5}],"\n",{"->":".^.^"},{"->":".^.^.^.^.quiet_listening"},{"#f":5}],"c-5":["\n","^You jump in. What's this about the Urun? And why does Fanias need the meeting?","\n",{"->":".^.^.^.^.quiet_listening.after_listening"},{"->":".^.^.^.^.quiet_listening"},{"#f":5}],"#f":5,"#n":"listening"}],{"#f":5}],"quiet_listening":["^Fanias falls silent, waiting for Breet to say something. He timidly says, \"Well, you see, I was hoping our friend here could help us with this. But, ah, you may need to explain the situation to them.\"","\n",["^Fanias turns to you, as if surprised that you're still there. \"Must I explain this again?\" He sighs.","\n","^\"It is very simple. The Khas' mortal enemy, the barbarians of our world, those hated people known as the Welds, invaded our kingdom and unjustly toppled our storied monarchy. My father was slain!\"","\n","^The blackguards, the bandits -\" Fanias chokes on his own rage a little - \"Those utter mongrels! They slew my father, captured my mother, and even now, hold her captive, doing allfather-knows-what. I am the only one who escaped the Welds' monstrosity.\"","\n","ev","str","^Continue","/str","/ev",{"*":".^.c-6","flg":20},{"c-6":["\n",{"->":".^.^.^.^.g-3"},{"#f":5}],"#f":5,"#n":"after_listening"}],{"#f":5}],"g-3":["^\"And so, I am here to petition the Urun, who oversee our world, to grant me aid in righting this wrong.\"","\n","^Mr Breet jumps in. \"And I thought you could help. Your father has some connections at the Urun embassy, if I recall.\"","\n","^You think for a moment...","\n","ev","str","^Your father used to work at the Urun embassy.","/str","/ev",{"*":".^.c-7","flg":20},{"c-7":["\n",{"->":".^.^.^.g-4"},{"#f":5}],"#f":5}],"g-4":["^That's right, your father used to work there, as a translator. It's possible that you could contact him and he could expedite the process.","\n","^Fanias throws up his hands. \"Oh, thank the Allfather! Why didn't you say that earlier!?\" He gets off the chair, toppling it with a clatter, and gets down on his knees. \"Help me, Fanias, Prince of the Khas, and I, nay, the entire Khas people, will forever be in your debt! Our sons and daughters shall forever remember your name!","\n","^You look at Mr. Breet, who shrugs.","\n","ev","str","^No need to kneel. You'll help.","/str","/ev",{"*":".^.c-8","flg":20},"ev","str","^Make Fanias sweat a little.","/str","/ev",{"*":".^.c-9","flg":20},{"c-8":["\n","^There is no need to kneel, you say. You help Fanias up. Of course you'll help however you can.","\n",{"->":".^.^.^.g-5"},{"#f":5}],"c-9":["\n","^You look down at Fanias' kneeling form. If he wants his children to remember your name, perhaps he could name his firstborn son after you?","\n","^Fanias sputters a bit. \"Surely - surely you jest.\"","\n",["ev","str","^You're joking.","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^You're not joking.","/str","/ev",{"*":".^.c-1","flg":20},{"c-0":["\n","^Of course you're joking. You help Fanias up off the floor. You'll help him. Just... as long as he stops talking so much, you say.","\n",{"->":".^.^.^.^.^.g-5"},{"#f":5}],"c-1":["\n","^No, you're serious. Firstborn son. Your name.","\n","^He thinks for a moment. \"Perhaps... My first daughter instead? Will that suffice?\"","\n","^Mr Breet shakes his head, exasperated. \"My word - come now,\" he says to you, \"there is no need for this! Just help the man out, please!\" And get him out of my office, he implies, wordlessly.","\n",["ev","str","^Fine.","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^Fine, but begrudgingly.","/str","/ev",{"*":".^.c-1","flg":20},{"c-0":["\n","^Oh, fine, you were kidding anyway. You help Fanias up off the floor. You'll help him. Just... as long as he stops talking so much, you say.","\n",{"->":"Fanias.First.0.g-5"},{"#f":5}],"c-1":["\n","^Oh, fine, you were kidding anyway. You'll help him. As long as he kneels and begs just a little longer.","\n",{"->":"Fanias.First.0.g-5"},{"#f":5}]}],{"#f":5}]}],{"#f":5}],"#f":5}],"g-5":["^\"Thank you, friend! Ah, glorious day!\" He's beaming. \"Let me know when the meeting is, and I'll show up the moment you tell me! The very minute, nay, the picosecond!\"","\n","^You note that there is no guarantee that you'll be able to secure a meeting, and Fanias shakes his head. \"No, I can feel it! This is it! This is the first day that leads to the Welds' undoing!\" He shakes his fist and strikes a heroic pose. ","ev",{"CNT?":".^.^.g-4.c-9.5.c-1.7.c-1"},"/ev",[{"->":".^.b","c":true},{"b":["^ Or as much as he can, still kneeling as he is.",{"->":".^.^.^.7"},null]}],"nop","\n","ev","str","^Continue","/str","/ev",{"*":".^.c-10","flg":20},{"c-10":["\n",{"->":".^.^.^.g-6"},{"#f":5}],"#f":5}],"g-6":["^Mr. Breet looks incredibly relieved. \"Now, if there isn't anything else...\"","\n","^\"Ah, there was one other thing!\" Fanias quickly rights his chair and sits back down. \"I wish to file a complaint about the food in this place. Now, it's hardly fit for a king. Perhaps you could look into importing some fresh Yarma from Doulathor...\"","\n","^Mr. Breet sighs and wipes some sweat off his face. He waves you out of the office.","\n","ev","str","^Leave.","/str","/ev",{"*":".^.c-11","flg":20},{"c-11":["\n",{"->":".^.^.^.g-7"},{"#f":5}],"#f":5}],"g-7":["^You leave Mr. Breet's office, Fanias still complaining behind you.","\n","^. . .","\n","ev","str","^train","/str",{"f()":"change_background"},"pop","/ev","\n",[{"->t->":"Train"},"^You think about Fanias, the lord of the Khas. He's...","\n","ev","str","^Annoying.","/str","/ev",{"*":".^.c-12","flg":20},"ev","str","^Interesting.","/str","/ev",{"*":".^.c-13","flg":20},"ev","str","^Admirable.","/str","/ev",{"*":".^.c-14","flg":20},{"c-12":["\n","^Fanias is annoying. He could stand to learn some humility. And to shut up once in a while.","\n",{"->":".^.^.^.^.g-9"},{"#f":5}],"c-13":["\n","^Fanias is an interesting fellow. He could stand to be quieter, but he clearly has a lot of conviction in what he's fighting for.","\n",{"->":".^.^.^.^.g-9"},{"#f":5}],"c-14":["\n","^Fanias is admirable. Sure, he could stand to be more humble, but he is fighting for a just cause - one that he believes in passionately.","\n",{"->":".^.^.^.^.g-9"},{"#f":5}],"#f":5,"#n":"g-8"}],{"#f":5}],"g-9":["^You recall Fanias' request for help, and bring your messages up. You shoot a message to your father to see if he can set up any kind of meeting with the Urunian connections that he had at his old job. Hopefully he'll be able to help.","\n",{"->t->":"Visit"},"ev","void","/ev","->->",{"#f":5}]}],{"#f":1}],"Second":[["ev","str","^urun_outdoor","/str",{"f()":"change_background"},"pop","/ev","\n","^It's been a while since you've seen a plascrete building; almost all of them fell out of use a century ago and have been replaced with newer, lighter, and easier to mold plasteel. ","ev",{"CNT?":"Yousef.Third"},"/ev",[{"->":".^.b","c":true},{"b":["^ Sure, there was plascrete in use at the Satna Market, where you helped Yousef out, but never an entire building. O",{"->":".^.^.^.14"},null]}],[{"->":".^.b"},{"b":["^ But o",{"->":".^.^.^.14"},null]}],"nop","^ut here, on the outer edge of Ring Six, it appears they still have quite a few.","\n","^You're standing in front of one such plascrete building, the Urun embassy. It's a squat and wide gray building, ","ev",{"CNT?":"LiYan.Third"},"/ev",[{"->":".^.b","c":true},{"b":["^ nothing like the gorgeous Galatean Courthouse you visited with LiYan. In comparison, it's",{"->":".^.^.^.22"},null]}],"nop","^ a little sad to look at, if you're being honest. You wonder why they haven't gotten around to replacing it yet.","\n","^It's crowded in by other buildings nearby. People walk the narrow streets and talk in low tones, hushed by the oppressive atmosphere. Some flags do a vague impression of a wave in the artificial breeze, and a dim sky completes the dismal scene.","\n","^\"Not exactly what I expected,\" Fanias mutters beside you.","\n","ev","str","^Enter the embassy.","/str","/ev",{"*":".^.c-0","flg":20},{"c-0":["\n",{"->":".^.^.g-0"},{"#f":5}],"g-0":["^Fanias walks forward and opens the door to the Urunian Embassy. You follow behind him, entering into a wide hallway.","\n","ev","str","^urun_indoor","/str",{"f()":"change_background"},"pop","/ev","\n",["^The space is mostly empty, save for a receptionist's desk and a few perfunctory chairs. Chipped engravings and faded murals give an impression of old splendor, long gone. Everything is just a little dirty.","\n","^Fanias looks a little dismayed, but he is trying not to let it show.","\n","ev","str","^Continue","/str","/ev",{"*":".^.c-1","flg":20},{"c-1":["\n",{"->":".^.^.^.^.g-2"},{"#f":5}],"#f":5,"#n":"g-1"}],{"#f":5}],"g-2":["^He walks up to the receptionist. \"Hello good sir, or, madam, or, ah...\" He stops for a moment, attempting to discern the gender of the androgynous-looking humanoid in front of him. \"Ah, or, person. We have an appointment with one Mr. Girun. I am here to petition the Urun, our mentor species, on behalf of all the Khas.\"","\n","^The receptionist looks down and taps on their screen. \"Girun, confirmed. Wait, you will.\" They gesture to the chairs.","\n","^\"Thank you, good, eh, person.\" Fanias turns about uncertainly and goes to sit down. You follow suit.","\n","^Seems like you'll be waiting here for a little while. You've been wondering...","\n",["ev","str","^What is a mentor species?","/str","/ev",{"*":".^.c-2","flg":20},"ev","str","^What did the Weld people do to the Khas?","/str","/ev",{"*":".^.c-3","flg":20},"ev","str","^Was Fanias' family harmed in the attack?","/str","/ev",{"*":".^.c-4","flg":20},"ev","str","^Why did the Urun want the Khas' fruit?","/str",{"CNT?":".^.c-3"},"/ev",{"*":".^.c-5","flg":21},"ev","str","^Can Fanias give more details about the Weld attack?","/str",{"CNT?":".^.c-3"},"/ev",{"*":".^.c-6","flg":21},"ev","str","^You have no more questions.","/str",{"CNT?":".^.c-3"},"/ev",{"*":".^.c-7","flg":21},{"c-2":["\n","^You've been wondering - what exactly is a mentor species? What makes Urun the Khas' mentor species?","\n","^Fanias frowns. \"We are... How would you put it... somewhat, less developed, than many of the other species in the galaxy. Whereas you all have space travel, we are still playing with our iron weapons and trying to figure out how you make this 'plas creet'.\" He taps the wall nearby.","\n","^\"That isn't to say we are any less noble than you lot, of course. Our knights are the finest in all the realm! Honorable both in and out of combat. And our ladies, oh, our fair ladies, the most courteous and well-mannered of any you may meet.\" He loses himself in thought for a moment.","\n","^\"The Urun are there to help us along on our journey!  They keep watch over all that happens on our world, Nidaroen, and ensure that we are treated fairly in the galaxy. And of course, they teach us things, when they feel the time is right. Such was the case just before the Welds attacked! Ahh, and we were so close to having the upper hand...\" He shakes his fist.","\n",{"->":".^.^"},{"->":".^.^.^.^.g-3"},{"#f":5}],"c-3":["\n","^You ask what the Weld people did to the Khas.","\n","^\"Those scoundrels!\" Fanias looks instantly angry. \"They attacked us, without warning, in the middle of the night. In the midst of some negotiations with the Urun over our fruit harvest, no less! What utter boors, interrupting a meeting with our mentor species. No doubt this information will also help our case.\"","\n","^Fanias continues, \"The negotiation was going incredibly well, too. We had them on the ropes! A transfer of technology to us in exchange for just 10% of the harvest, what a deal! Ah, but then, the Welds attacked. We were so close.\"","\n","^\"My father...\" Fanias looks down. This is the first time you've seen him look sad. \"And my mother... Will I ever have vengeance for them?\"","\n",{"->":".^.^"},{"->":".^.^.^.^.g-3"},{"#f":5}],"c-4":["\n","^\"Yes, that's right. My mother was captured, and my father is missing, likely killed.\" Fanias face contorts in dramatic anguish. \"I will see my mother released, my father avenged. I must! The honor of the Khas depends on it!\"","\n",{"->":".^.^"},{"->":".^.^.^.^.g-3"},{"#f":5}],"c-5":["\n","^What is so special about the Khas' fruit that the Urun would want to trade for it?","\n","^Fanis smiles proudly. \"The Khas' fruit is special! It can only grow on Nidaroen, on the Khas' land. I've heard it's some combination of our sun, and the very air that we breathe?\" He frowns. \"I don't concern myself with the particulars. Regardless, it is one-of-a-kind.\"","\n","^He leans in. \"It can give one a certain... bliss.. if consumed in large quantities.\" He winks. \"Many a mind have been opened by our fruit.\"","\n",{"->":".^.^"},{"->":".^.^.^.^.g-3"},{"#f":5}],"c-6":["\n","^You ask for more details on the Weld attack. What was it like? How did they get in?","\n","^\"Those scoundrels!\" He says again, twice as furious. \"Those blackguards! In the middle of the night! One can scarcely believe the audacity! They are sly as a snake, and twice as... twice as... horrible!\"","\n","^Fanias goes on at length. Eventually, he runs out of insults.","\n","^\"Those toads somehow snuck into the Khas' keep, under the cover of night. Inside sabotage seems the most likely culprit, but who can know with such meddlesome curs? We have no idea how they got there, either! We are always ready for the spectre of war, and we heard no reports of troop movement.\" Fanias is fuming.","\n",{"->":".^.^"},{"->":".^.^.^.^.g-3"},{"#f":5}],"c-7":["\n",{"->":".^.^.^.^.g-3"},{"#f":5}],"#f":5,"#n":"questions"}],{"#f":5}],"g-3":["^You sit for a moment, absorbing what you have heard. Fanias is mercifully quiet.","\n","^After a few moments, the receptionist walks over. Fanias jumps out of his seat. \"At last! Take us to Girun.\"","\n","^\"No Girun.\" The receptionist shakes their head. \"Girun, busy. Reschedule, we shall.\"","\n","^\"Reschedule!?\" Fanias looks about ready to explode. \"Listen here, you, you, fat-head! I have waited two weeks already for the chance for an audience, and you tell me Girun wishes to reschedule? This must be a misunderstanding! I am a prince! Justice cannot wait! This is an outrage! This is -\"","\n","ev","str","^Continue","/str","/ev",{"*":".^.c-8","flg":20},{"c-8":["\n",{"->":".^.^.^.g-4"},{"#f":5}],"#f":5}],"g-4":["^Suddenly, a bubble pops into existence around Fanias. His yelling is muffled. He pounds his hand on the bubble, and winces, expression pained. This stops him from yelling for a moment.","\n","^\"Quiet, necessary in the lobby.\" You catch a satisfied look on the receptionist's face.","\n","ev","str","^Reason with the receptionist. Try to get him out.","/str","/ev",{"*":".^.c-9","flg":20},"ev","str","^You're satisfied too.","/str","/ev",{"*":".^.c-10","flg":20},{"c-9":["\n","^Come on, surely this is a bit much, even for Fanias. You tell the receptionist that you'll make sure Fanias leaves - just let him out.","\n","^The receptionist looks dubious. \"Quietly?\" You nod, looking at Fanias. He nods too, reluctantly.","\n","^The receptionist waves their hand, and the bubble pops. Fanias grits their teeth. \"Fine. We will reschedule. But it had better be soon.\"","\n","^\"Soon, it will be.\" The receptionist nods. \"Message from us, soon.\"","\n",["ev","str","^Exit the embassy.","/str","/ev",{"*":".^.c-0","flg":20},{"c-0":["\n","ev","str","^urun_outdoor","/str",{"f()":"change_background"},"pop","/ev","\n","^You exit the embassy, Fanias in tow, muttering under his breath. The receptionist makes sure you exit the building, then shuts the doors behind you.","\n",{"->":".^.^.^.^.^.g-5"},{"#f":5}]}],{"#f":5}],"c-10":["\n","^Honestly... Fanias could do with a bit of humility. You don't protest.","\n","^The bubble rises off the floor a little bit and then starts heading for the door with Fanias inside. He starts yelling anew. You can't quite make out any words, but you're sure he's saying a lot of stuff about \"injustice\" and \"dastards\".","\n",["ev","str","^Continue.","/str","/ev",{"*":".^.c-0","flg":20},{"c-0":["\n",{"->":".^.^.g-0"},{"#f":5}],"g-0":["ev","str","^urun_outdoor","/str",{"f()":"change_background"},"pop","/ev","\n","^When the bubble is fully outside, it pops, and he is deposited on the floor. He staggers and manages to catch himself, falling to one knee.","\n","^\"Those... blackguards...\" His voice is hoarse from yelling. \"I can... not believe this utter rudeness.\"","\n","^He takes a moment to regain his balance, and then ","<>","\n",{"->":".^.^.^.^.^.g-5"},{"#f":5}]}],{"#f":5}],"#f":5}],"g-5":["ev",{"CNT?":".^.^.g-4.c-9"},"/ev",[{"->":".^.b","c":true},{"b":["^He",{"->":".^.^.^.4"},null]}],"nop","^ sits down on the steps outside. \"I don't understand. Things were not supposed to turn out like this. The Urun are the very species that is meant to guide our way. They should be helping me! Do they not see the righteousness of my cause?\"","\n","^Fanias looks utterly despondent. \"My brother, in hiding. My mother, captured. My father, slain, by the Weld. And it seems the Urun are utterly unhelpful. Our family name... The burden is all mine.\"","\n","^He looks at you desperately. \"You are my only hope. I know we have only just met a few days ago, but I feel utterly alone. Where else can I turn? What should I do?\"","\n","ev","str","^Be encouraging.","/str","/ev",{"*":".^.c-11","flg":20},"ev","str","^Be realistic.","/str","/ev",{"*":".^.c-12","flg":20},"ev","str","^Be harsh.","/str","/ev",{"*":".^.c-13","flg":20},{"c-11":["\n","^You sit down next to him and pat him on the shoulder. Things will turn out well, you say. He's not alone; you'll help him as best you can.","\n","^Fanias seems to take some heart from your words. \"Thank you. You are truly a good person. The Urun could stand to be more like you.\"","\n",{"->":".^.^.^.g-6"},{"#f":5}],"c-12":["\n","^You sit down with him. He has to be realistic, you say. There's not much more he can do. He'll have to wait for the next meeting with the Urun, and pray that they'll help him. It's the only chance he's got.","\n","^\"Perhaps... perhaps you're right.\" He looks a little put out by your words, but seems to take some comfort in them. \"Perhaps waiting is the best I can do. It simply does not feel like enough, when your people are scattered to the wind, your family taken hostage.\"","\n",{"->":".^.^.^.g-6"},{"#f":5}],"c-13":["\n","^You look down at him, meeting his eyes. There's nothing he can do about it. He should probably forget about his family and start a new life here, on Nova Station. He has plenty of privilege to use.","\n","^Fanias looks a little shocked by the suggestion. \"That... Is that truly your advice? Truth be told, it is something that had crossed my mind, but...\"","\n",{"->":".^.^.^.g-6"},{"#f":5}],"#f":5}],"g-6":["^Fanias looks down, and is silent for a moment. He seems to gather resolve from somewhere, his gaze hardening.","\n","^\"","ev",{"CNT?":".^.^.g-5.c-13"},"/ev",[{"->":".^.b","c":true},{"b":["^Perhaps you're right, but - no. I will not stand by idly. I will find a way to rescue my family. Justice will be done. I will continue fighting. ",{"->":".^.^.^.7"},null]}],"nop","ev",{"CNT?":".^.^.g-5.c-12"},"/ev",[{"->":".^.b","c":true},{"b":["^ I will wait for the Urun, but not for long. I must keep fighting for what I know is right. ",{"->":".^.^.^.12"},null]}],"nop","^Please.\" He looks at you sharply. \"Help me find justice. I know it is not much, in the grand scheme of things. But I know you agree. It is not right for one's people to simply cease to be. Please help me, in whatever way you can.\"","\n","ev","str","^Accept.","/str","/ev",{"*":".^.c-14","flg":20},"ev","str","^Accept, grudgingly.","/str","/ev",{"*":".^.c-15","flg":20},{"c-14":["\n","^Very well, you say. His plea seems heartfelt, even more so than the last one. You'll see what you can do.","\n",{"->":".^.^.^.g-7"},{"#f":5}],"c-15":["\n","^Fine, you say. You may not like the guy very much, but this plea seems heartfelt, even more so than the last one. You'll see what you can do.","\n",{"->":".^.^.^.g-7"},{"#f":5}],"#f":5}],"g-7":["^\"Thank you.\" Fanias nods. \"Thank you. That's all I can ask.\"","\n","ev","str","^Leave.","/str","/ev",{"*":".^.c-16","flg":20},{"c-16":["\n",{"->":".^.^.^.g-8"},{"#f":5}],"#f":5}],"g-8":["^. . .","\n","ev","str","^train","/str",{"f()":"change_background"},"pop","/ev","\n",{"->t->":"Train"},"^You muse on the way the Urunian embassy treated you and Fanias. What is happening there? You thought for sure that they'd make time to see the prince of their client species. You didn't expect them to treat him with such disrespect.","\n","ev","str","^You feel bad for Fanias.","/str","/ev",{"*":".^.c-17","flg":20},"ev","str","^He's getting what he deserves.","/str","/ev",{"*":".^.c-18","flg":20},{"c-17":["\n","^You feel bad for Fanias. He might be a bit uppity, but he didn't deserve to be treated that way. And he really did seem put out, there, at the end.","\n",{"->":".^.^.^.g-9"},{"#f":5}],"c-18":["\n","^Fanias is just getting what he deserves. He needs to learn to be more humble. That's the only way he's going to get people to help him.","\n","^And, admittedly, he was a little more humble there, at the end, asking you for help.","\n",{"->":".^.^.^.g-9"},{"#f":5}],"#f":5}],"g-9":["^You think about how you might help. You're not sure if messaging your father's friend again will get you anywhere. Instead, you send a message to the head of the housing block, asking him if he has any thoughts on how Fanias might find some aid. Hopefully that yields some results.","\n",{"->t->":"Visit"},"ev","void","/ev","->->",{"#f":5}]}],{"#f":1}],"Third":[["ev","str","^cafeteria","/str",{"f()":"change_background"},"pop","/ev","\n",{"->t->":"Cafeteria"},"ev","str","^Look for Fanias.","/str","/ev",{"*":".^.c-0","flg":20},{"c-0":["\n",{"->":".^.^.g-0"},{"#f":5}],"g-0":["^Shading your eyes from the overhead lights, you scan the crowd. Ah - there's Fanias. It looks like he's speaking enthusiastically with another person.","\n","^You make your way over and greet Fanias. \"There you are, friend!\" He exclaims to you.","\n","^\"Greetings,\" the other person says, rising. They're slim, with a narrow face and a ponytail. \"I am named Tress. Please use she when referring to me.\"","\n","^Tress gestures. \"Please, sit down. Fanias was just regaling me with tales of how things are, back home on Nidaroen.\" At this last bit, Tress has a slightly ironic smile on. You're not sure what to make of that.","\n","ev","str","^Continue","/str","/ev",{"*":".^.c-1","flg":20},{"c-1":["\n",{"->":".^.^.^.g-1"},{"#f":5}],"#f":5}],"g-1":["^Fanias is beaming. \"I must tell you again, it is so good to run into someone from our home planet! Even if you have been... long estranged.\"","\n","^\"By choice, I remind you.\" Tress nods. \"I found my way to Nova Station long ago.\"","\n","^Fanias frowns. \"Yes well, I understand, but still, home is home! Surely you will make your way back there at some point. Do you not remember the great harvest? Why, I remember when I was just a lad...\"","\n","ev","str","^Cut Fanias off.","/str","/ev",{"*":".^.c-2","flg":20},"ev","str","^Let him go on.","/str","/ev",{"*":".^.c-3","flg":20},{"c-2":["\n","^Okay, enough of that. You cut in - earning a glare from Fanias - and ask Tress: Why did she leave Nidaroen?","\n","^\"Oh,\" she says, waving her hand, \"a bit of wanderlust, I suppose. I never much was for staying in one place. But I still occasionally pay attention to the news coming from Nidaroen, and I think I know what's going on with the Khas.\"","\n","^Fanias jumps on the last bit. \"What do you mean, you 'know what's going on'? ","<>","\n",{"->":".^.^.^.g-2"},{"#f":5}],"c-3":["\n","^You don't say anything, letting Fanias go on for a moment about his nostalgic childhood. But it's not long before Tress finds an opportunity to jump in.","\n","^\"Now that your friend is here, why don't we discuss the matter at hand?\" She says. \"I've been paying attention to the news coming out of Nidaroen. I know about the Welds' attack, and I have some information you may find interesting.\"","\n","^Fanias leans back, narrowing his eyes. \"What do you mean, information? ","<>","\n",{"->":".^.^.^.g-2"},{"#f":5}],"#f":5}],"g-2":["^The story is rather simple; the Welds, the barbarians, took us by surprise, and destroyed our kingdom in a fell swoop. I do not know what more information there could be.\"","\n","ev","str","^Is there more to the story?","/str","/ev",{"*":".^.c-4","flg":20},"ev","str","^You knew something seemed suspicious.","/str",{"CNT?":"Fanias.Second.0.g-2.questions.c-5"},{"CNT?":"Fanias.Second.0.g-2.questions.c-6"},"&&","/ev",{"*":".^.c-5","flg":21},{"c-4":["\n","^You ask, is there more to the story than Fanias knows?","\n","^Tress nods. \"The story only seems simple if you ignore the greater galactic context.\"","\n",{"->":".^.^.^.g-3"},{"#f":5}],"c-5":["\n","^Ah, you knew there was something suspicious about all this. The Welds, attacking in the middle of the night from an unknown vector, right as the Urunian negotiation over the fruit harvest was taking place... What is going on down on Nidaroen?","\n","^Tress raises her eyebrows. \"Smart. You've have been paying attention.\"","\n",{"->":".^.^.^.g-3"},{"#f":5}],"#f":5}],"g-3":["^\"Just to be clear... All of this is speculation. Officially, anyway.\" Tress leans forward, placing her elbows on the table. \"You know that fruit that the Khas grows? That aphrodesiac that, mysteriously, can only grow on Khas? Well, it's... rather in demand right now. A passing fad, if you will, among many of the younger generation around the galaxy.\"","\n","^\"With the galactic statues on primitive species, the fruit has to be smuggled out. The Urun see an opportunity here. Hence, the negotations you were involved in.\" She gestures at Fanias.","\n","ev","str","^So the Welds attacked for the fruit?","/str","/ev",{"*":".^.c-6","flg":20},"ev","str","^Stay silent.","/str","/ev",{"*":".^.c-7","flg":20},{"c-6":["\n","^So, you say, the Welds probably attacked the Khas to take control of the fruit export, for their own gain.","\n","^She tilts her head. \"Well, you're right... and you're wrong.\"","\n",{"->":".^.^.^.g-4"},{"#f":5}],"c-7":["\n","^Fanias jumps in. \"Those dastards! I knew the Welds wanted the fruit harvest! But still... I've been thinking about it.\" He crosses his arms. \"How did they get to the Khas capital so quickly? No technology of theirs could do so.\"","\n","^Tress nods, once, decisively. \"And that is where we get into the heavy speculation.\"","\n",{"->":".^.^.^.g-4"},{"#f":5}],"#f":5}],"g-4":["^\"Remember that the Urun aren't just the Khas' mentor species. They are the mentor species of all people on Nidaroen. They are supposed to keep the peace, ensuring that both the Khas and the Welds both thrive. But it is not unknown for such mentors to prioritize their own interests.\"","\n","^\"So -\" she raises her eyebrows. \"The Welds conduct a surprise attack, using technology they shouldn't have, during a negotiation that wasn't going well for the Urun. Where did they get the technology, or the information on the negotation?\"","\n","^\"Well - one might suspect that they did it at the Urun's request. One might suspect the Urun gave them some help with the ambush. Perhaps the Welds even expect a cut of the new exports.\"","\n","^She spreads her arms. \"The Urun vehemently deny all accusations of course, but what other conclusion can one draw?\"","\n","ev","str","^So that's why the Urun haven't wanted to meet with Fanias.","/str","/ev",{"*":".^.c-8","flg":20},{"c-8":["\n",{"->":".^.^.^.g-5"},{"#f":5}],"#f":5}],"g-5":["^You think, so that's why the Urun haven't wanted to meet with Fanias. You're about to say so, but Fanias cuts in first.","\n","^\"Those BASTARDS!\" Fanias' fist hits the table so hard that conversation around you stops for a moment, and everyone looks at him.","\n","^He ducks a little bit, and mutters, \"Ah... sorry. How uncouth of me. Please, go back to your food.\"","\n","^Slowly, conversation resumes. Fanias buries his head in his hands. \"All this time! All this time... One moment.\" He walks off for a bit, not leaving the room, just hovering by the door.","\n","^Tress watches him go. She almost seems amused.","\n",["ev","str","^Why isn't Tress trying to stop the Urun?","/str","/ev",{"*":".^.c-9","flg":20},{"c-9":["\n","^Tress is from Khas, too. Why wouldn't she be trying to stop this blatant abuse of power by the Urun, like Fanias?","\n","^She shrugs. \"Not my problem. I left long ago. I barely even count myself as Khas anymore.\" She gestures at Fanias. \"Not like him. You'd think he'd be more free than I, coming from money and privilege and all that.\"","\n","^\"But you know what?\" She stretches her arms over her head. \"I almost pity him, bound by concepts like 'duty' and 'honor'. Way better to just forget about all of that. Make your own connections. Choose your own family.\"","\n",["ev","str","^That's irresponsible.","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^You kinda get it.","/str","/ev",{"*":".^.c-1","flg":20},{"c-0":["\n","^That's irresponsible, you say. If you take care of your family, they will take care of you, unconditionally. Your friends will only carry you so far before you become too heavy of a burden.","\n","^\"Is that right?\" She looks amused again. \"Must be why my family put me on the street after I told them I was a woman. Because I wasn't taking care of them enough, right?\"","\n","^\"Whatever,\" she says. ","<>","\n",{"->":".^.^.g-0"},{"#f":5}],"c-1":["\n","^You kinda get it. Family isn't everything. Much better to choose who you associate with, for your own reasons.","\n","^She nods decisively again. \"That's right. You can't trust family just because they're family. My friends are the ones who took me in after I became a woman. They sheltered me, gave me a new home. We would die for each other.\"","\n",{"->":".^.^.g-0"},{"#f":5}],"g-0":["^\"I get it. Fanias feels duty-bound to defend his family and his people. He can do what he wants, but I think he should give it up.\"","\n","^Hm. Tress has clearly been through a lot. Is Fanias' situation different?","\n",["ev","str","^It's more than duty. Fanias cares for his family.","/str","/ev",{"*":".^.c-2","flg":20},"ev","str","^The Urun are clearly still in the wrong.","/str","/ev",{"*":".^.c-3","flg":20},"ev","str","^Tress is right, Fanias should give it up.","/str","/ev",{"*":".^.c-4","flg":20},"ev","str","^Apologize to Tress before expressing your thoughts.","/str",{"CNT?":".^.^.^.c-0"},"/ev",{"*":".^.c-5","flg":21},{"c-2":["\n","^You're sorry for all that Tress has been through, you say, but Tress' and Fanias' circumstances are clearly different. Fanias has family that he wants to save, back on Nidaroen. And it's more than duty; he cares for them. Shouldn't he fight for them?","\n","^Tress looks doubtful. \"Perhaps. To be honest, I don't see much use in it. He's clearly outmanned, and outgunned. Going up against a mentor species, as the primitives they are? I can't see them winning.\"","\n","^\"I'd help him make a new life here, on Nova Station. I did it. He can too.\"","\n",{"->":"Fanias.Third.0.g-6"},{"#f":5}],"c-3":["\n","^You're sorry for all that Tress has been through, you say, but still - the Urun are clearly in the wrong. They're abusing their power, using it to take away the rights of a whole species. Fanias should keep up his fight.","\n","^Tress shrugs. \"Sure, I support his crusade, nominally. But the more you study history, the more you realize - your struggle is just one among many, in an unending fractal of struggles. And, rather depressingly, that fractal is hugely unbalanced in the favor of those who are more powerful.\"","\n","^\"Maybe that sounds too nihilistic. But I dunno.\" She shakes her head. \"You only get one life, and you should live it as best you can. Why give it up to a useless fight?\"","\n",{"->":"Fanias.Third.0.g-6"},{"#f":5}],"c-4":["\n","^Hm, you muse. Perhaps it wouldn't be such a thing if Fanias gave up the fight. That maybe it's better for him to find his own way, separate from his people, like Tress did.","\n","^Tress spreads her arms. \"And now you are enlightened.\"","\n",{"->":"Fanias.Third.0.g-6"},{"#f":5}],"c-5":["\n","^Before you express your thoughts on Fanias, you apologize to Tress. You shouldn't have called her irresponsible before knowing her situation.","\n","^She looks thoughtful. \"A lot of people treat family as this immutable thing, an unbreakable bond. It's just... not like that, for a lot of people. For most, sure. But not everyone.\" She sighs. \"I accept your apology. And thanks.\"","\n",{"->":".^.^"},{"->":"Fanias.Third.0.g-6"},{"#f":5}],"#f":5,"#n":"situation"}],{"#f":5}]}],{"#f":5}],"#f":5,"#n":"questions"}],{"#f":5}],"g-6":["ev","str","^Continue","/str","/ev",{"*":".^.c-10","flg":20},{"c-10":["\n",{"->":".^.^.^.g-7"},{"#f":5}],"#f":5}],"g-7":["^Fanias returns to the table. He looks a little calmer.","\n","^\"Tress,\" he says, \"I thank you for coming to me with this invaluable information. I think... I think I must take some time to consider my next actions. May I contact you again soon?\"","\n","^Tress shrugs. \"Sure, why not. Might be fun.\"","\n","ev","str","^Remind Fanias that the housing block is closing soon.","/str","/ev",{"*":".^.c-11","flg":20},{"c-11":["\n",{"->":".^.^.^.g-8"},{"#f":5}],"#f":5}],"g-8":["^You remind Fanias that he might not have too much time to consider his next move, since the housing block is closing soon.","\n","^\"Don't worry about that, friend,\" he says, resolutely. \"I will find my own way. I am a prince, after all.\"","\n","ev","str","^Leave.","/str","/ev",{"*":".^.c-12","flg":20},{"c-12":["\n",{"->":".^.^.^.g-9"},{"#f":5}],"#f":5}],"g-9":["^. . .","\n","ev","str","^train","/str",{"f()":"change_background"},"pop","/ev","\n",{"->t->":"Train"},"^As you ride the train, you think back on your interaction with Tress, specifically on the point you made: ","ev",{"CNT?":".^.^.g-5.questions.c-9.7.g-0.situation.c-2"},"/ev",[{"->":".^.b","c":true},{"b":["^ Fanias cares about his family, and he should try his best to rescue them.",{"->":".^.^.^.16"},null]}],"nop","^ ","ev",{"CNT?":".^.^.g-5.questions.c-9.7.g-0.situation.c-3"},"/ev",[{"->":".^.b","c":true},{"b":["^ the Urun are clearly in the wrong here, and they should be brought to justice.",{"->":".^.^.^.22"},null]}],"nop","^ ","ev",{"CNT?":".^.^.g-5.questions.c-9.7.g-0.situation.c-4"},"/ev",[{"->":".^.b","c":true},{"b":["^ the odds are too stacked against Fanias. He should give up his fight.",{"->":".^.^.^.28"},null]}],"nop","\n","^You think it over. What would you really do in his situation?","\n","ev","str","^Go back to the embassy and protest.","/str","/ev",{"*":".^.c-13","flg":20},"ev","str","^Find allies among other species to fight the Urun.","/str","/ev",{"*":".^.c-14","flg":20},"ev","str","^Go back to Nidaroen to organize a covert resistance.","/str","/ev",{"*":".^.c-15","flg":20},"ev","str","^Give up. Live among those at Nova Station.","/str","/ev",{"*":".^.c-16","flg":20},"ev","str","^Something else.","/str","/ev",{"*":".^.c-17","flg":20},{"c-13":["\n","^You would go back to the embassy and kick up a fuss. One so large that the Urun couldn't ignore it. Surely that would be enough to get someone's attention, anyone's.","\n",{"->":".^.^.^.g-10"},{"#f":5}],"c-14":["\n","^Clearly one person can only do so much. Perhaps the Urun have enemies that you'd be able to leverage into coercing them to behave.","\n",{"->":".^.^.^.g-10"},{"#f":5}],"c-15":["\n","^You would travel back to Nidaroen and gather the remnants of the Khas into a covert resistance. You'd do whatever it took to find vengeance; raid supply lines, burn the fruit orchards, overthrow the Welds.","\n",{"->":".^.^.^.g-10"},{"#f":5}],"c-16":["\n","ev",{"CNT?":".^.^.^.g-5.questions.c-9.7.g-0.situation.c-4"},"/ev",[{"->":".^.b","c":true},{"b":["^ You stand by what you said.",{"->":".^.^.^.5"},null]}],"nop","^ You would accept your lot, and pursue justice no further. You'd live a new life amongst the stars.","\n",{"->":".^.^.^.g-10"},{"#f":5}],"c-17":["\n","^Your thoughts on the matter are your own. You have your own plans for how you would handle this situation.","\n",{"->":".^.^.^.g-10"},{"#f":5}],"#f":5}],"g-10":[{"->t->":"Visit"},"ev","void","/ev","->->",{"#f":5}]}],{"#f":1}],"Farewell":[["ev","str","^train","/str",{"f()":"change_background"},"pop","/ev","\n","^You depart the spaceport, having said farewell to both LiYan and Yousef's family. Thoughts still swirl in your mind about their fates, and you can't wait to talk to your father about all that's happened.. But you still have one more farewell left to give.","\n","^You board the maglev, taking it away from the spaceport.","\n","ev","str","^...","/str","/ev",{"*":".^.c-0","flg":20},{"c-0":["\n","ev","str","^police_station","/str",{"f()":"change_background"},"pop","/ev","\n",{"->":".^.^.g-0"},{"#f":5}],"g-0":["^Some time later, you take a seat in a narrow booth. There is a small headset on the desk in front of you. You pick it up, put it on, and then look through the pane of resoglass at Fanias.","\n","^\"Hello, my friend.\" He's trying to be upbeat. \"I'm glad you could make it before you departed for Barakhun.\"","\n","ev","str","^What happened?","/str","/ev",{"*":".^.c-1","flg":20},{"c-1":["\n","^You get straight into it. They're not giving you much time to make this call. How did Fanias end up at the police station?","\n","^\"For fighting!\" he proclaims. \"For struggling for a righteous cause. For attempting to free my people. For these and more. Never fear - I am a prince, and they cannot keep me here forever.\"","\n","^Okay, you say, but what did he [i]do[/i]?","\n","^\"I, well, perhaps it is not wise to confess to my crime here. But, I suppose, they did catch me red handed.\" He looks a little sheepish.","\n","^\"I may have attempted to gain entrance into the Urun embassy on my own. Through, ah, a window. With a metal pole. Unfortunately, it seems that resoglass is somewhat more strong than the glass I am used to on Nidaroen.\"","\n",{"->":".^.^.^.questions"},{"#f":5}],"#f":5}],"questions":["ev","str","^That was unwise.","/str","/ev",{"*":".^.c-2","flg":20},"ev","str","^You understand.","/str","/ev",{"*":".^.c-3","flg":20},"ev","str","^Fanias... attempted violence?","/str","/ev",{"*":".^.c-4","flg":20},{"c-2":["\n","^That was not a wise thing to do. Especially the part where he got caught.","\n","^\"I'm not looking to be wise anymore, friend.\" He shakes his head.","\n",{"->":".^.^.^.g-1"},{"#f":5}],"c-3":["\n","^You get it. His family is trapped on Nidaroen, and the Urun are being spectacularly unhelpful. He's trying to get their attention in a way they can't ignore.","\n","^He nods. \"That's exactly it, friend! You do understand.\"","\n",{"->":".^.^.^.g-1"},{"#f":5}],"c-4":["\n","^Fanias attempted to violently break and enter? How did we get here?","\n","^Fanias looks hurt. \"Violence? Never! I did not hurt any person! I merely attempted to break a window. That is an inanimate object!\"","\n",{"->":".^.^"},{"->":".^.^.^.g-1"},{"#f":5}],"#f":5}],"g-1":["^\"Let us be serious. The Urun will never listen to me. If those who rule break the rules, then why should I also follow the rules? What have I to gain from being cowed into submission?\"","\n","^\"Nay.\" Fanias shakes his head. \"Better to fight, than give up. Better to live in glory than die in the darkness.\"","\n","ev","str","^How will Fanias get out?","/str","/ev",{"*":".^.c-5","flg":20},{"c-5":["\n",{"->":".^.^.^.g-2"},{"#f":5}],"#f":5}],"g-2":["^\"Do not worry about me. I have already contacted Tress. She has agreed to help me. I have my doubts that she will help me with the fight against the Urun, but that is no matter.\" He looks serious. \"I will find allies. And I will carry on the fight.\"","\n","^The police officer behind you taps you on the shoulder. Your time is up. That was absurdly short. But the officer looks stern, and gestures for you to get out.","\n","^Fanias sees this, and thumps his chest with a fist. \"Remember me, my friend! Remember Fanias, of the Khas. Remember that I did not give up, and never shall, as long as justice remains unserved!\"","\n","ev","str","^You will remember Fanias.","/str","/ev",{"*":".^.c-6","flg":20},{"c-6":["\n",{"->":".^.^.^.g-3"},{"#f":5}],"#f":5}],"g-3":["^You swear you'll remember him. You stand up, and exit the small booth.","\n","^As you're leaving the station, you see Tress standing at a desk, paying Fanias' bail. \"What's up?\" She asks casually.","\n","ev","str","^How did Fanias talk her into this?","/str","/ev",{"*":".^.c-7","flg":20},{"c-7":["\n",{"->":".^.^.^.g-4"},{"#f":5}],"#f":5}],"g-4":["^You ask, how did Fanias talk her into this? She seemed rather unsympathetic to him earlier.","\n","^Tress shrugs. \"","ev",{"CNT?":"Fanias.Third.0.g-5.questions.c-9.7.g-0.situation.c-2"},{"CNT?":"Fanias.Third.0.g-5.questions.c-9.7.g-0.situation.c-3"},"||","/ev",[{"->":".^.b","c":true},{"b":["^To be honest... wasn't him. It was you. Earlier, at the cafeteria.",{"->":".^.^.^.9"},null]}],"nop","^ ","ev",{"CNT?":"Fanias.Third.0.g-5.questions.c-9.7.g-0.situation.c-2"},"/ev",[{"->":".^.b","c":true},{"b":["^What you said about our situations being different - you're right. I can't judge him too harshly. I have people who I care about, and that I am willing to fight for. He should be able to care for his, too.",{"->":".^.^.^.15"},null]}],"nop","^ ","ev",{"CNT?":"Fanias.Third.0.g-5.questions.c-9.7.g-0.situation.c-3"},"/ev",[{"->":".^.b","c":true},{"b":["^You were right. The Urun are in the wrong, and he should be fighting against them. I doubt I'll join him -\" she shrugs - \"but, hey, I can contribute.",{"->":".^.^.^.21"},null]}],"nop","^ ","ev",{"CNT?":"Fanias.Third.0.g-5.questions.c-9.7.g-0.situation.c-4"},"/ev",[{"->":".^.b","c":true},{"b":["^ I think he's probably going to give up the fight soon. He'll need people around who can get him through that process.",{"->":".^.^.^.27"},null]}],"nop","^\"","\n","^\"Plus,\" she smiles bemusedly, \"He's just kind of an amusing person to keep around. It's kind of endearing how fast he went from 'spoiled prince' to 'radical window-breaker'.\"","\n","ev","str","^He's kind of amusing.","/str","/ev",{"*":".^.c-8","flg":20},"ev","str","^He's kind of annoying.","/str","/ev",{"*":".^.c-9","flg":20},"ev","str","^He's a good person.","/str","/ev",{"*":".^.c-10","flg":20},{"c-8":["\n","^You admit, he's kind of amusing.","\n","^She gives you a smile. \"Dunno if we'll be good friends or anything, but hey, hopefully he can keep it up.\"","\n",{"->":".^.^.^.g-5"},{"#f":5}],"c-9":["\n","^You shrug. Fanias is kind of annoying.","\n","^She laughs. \"Yeah, but that's what makes him amusing.\"","\n",{"->":".^.^.^.g-5"},{"#f":5}],"c-10":["\n","^Fanias... despite all the odds, is actually a good person.","\n","^She laughs. \"Yeah, maybe you're right. Trying to break into a courthouse is a good start to being a good person.\"","\n",{"->":".^.^.^.g-5"},{"#f":5}],"#f":5}],"g-5":["^Tress gives you a wave. \"Take care of yourself. Don't go breaking any windows, you hear?\"","\n","ev","str","^Leave.","/str","/ev",{"*":".^.c-11","flg":20},{"c-11":["\n","ev","void","/ev","->->",{"#f":5}],"#f":5}]}],{"#f":1}],"#f":3}],"Yousef":["ev",{"CNT?":".^"},"/ev",["du","ev",1,"==","/ev",{"->":".^.b","c":true},{"b":["pop","\n",{"->t->":"Yousef.First"},{"->":"Yousef.7"},null]}],["du","ev",2,"==","/ev",{"->":".^.b","c":true},{"b":["pop","\n",{"->t->":"Yousef.Second"},{"->":"Yousef.7"},null]}],["du","ev",3,"==","/ev",{"->":".^.b","c":true},{"b":["pop","\n",{"->t->":"Yousef.Third"},{"->":"Yousef.7"},null]}],[{"->":".^.b"},{"b":["pop","\n","^PROBLEM IN YOUSEF! ","done","\n",{"->":"Yousef.7"},null]}],"nop","\n","ev","void","/ev","->->",{"First":[["ev","str","^cafeteria","/str",{"f()":"change_background"},"pop","/ev","\n",{"->t->":"Cafeteria"},"ev","str","^Look for Yousef.","/str","/ev",{"*":".^.c-0","flg":20},{"c-0":["\n",{"->":".^.^.g-0"},{"#f":5}],"g-0":["^It's hard to spot anyone in this space. You shield your eyes from the overhead lights and start to scan the crowd.","\n","^Just then, you feel something ram into your legs. You stagger forward, but manage to catch your balance before you fall onto the people seated in front of you.","\n","^\"Oops!\" A little voice says, followed by a gruffer one: \"Banias! Now what did I tell you about running?\"","\n","ev","str","^Continue","/str","/ev",{"*":".^.c-1","flg":20},{"c-1":["\n",{"->":".^.^.^.g-1"},{"#f":5}],"#f":5}],"g-1":["^You turn around. A small girl gawks up at you, some ribbons in her hair. Behind her are two people. One is a man, just under middle age, with a large beard and wrapped hair. Alongside him is a woman, about the same age, with long brown hair.","\n","^\"I am so sorry,\" the woman says to you, then to the girl: \"Little Banias, say you're sorry to this person!\"","\n","^Banias hides her face shyly, then runs behind the man.","\n","ev","str","^Address the woman: It's fine, no harm done.","/str","/ev",{"*":".^.c-2","flg":20},"ev","str","^Address Banias: It's okay, you're not mad.","/str","/ev",{"*":".^.c-3","flg":20},{"c-2":["\n","^It's fine, really, you say. No need to have Banias apologize, you're fine.","\n",{"->":".^.^.^.g-2"},{"#f":5}],"c-3":["\n","^You talk to the girl hiding behind her father. It's fine, you say. You're not mad at all.","\n","^She peeks out a bit and smiles shyly but doesn't say anything.","\n",{"->":".^.^.^.g-2"},{"#f":5}],"#f":5}],"g-2":["^The woman sighs. \"The little one just can't help herself, sometimes. So much to see... Well. I'm glad you're alright.\"","\n","ev","str","^Ask if the man if he is Yousef.","/str","/ev",{"*":".^.c-4","flg":20},"ev","str","^Introduce yourself.","/str","/ev",{"*":".^.c-5","flg":20},{"c-4":["\n","^You address the man. Yousef Shammal?","\n","^\"Yes, I am he,\" Yousef says. \"And you must be the intern I am here to meet! So glad to meet you.\"","\n",{"->":".^.^.^.g-3"},{"#f":5}],"c-5":["\n","^You introduce yourself, and say you're an intern at the housing block.","\n","^\"Ah, the intern! I am Yousef,\" the man says. \"So glad to meet you.\"","\n",{"->":".^.^.^.g-3"},{"#f":5}],"#f":5}],"g-3":["^He holds out his arms. A hug?","\n","ev","str","^Accept the hug.","/str","/ev",{"*":".^.c-6","flg":20},"ev","str","^Accept the hug with hesitance.","/str","/ev",{"*":".^.c-7","flg":20},"ev","str","^Politely decline.","/str","/ev",{"*":".^.c-8","flg":20},{"c-6":["\n","^You accept the hug, and hug back. It's a nice hug! Though his beard is a bit scratchy.","\n",{"->":".^.^.^.g-4"},{"#f":5}],"c-7":["\n","^You accept the hug out of politeness, but you hold back a little bit, only using one arm. Yousef seems to detect your hesitance, and reciprocates. He gives you a quick squeeze and lets go.","\n",{"->":".^.^.^.g-4"},{"#f":5}],"c-8":["\n","^You step back a bit. Sorry, you say, you don't know them that well.","\n","^\"Ah, it is no problem! This is merely a custom among us, and you are under no obligation to follow it. Many different peoples here.\" He lets his arms fall.","\n",{"->":".^.^.^.g-4"},{"#f":5}],"#f":5}],"g-4":["^The woman also introduces herself. \"My name is Youmna.\" ","ev",{"CNT?":".^.^.g-3.c-6"},"/ev",[{"->":".^.b","c":true},{"b":["^ She gives you a big hug as well.",{"->":".^.^.^.5"},null]}],"nop","^ ","ev",{"CNT?":".^.^.g-3.c-7"},"/ev",[{"->":".^.b","c":true},{"b":["^ Instead of a hug, she offers you a handshake. You take it.",{"->":".^.^.^.11"},null]}],"nop","^ ","ev",{"CNT?":".^.^.g-3.c-8"},"/ev",[{"->":".^.b","c":true},{"b":["^ She stands there a little awkwardly, but smiling.",{"->":".^.^.^.17"},null]}],"nop","\n","ev","str","^Continue","/str","/ev",{"*":".^.c-9","flg":20},{"c-9":["\n",{"->":".^.^.^.g-5"},{"#f":5}],"#f":5}],"g-5":["^\"And you have already met Banias.\" She gestures behind Yousef, but - there's no one there.","\n","^\"What - Banias!?\" Youmna panicks for a moment, looking around, but then she relaxes and rolls her eyes. Banias has run off to join the queue for food.","\n","^Yousef sighs and walks over to her. He puts his large hands around her waist and picks her up, yelping, before settling her in his arms. She lets out a giggle, throwing her arms around her father.","\n","^You grab a tray and join them in the line for food. You're offered a choice of a couple of entrees.","\n",["ev","str","^Get the creamed doula and swirly grains.","/str","/ev",{"*":".^.c-10","flg":20},"ev","str","^Choose the boiled coyon and the oiled motato.","/str","/ev",{"*":".^.c-11","flg":20},"ev","str","^Ask the person serving how they're doing.","/str","/ev",{"*":".^.c-12","flg":20},{"c-10":["\n","^You are about to get the doula and grains when Banias gets your attention. She smiles mischeviously from her father's arms. \"Umm, I wouldn't get that. I like the motatoes better.\"","\n","^Well, at least it seems like she's gotten over her shyness. Will you reconsider?","\n",{"->":".^.^.^.^.g-6"},{"#f":5}],"c-11":["\n","^You are about to get the coyon and motato when Banias gets your attention. She smiles mischeviously from her father's arms. \"Umm, I wouldn't get that. I like the grains better.\"","\n","^Well, at least it seems like she's gotten over her shyness. Will you reconsider?","\n",{"->":".^.^.^.^.g-6"},{"#f":5}],"c-12":["\n","^You look at the wide person behind the counter. They look back. Hi, you say, How are you doing?","\n","^\"Just fine,\" they respond. \"Thank you for asking.\"","\n","^Banias says, \"Well, I'm doing just fine too! Thank you too.\" She gives a giggle. The person behind the counter smiles at her warmly, and puts another scoop of food on Yousef's tray.","\n",{"->":".^.^"},{"->":".^.^.^.^.g-6"},{"#f":5}],"#f":5,"#n":"food"}],{"#f":5}],"g-6":["ev","str","ev",{"CNT?":".^.^.g-5.food.c-10"},"/ev",[{"->":".^.b","c":true},{"b":["^ Stick with the doula and grains. ",{"->":".^.^.^.7"},null]}],[{"->":".^.b"},{"b":["^ Stick with the coyon and motato.",{"->":".^.^.^.7"},null]}],"nop","/str","/ev",{"*":".^.c-13","flg":20},"ev","str","^Change your mind. ","ev",{"CNT?":".^.^.g-5.food.c-10"},"/ev",[{"->":".^.b","c":true},{"b":["^ You want the coyon and motato. ",{"->":".^.^.^.19"},null]}],[{"->":".^.b"},{"b":["^ You want the doula and grains.",{"->":".^.^.^.19"},null]}],"nop","/str","/ev",{"*":".^.c-14","flg":20},{"c-13":["\n","^You nod to Banias, and thank her for the advice, but say that you're still partial to the ","ev",{"CNT?":".^.^.^.g-5.food.c-10"},"/ev",[{"->":".^.b","c":true},{"b":["^ doula and grains. ",{"->":".^.^.^.7"},null]}],[{"->":".^.b"},{"b":["^ coyon and motato.",{"->":".^.^.^.7"},null]}],"nop","\n","^Banias pouts. \"Well, I think you'll regret it!\"","\n",{"->":".^.^.^.g-7"},{"#f":5}],"c-14":["\n","^You thank Banias for the advice, and say well, maybe you will have the ","ev",{"CNT?":".^.^.^.g-5.food.c-10"},"/ev",[{"->":".^.b","c":true},{"b":["^ coyon and motato ",{"->":".^.^.^.7"},null]}],[{"->":".^.b"},{"b":["^ doula and grains",{"->":".^.^.^.7"},null]}],"nop","^ instead.","\n","^Banias smiles. \"You won't regret it!\"","\n",{"->":".^.^.^.g-7"},{"#f":5}],"#f":5}],"g-7":["^Yousef shakes his head and mutters, \"She picks up language like a sponge...\"","\n","^You have a moment of waiting in line before the next food window, where they're serving drinks. You could make some conversation.","\n","ev","str","^Ask them how their stay has been.","/str","/ev",{"*":".^.c-15","flg":20},"ev","str","^Let them dictate the conversation.","/str","/ev",{"*":".^.c-16","flg":20},{"c-15":["\n","^You ask Yousef and Youmna how their stay at the housing block has been.","\n","^They look at each other, smiling a little sadly. \"Comfortable,\" Youmna says, a little too enthusiastically. \"Comfortable enough!\"","\n","^Yousef agrees. \"This food is not what we are used to, but to have food is a blessing!\"","\n",{"->":".^.^.^.g-8"},{"#f":5}],"c-16":["\n","^You don't say anything, instead letting the others dictate the conversation.","\n","^\"Thank you for joining us,\" Yousef says. \"This food is not what we are used to, but to have food at all is a blessing!\"","\n",{"->":".^.^.^.g-8"},{"#f":5}],"#f":5}],"g-8":["^Banias jumps in. \"I like this food. I bet auntie Shireen and uncle Hamed would enjoy it too. Can we bring them some when we go back home?\"","\n","^Yousef and Youmna fall silent. The two, who were so welcoming earlier, now look incredibly awkward.","\n","ev","str","^Who are her aunt and uncle?","/str","/ev",{"*":".^.c-17","flg":20},"ev","str","^Best not to pry.","/str","/ev",{"*":".^.c-18","flg":20},{"c-17":["\n","^You decide to poke a little. Who are aunt Shireen and uncle Hamed?","\n",{"->":".^.^.^.g-9"},{"#f":5}],"c-18":["\n","^You decide it's best not to ask, but Banias decides to talk about it anyway. ","<>","\n",{"->":".^.^.^.g-9"},{"#f":5}],"#f":5}],"g-9":["^\"They are fathers's sister and mother's brother,\" Banias declares. \"They give good hugs and sometimes they bring me chocolate during the holiday. Once they gave me a stuffed bear. I can't wait to see them again.\"","\n","^\"Banias,\" Youmna says, haltingly. Then she stops. It's hard to describe her expression; some combination of anger and grief.","\n","^Yousef says to Youmna, \"My love, we'll be right back.\" He carries Banias with him, and gestures at you to follow.","\n",["ev","str","^Check on Youmna first.","/str","/ev",{"*":".^.c-19","flg":20},"ev","str","^Follow Yousef.","/str","/ev",{"*":".^.c-20","flg":20},{"c-19":["\n","^You say to Youmna, is everything alright?","\n","^\"I just...\" She stops, and looks away. \"No. Things are not ok. Please, leave me for a moment.\" She takes her tray and Yousef's, and walks away.","\n","^Yousef beckons to you, somewhat insistently.","\n",{"->":".^.^"},{"->":".^.^.^.^.package"},{"#f":5}],"c-20":["\n","^You follow Yousef, exiting the cafeteria and stopping just outside the door.","\n","^Banias seems to have realized that she has done something, and starts sniffling. \"Daddy, I want to see the rest of the family again. When can we see them?\"","\n","^\"Soon, my heart. Soon.\" Yousef pats her on the back, then he addresses you. \"Listen my friend, I'm sorry to cut this meeting short. I think it is best if we part ways for now so that I can have a chat with Banias. But before you go, I wished to ask you something.\"","\n","^\"I have a package that I wish to send back home, to Falas. Do you think you could accompany me to send this package?\"","\n",{"->":".^.^.^.^.package"},{"#f":5}],"#f":5,"#n":"recheck"}],{"#f":5}],"package":["ev","str","^What's in this package?","/str","/ev",{"*":".^.c-21","flg":20},"ev","str","^Why does he need you there?","/str","/ev",{"*":".^.c-22","flg":20},"ev","str","^Agree. You'll meet Yousef to send the package.","/str","/ev",{"*":".^.c-23","flg":20},{"c-21":["\n","^You inquire what is in this package.","\n","^Yousef says, \"I think Banias' idea has some merit. A small food package to the relatives I left at home could not go amiss. I have a few preserved things that I wish to send to them.\"","\n",{"->":".^.^"},{"->":".^.^.^.g-10"},{"#f":5}],"c-22":["\n","^You ask why Yousef needs you to be there.","\n","^\"You see,\" he smiles disarmingly, \"I haven't been outside the housing block much, and I could use some directions. And I would like a chance to chat with you more!\"","\n","^You suppose a little time without Banias interrupting might be a good idea.","\n",{"->":".^.^"},{"->":".^.^.^.g-10"},{"#f":5}],"c-23":["\n",{"->":".^.^.^.g-10"},{"#f":5}],"#f":5}],"g-10":["^\"Thank you, my friend. I'll send you the coordinates of the post office soon. And I am sorry, again, to have cut this meeting so short. But Youmna, well...\"","\n","^He smiles a little lopsidedly. \"She is strong, but even strong things may break, sometimes.\"","\n","ev","str","^Leave.","/str","/ev",{"*":".^.c-24","flg":20},{"c-24":["\n",{"->":".^.^.^.g-11"},{"#f":5}],"#f":5}],"g-11":["^. . .","\n","ev","str","^train","/str",{"f()":"change_background"},"pop","/ev","\n",{"->t->":"Train"},"^You sigh. You wonder if you acted properly in the meeting with Yousef and Youmna. They're clearly trying their best in a difficult situation.","\n","ev","str","^Perhaps you should have made sure Youmna was ok.","/str","/ev",{"*":".^.c-25","flg":20},"ev","str","^You're glad you left when Yousef told you to.","/str","/ev",{"*":".^.c-26","flg":20},{"c-25":["\n","^Yousef wanted to cut the meeting short, and he knows her better than you. But still, you wonder if you should have pushed yourself to stay a little longer, and make sure Youmna was ok. She was clearly pretty upset when Banias mentioned their relatives.","\n","^Well, hopefully you get a chance to check in with Youmna after you help Yousef deliver his package.","\n",{"->":".^.^.^.g-12"},{"#f":5}],"c-26":["\n","^Yousef seemed rather insistent that you leave. You guess that Yousef has dealt with whatever emotions Youmna is experiencing right now, and that he probably knows what's best.","\n","^Still. You wonder what's going on there. Hopefully you get a chance to ask him some questions after you help him deliver his package.","\n",{"->":".^.^.^.g-12"},{"#f":5}],"#f":5}],"g-12":[{"->t->":"Visit"},"ev","void","/ev","->->",{"#f":5}]}],{"#f":1}],"Second":[["ev","str","^market_station","/str",{"f()":"change_background"},"pop","/ev","\n","^\"Satna market.\" The PA echoes through the train. You step out into the maglev station.","\n","^Not many people know how old Nova Station actually is. Of course, most of the history can be found on the 'net, but much of it is poorly translated, from the days before the universal translator existed. One thing is for sure: the station is [i]old[/i]. It's been built up piecemeal by a mismash of races, some new to the galactic scene, some who have disappeared altogether.","\n","^Satna Market Station looks like it could have been built a millenia ago. The walls are dirty, built of chipped plascrete tiles in a style that has long fallen out of use, layered with graffiti and gum and who knows what else.","\n","^The elevator appears to be broken, so you take the stairs out of the station. Aluminum railings - [i]aluminum[/i]? In this era? - guide you up and outwards.","\n","ev","str","^Enter Satna market.","/str","/ev",{"*":".^.c-0","flg":20},{"c-0":["\n",{"->":".^.^.g-0"},{"#f":5}],"g-0":["ev","str","^market","/str",{"f()":"change_background"},"pop","/ev","\n","^The first thing you notice is that the market is dark. There is no artificial sky; the ceiling above simply displays the emptiness of space. Instead, lanterns, candles, lamps, and floodlights illuminate the space, individually placed by the owners of each stall.","\n","^And what stalls there are; you're currently standing at the corner of an intersection, and just from here, you can see clothing, notepads, toys, alcohol, power tools, transmitter chips, bioinic enhancements... the list goes on.","\n","^You wonder, briefly, whether the ceiling faces anti-starwards by chance or purpose. Did the builders of this place plan for the dark atmosphere? Or did a seedy market develop as a result of the darkness?","\n","^You're broken out of your reverie by a delicious smell. A more important question enters your mind: Is that fried ","ev",{"CNT?":"Yousef.First.0.g-6.c-13"},"/ev",[{"->":".^.b","c":true},{"b":["^doula",{"->":".^.^.^.20"},null]}],[{"->":".^.b"},{"b":["^motato",{"->":".^.^.^.20"},null]}],"nop","^?","\n",["ev","str","^Get some of whatever that is.","/str","/ev",{"*":".^.c-1","flg":20},"ev","str","^Look for Yousef.","/str","/ev",{"*":".^.c-2","flg":20},{"c-1":["\n","^You follow the strong scent and end up at a stall selling delicious-smelling fried spheres. The vendor gestures at you with their tentacles. A gruff voice emits from a beak. \"Five chits.\"","\n","^You pay, and the seller ladles some spheres into a container for you. \"First time at the market?\" they ask.","\n","^You nod. \"Some advice,\" they say. \"Don't look so lost. Less chance you'll get taken advantage of.\"","\n","^They hand you the box of food, and you thank them.","\n",{"->":".^.^"},{"->":".^.^.^.^.g-1"},{"#f":5}],"c-2":["\n","ev",{"CNT?":".^.^.c-1"},"!","/ev",[{"->":".^.b","c":true},{"b":["^ Best to stay on task. You ignore the smell.",{"->":".^.^.^.6"},null]}],"nop","\n",{"->":".^.^.^.^.g-1"},{"#f":5}],"#f":5,"#n":"market"}],{"#f":5}],"g-1":["^You set out, walking along the multifarious stalls, ","ev",{"CNT?":".^.^.g-0.market.c-1"},"/ev",[{"->":".^.b","c":true},{"b":["^ munching on the spheres,",{"->":".^.^.^.5"},null]}],"nop","^ keeping your eyes peeled for Yousef. It's a maze in here; the streets wind back and forth, curving this way and that.","\n","^Eventually, you find the Falasi at a street corner at a bizzare seven-way intersection.","\n","^\"Ah, hello friend!\" He greets you","ev",{"CNT?":"Yousef.First.0.g-3.c-6"},{"CNT?":"Yousef.First.0.g-3.c-7"},"||","/ev",[{"->":".^.b","c":true},{"b":["^, offering you a hug. You take it.",{"->":".^.^.^.17"},null]}],"nop","ev",{"CNT?":"Yousef.First.0.g-3.c-8"},"/ev",[{"->":".^.b","c":true},{"b":["^. He starts to offer you a hug, but then remembers that you'd rather not, and gives you a handshake instead.",{"->":".^.^.^.22"},null]}],"nop","^ \"Thank you for joining me. It's a great comfort that you're here.\"","\n","^He starts leading the way, and you follow. \"It's not much further from here. I just have to drop this off - \" he shrugs his shoulders, showing the large backpack he's carrying - \"to send to my relatives, back in Falas.\" He grins. \"Familiar with Falas?\"","\n","ev","str","^Yes. You heard about it in school.","/str","/ev",{"*":".^.c-3","flg":20},"ev","str","^You don't know much.","/str","/ev",{"*":".^.c-4","flg":20},{"c-3":["\n","^You nod. You've heard about the complicated conflict in school. The Yisuans and the Falasi can't decide how to partition the planet.","\n",{"->":".^.^.^.g-2"},{"#f":5}],"c-4":["\n","^You shake your head. You've seen news about the conflict between the Falasi and the Yisuans over partitioning the planet, but you're guessing the conflict is more complicated than you've heard.","\n",{"->":".^.^.^.g-2"},{"#f":5}],"#f":5}],"g-2":["^\"Yes, well.\" Yousef looks somewhat discomfited by this description. \"That is true. The situation is... difficult. And as you heard, I left some family back in Falas.\"","\n","^\"The Yisuans are starving them,\" he says matter-of-factly. \"There is no food, barely any water. When I can get a message through to my family, they are always complaining about how hungry they are. And still, they are being bombed. Every day more Falasi are killed, and -\"","\n","^Yousef stops. \"Anyway.\" He looks back at you, and smiles lopsidedly. \"That is why I must send them some food.\" He indicates the large backpack he's wearing.","\n","^He falls silent for a little while.","\n",["ev","str","^Ask about how they got out.","/str","/ev",{"*":".^.c-5","flg":20},"ev","str","^Ask about his thoughts on the conflict.","/str","/ev",{"*":".^.c-6","flg":20},"ev","str","^Ask about how Banias is coping.","/str",{"CNT?":".^.c-5"},{"CNT?":".^.c-6"},"&&","/ev",{"*":".^.c-7","flg":21},"ev","str","^Ask about how Youmna is coping.","/str",{"CNT?":".^.c-5"},{"CNT?":".^.c-6"},"&&","/ev",{"*":".^.c-8","flg":21},"ev","str","^Ask about how he is coping.","/str",{"CNT?":".^.c-5"},{"CNT?":".^.c-6"},"&&","/ev",{"*":".^.c-9","flg":21},"ev","str","^No more questions. Pay attention to where you're going.","/str",{"CNT?":".^.c-5"},{"CNT?":".^.c-6"},"&&","choiceCnt",0,">","&&","/ev",{"*":".^.c-10","flg":21},{"*":".^.c-11","flg":24},{"c-5":["\n","^Ask about how Yousef, Youmna, and Banias left Falas-Yisua.","\n","^\"Luck,\" Yousef says. \"Not everyone can read or speak as well as I can. We don't have these.\" He indicates your translation device. \"Yisua keeps them from us.\"","\n","^\"I was educated well, and have good connections from the translator job I held for many years. And so, when I heard that there was a chance to escape, I was one of the only ones able to read the message.\"","\n","^\"Even so, the process was labyrinthian. First, I had to gather a large sum of money. Then I had to take this money to a broker. Then that broker, he says, wait. Your name will appear on a list. So we waited, and waited. Then, a month later, our names appeared on the list, and we had to leave the very next day for the spaceport. So in a rush, we gathered our things, said goodbye to our relatives, and left.\"","\n","^He is silent for a moment. \"The swiftness of that leavetaking... it took a toll on us.\"","\n",{"->":".^.^"},{"->":".^.^.^.^.g-3"},{"#f":5}],"c-6":["\n","^You note that, earlier, he seemed a little discomfited by your description of the conflict. What does he think of it?","\n","^\"I am not sure you want to hear it.\" Yousef smiles lopsidedly again. \"Plus, I am a happy man, who enjoys describing happy things.\"","\n",["ev","str","^You do want to hear it.","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^Drop it.","/str","/ev",{"*":".^.c-1","flg":20},{"c-0":["\n","^You say that you really would be interested to hear it. Not much of it is reported on anymore. It seems like the news cycle has long since moved on.","\n","^\"Well.\" Yousef sighs. \"Let us start with this: these words you used earlier... 'Complicated' and 'conflict'. This is not how I would describe it.\"","\n","^\"Simple is how I would describe it. The Yisuans want our land, so they come in their ships, and make Falas unlivable for us. They bomb us, and starve us, and issue evacuation orders until we can't take it anymore. We, the Falasi people, who were living there for a thousand years. There was no Yisua until fifty years ago. There is no Falas-Yisua, there is only Falas.\"","\n","^\"And it is not a conflict. The Falasi don't even have space travel, did you know that? The news conveniently ignores this. The Yisuans, they have ships and bombs aplenty to drop on us. We have not the allies nor the technology to fight back. A conflict is a fight. This is not a fight. It is an occupation, a massacre.\"","\n","^\"The Yisuans see not a people in Falas. They see land, and an inconvenient problem to be solved. And so, the Falasi suffer.\"","\n","^Yousef falls silent.","\n",{"->":".^.^.g-0"},{"#f":5}],"c-1":["\n","^You decide to drop the topic.","\n",{"->":".^.^.g-0"},{"#f":5}],"g-0":[{"->":".^.^.^.^"},{"->":".^.^.^.^.^.^.g-3"},{"#f":5}]}],{"#f":5}],"c-7":["\n","^You ask about how Banias is coping with leaving Falas.","\n","^Yousef shrugs. \"Mostly by asking us about when she can go back. She misses our relatives dearly. But she is young. When we find stable ground, she will learn easily to accept peace.\"","\n",{"->":".^.^"},{"->":".^.^.^.^.g-3"},{"#f":5}],"c-8":["\n","^You ask about how Youmna is coping with leaving Falas.","\n","^\"Youmna...\" He falls silent for a moment. \"It has been difficult for her.\"","\n","^\"For a while, after we arrived at Nova Station, she stopped talking, you know.\" He looks away, and his shoulders tighten up. \"It took her two months to say anything other than a yes or a no. And even now, well...\"","\n","^\"You saw. She still cannot hear about Falas. She can't bear to think on our relatives that have been left behind.\"","\n",{"->":".^.^"},{"->":".^.^.^.^.g-3"},{"#f":5}],"c-9":["\n","^You ask you Yousef is coping with leaving Falas.","\n","^\"As I can.\" He gives the lopsided smile, the one you have come to identify as a blend of ruefulness, melancholy, and the weight of the world.","\n","^\"I still get messages, you know. From my relatives in Falas. 'We had nothing to eat today,' they say. 'God willing, you will soon,' I say. 'There is no medicine,' they say. 'Do not worry, all will be well,' I message back.\"","\n","^The smile has dropped away, replaced by a grim expression. \"What can I say? [i]What can I say?[/i] Nothing I say can make it better.\"","\n","^\"To tell you the truth... I do not think I should have left. I should have stayed, and helped.\" His fists tighten. \"Or at least to suffer with them.\"","\n",{"->":".^.^"},{"->":".^.^.^.^.g-3"},{"#f":5}],"c-10":["\n","^You stop asking questions and pay attention to where you're going.","\n",{"->":".^.^.^.^.g-4.wait"},{"->":".^.^.^.^.g-3"},{"#f":5}],"c-11":["\n",{"->":".^.^.^.^.g-3"},{"#f":5}],"#f":5,"#n":"questions"}],{"#f":5}],"g-3":["ev","str","^Wait a second, where are we?","/str","/ev",{"*":".^.c-12","flg":20},{"c-12":["\n",{"->":".^.^.^.g-4"},{"#f":5}],"#f":5}],"g-4":[["ev","str","^market_shady","/str",{"f()":"change_background"},"pop","/ev","\n","^Wait a second. You stop.","\n","^The hustle and bustle of the market has fallen away without you noticing, so absorbed you were in asking questions. You're on a dimly-lit alley between two big buildings. A flickering lamp overhead provides the only source of illumination. Somewhere, water is dripping from a pipe.","\n","^You didn't even know places like this existed in Nova Station. Where the hell has Yousef taken you?","\n","^You're about to confront Yousef when two blobs detach themselves from the wall nearby.","\n","ev","str","^Continue","/str","/ev",{"*":".^.c-13","flg":20},{"c-13":["\n",{"->":".^.^.^.^.g-5"},{"#f":5}],"#f":5,"#n":"wait"}],{"#f":5}],"g-5":["^They plop down onto the street with a wet sound, and from there, rise up, forming a vague pillar of what looks like goop. Small eye-stalks peer at you from the goop.","\n","^Are those... Norberians? What are they doing on Ring Six? You didn't know there were any here. This has gone from shady to ultra-shady.","\n","^The one on the left starts vibrating rhythmically, and though no sound emits from it, your translator helpfully starts translating. \"Payment, please.\" The words appear across your vision.","\n","ev","str","^Ask Yousef what the hell is going on.","/str","/ev",{"*":".^.c-14","flg":20},"ev","str","^Keep cool.","/str","/ev",{"*":".^.c-15","flg":20},{"c-14":["\n","^Yousef, you say. What the hell is going on?","\n","^\"I told you, I am sending a package to my relatives. Now please, treat our guests with respect.\" He smiles at the Norberians.","\n",{"->":".^.^.^.g-6"},{"#f":5}],"c-15":["\n","^Whatever is happening here, you probably won't help by panicking. You ","ev",{"CNT?":".^.^.^.g-0.market.c-1"},"/ev",[{"->":".^.b","c":true},{"b":["^ fold your hands in front of you",{"->":".^.^.^.7"},null]}],[{"->":".^.b"},{"b":["^have another of your fried spheres",{"->":".^.^.^.7"},null]}],"nop","^ and try to look like you know what you're doing.","\n",{"->":".^.^.^.g-6"},{"#f":5}],"#f":5}],"g-6":["^\"Ahem, about payment,\" Yousef says to the pillars of goo. \"I, well, did not bring quite the amount we agreed on. Couldn't quite find all the money, you see. Will two thousand chits do?\"","\n","ev",{"CNT?":".^.^.g-5.c-15"},"/ev",[{"->":".^.b","c":true},{"b":["^ You keep it cool, but internally you think: two [i]thousand[/i] chits? ",{"->":".^.^.^.7"},null]}],[{"->":".^.b"},{"b":["^ You choke a little bit. Two [i]thousand[/i] chits? ",{"->":".^.^.^.7"},null]}],"nop","^ That is way too much money to ship a package.","\n","ev","str","^Continue","/str","/ev",{"*":".^.c-16","flg":20},{"c-16":["\n",{"->":".^.^.^.g-7"},{"#f":5}],"#f":5}],"g-7":["^The Norberian on the left vibrates, a little anxiously, you think. \"We agreed on three thousand. Two thousand is not acceptable.\"","\n","^\"Well, I'm sure I could search my pockets for a little more...\" He fishes around in his pockets, and holds out a large amount of money. \"Ah, here we are! Two thousand and two hundred, right here, ready for you to take.\"","\n","^More vibration. \"Not acceptable. I remind you that what is happening here is not legal and we assume all risk. Two thousand seven hundred.\"","\n","ev","str","^Continue.","/str","/ev",{"*":".^.c-17","flg":20},{"c-17":["\n",{"->":".^.^.^.g-8"},{"#f":5}],"#f":5}],"g-8":["^\"Well,\" Yousef says, \"I only brought two thousand two hundred. And fifty.\" He finds a little bit more and holds it out. \"And I will make sure to refer some friends to you.\"","\n","^They go on like this for a little while. You ","ev",{"CNT?":".^.^.g-5.c-15"},"/ev",[{"->":".^.b","c":true},{"b":["^ pretend to keep your cool behind Yousef",{"->":".^.^.^.8"},null]}],[{"->":".^.b"},{"b":["^ nervously observe from behind Yousef",{"->":".^.^.^.8"},null]}],"nop","^.","\n","^You suddenly notice... Does the right Norberian have a [i]gun[/i] inside them? And... is the gun slowly exiting its body?","\n","ev","str","^Fish some money out.","/str","/ev",{"*":".^.c-18","flg":20},"ev","str","^Offer them some fried spheres.","/str",{"CNT?":".^.^.g-0.market.c-1"},"/ev",{"*":".^.c-19","flg":21},"ev","str","^Stay cool.","/str","/ev",{"*":".^.c-20","flg":20},{"c-18":["\n","^In a panic, you jump in. You fish out what money you have, holding out two hundred chits. Will this do?","\n","^Yousef shoots you a look, a mixture of exasperation and pain. Seems like he wanted to handle this negotation his own. But he looks back, and says, \"There you are. Two thousand six hundred and fifty. Final offer.\"","\n",{"->":".^.^.^.g-9"},{"#f":5}],"c-19":["\n","^In a panic, you jump in. You hold out the half-eaten box of fried spheres. Do they want some?","\n","^Yousef shoots you a look, a mixture of exasperation and pain. Seems like he wanted to handle this negotation his own. But he looks back, and says, \"There you are. Two thousand four hundred and fifty chits, and four fried spheres. Final offer.\"","\n",{"->":".^.^.^.g-9"},{"#f":5}],"c-20":["\n","^You stay silent. Clearly Yousef knows what he's doing with negotiations. And maybe that Norberian isn't getting ready to shoot you.","\n","^\"Final offer,\" Yousef shouts. \"Two-thousand four hundred and fifty! Or I go and find some other smugglers to take my package. There are plenty on the station.\"","\n",{"->":".^.^.^.g-9"},{"#f":5}],"#f":5}],"g-9":["^The Norberians merge together. Minute vibrations ensue, but your translator can't pick it up. Must be how they \"whisper\". You nervously watch the gun, getting ready to run at any moment","ev",{"CNT?":".^.^.g-5.c-15"},"/ev",[{"->":".^.b","c":true},{"b":["^, but try to keep your cool",{"->":".^.^.^.5"},null]}],"nop","^.","\n","ev","str","^Continue","/str","/ev",{"*":".^.c-21","flg":20},{"c-21":["\n",{"->":".^.^.^.g-10"},{"#f":5}],"#f":5}],"g-10":["^The Norberians separate, and the one on the right vibrates. \"Very well. That is enough.\"","\n","^A pile of goo emits from its body onto the floor. It waits expectantly. Yousef looks a little weirded out, but he places his backpack and his money in the pile. ","ev",{"CNT?":".^.^.g-8.c-18"},"/ev",[{"->":".^.b","c":true},{"b":["^ You hesitantly follow suit with your two hundred chits.",{"->":".^.^.^.7"},null]}],"nop","^ ","ev",{"CNT?":".^.^.g-8.c-19"},"/ev",[{"->":".^.b","c":true},{"b":["^ You hesitantly follow suit with your fried spheres.",{"->":".^.^.^.13"},null]}],"nop","\n","^It seems that this was the right thing to do. The Norberians deflate themselves, the money, and the backpack at the same time. The backpack looks like it's been vacuum-compressed. They begin slithering away, like fast slugs.","\n","^\"Expect delivery in two weeks,\" one of them vibrates as it leaves. \"A pleasure doing business. Remember to refer your friends.\"","\n","^They leave behind a quickly-disappearing trail of ooze.","\n","ev","str","^Okay, what the hell was that?","/str","/ev",{"*":".^.c-22","flg":20},{"c-22":["\n",{"->":".^.^.^.g-11"},{"#f":5}],"#f":5}],"g-11":["^You turn to Yousef and demand an explanation. What the hell just happened? You saw that they had a weapon.","\n","^Yousef shakes his head and looks away. \"Do you think it is easy to deliver a package to an active warzone? Through a blockade that Yisua says is for safety, but is, in truth, a mechanism to starve our people? Do you think I could do that at a post office, perhaps?\"","\n","^\"I will do anything to help my relatives. Gather a large amount of money, meet some possibly-dangerous smugglers in a dark alley...\" He shrugs. \"Deceive a friend into ensuring my safety.\"","\n","^He looks at you. \"Truth be told, it seems I would have been fine if I had come alone. But I wasn't sure if it was safe, and I was not about to ask Youmna or Banias to come with me. I hope you can forgive me.\"","\n",["ev","str","^He's allowing opportunists to make money off the war.","/str","/ev",{"*":".^.c-23","flg":20},"ev","str","^He should have told you the truth.","/str","/ev",{"*":".^.c-24","flg":20},"ev","str","^Smuggling is against the law.","/str","/ev",{"*":".^.c-25","flg":20},"ev","str","^You're not sure you forgive him.","/str",{"CNT?":".^.c-24"},{"CNT?":".^.c-25"},"||",{"CNT?":".^.c-23"},"||","/ev",{"*":".^.c-26","flg":21},"ev","str","^You forgive him.","/str","/ev",{"*":".^.c-27","flg":20},{"c-23":["\n","^Those Norberians are profiting off the war, and he's facilitating it, you say. You're not sure if he should allow that.","\n","^\"I told you. I will do [i]anything[/i] for my sister and brother.\" Yousef's face is grim. \"They are starving. Their children are starving. I feel it every day they message me, in my heart. I must do something to help them, even if it means that I line the pockets of those who do not deserve it.\"","\n",{"->":".^.^"},{"->":".^.^.^.^.g-12"},{"#f":5}],"c-24":["\n","^You ask him: why not just tell you that you were meeting some smugglers from the start?","\n","^\"Well,\" he looks at you. \"Truth be told, I was not sure if I could trust you.\"","\n",["ev","str","^The fact remains that he lied to you.","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^Let it go.","/str","/ev",{"*":".^.c-1","flg":20},{"c-0":["\n","^He lied to you, and you feel that your trust has been betrayed.","\n","^\"I never lied to you. I said I was delivering a package, and I was.\" Yousef looks apologetic. \"Perhaps I omitted some things. But I do not believe you would have come if I had told you. If I was wrong about that, then I am sorry.\"","\n",{"->":".^.^.g-0"},{"#f":5}],"c-1":["\n","^You let it go.","\n",{"->":".^.^.g-0"},{"#f":5}],"g-0":[{"->":".^.^.^.^"},{"->":".^.^.^.^.^.^.g-12"},{"#f":5}]}],{"#f":5}],"c-25":["\n","^He's breaking the law, and that is inherently wrong. No one is above the law.","\n","^\"No one? [i]No one[/i]?\" Yousef looks furious. \"How about the Yisuans? Are they above the law? Should they not be brought to justice for starving my people, my sisters and brothers? Should -\"","\n","^He breaks off, pauses. \"... There is no use in talking about this.\"","\n",{"->":".^.^"},{"->":".^.^.^.^.g-12"},{"#f":5}],"c-26":["\n","^You don't think his explanations are good enough. You're not sure if you forgive him.","\n","^Yousef nods. \"Very well. If your trust is the cost of relieving my family of their starvation, then so be it.\"","\n","^\"Let us at least head back to the station together. If you do not wish to see my face after that, then we will part ways afterward.\"","\n",{"->":".^.^.^.^.g-12"},{"#f":5}],"c-27":["\n","^You forgive him, you say. It's clear he feels an overwhelming sense of guilt. And if your family were starving, you would go to any length to help them out too.","\n","^Yousef nods. \"I'm glad you understand, my friend. The guilt... It truly is crushing. I wish I could be there to help them. I wish I had stayed.\"","\n","^He looks down for a moment, but then smiles his lopsided smile. \"Well then,\" he says, clapping you on the shoulder. \"No use in staying here any longer. Let us get back to the station.\"","\n",{"->":".^.^.^.^.g-12"},{"#f":5}],"#f":5,"#n":"forgive"}],{"#f":5}],"g-12":["ev","str","^Leave.","/str","/ev",{"*":".^.c-28","flg":20},{"c-28":["\n",{"->":".^.^.^.g-13"},{"#f":5}],"#f":5}],"g-13":["^You accompany Yousef back to the train station, passing through the market, both lost in your own thoughts.","\n","^. . .","\n","ev","str","^Continue","/str","/ev",{"*":".^.c-29","flg":20},{"c-29":["\n",{"->":".^.^.^.g-14"},{"#f":5}],"#f":5}],"g-14":["ev","str","^train","/str",{"f()":"change_background"},"pop","/ev","\n",{"->t->":"Train"},"^Your thoughts turn to today's adventure in Satna Market. You didn't expect to be in a back alley, doing shady deals with smugglers.","\n","^You feel...","\n","ev","str","^Resolved. Yousef is doing the right thing.","/str",{"CNT?":".^.^.g-11.forgive"},"/ev",{"*":".^.c-30","flg":21},"ev","str","^Conflicted. You're not certain if Yousef is doing the right thing.","/str","/ev",{"*":".^.c-31","flg":20},"ev","str","^Resolved. Yousef is not doing the right thing.","/str",{"CNT?":".^.^.g-11.forgive.c-26"},"/ev",{"*":".^.c-32","flg":21},"ev","str","^Afraid. You hope you don't get caught.","/str","/ev",{"*":".^.c-33","flg":20},{"c-30":["\n","^You feel resolved. You're actually glad you were able to help Yousef send that package. ","ev",{"CNT?":".^.^.^.g-11.forgive.c-23"},{"CNT?":".^.^.^.g-11.forgive.c-25"},"||",{"CNT?":".^.^.^.g-11.forgive.c-24"},"||","/ev",[{"->":".^.b","c":true},{"b":["^ Even though you still wish he'd told you the truth about why you were there, y",{"->":".^.^.^.11"},null]}],[{"->":".^.b"},{"b":["^Y",{"->":".^.^.^.11"},null]}],"nop","^ou feel really strongly that Yousef was doing the right thing in trying to get some food to his relatives.","\n",{"->":".^.^.^.g-15"},{"#f":5}],"c-31":["\n","^You feel a little conflicted. On one hand, Yousef feels very strongly about helping his relatives. On the other hand, there are so many reasons why doing it through smugglers is the wrong way about it, no matter his convictions.","\n",{"->":".^.^.^.g-15"},{"#f":5}],"c-32":["\n","^You feel resolved. Yousef should not be trying to get food to his family through smugglers.","\n",{"->":".^.^.^.g-15"},{"#f":5}],"c-33":["\n","^You're just afraid for yourself. You don't care about Yousef. He embroiled you in some shady business. You hope that you don't get caught.","\n",{"->":".^.^.^.g-15"},{"#f":5}],"#f":5}],"g-15":[{"->t->":"Visit"},"ev","void","/ev","->->",{"#f":5}]}],{"#f":1}],"Third":[["ev","str","^apartment","/str",{"f()":"change_background"},"pop","/ev","\n","^You stand before a plain plasteel door. The door has the numbers \"345\" embossed on the surface. A small doorbell is to the right.","\n","ev","str","^Ring on the doorbell.","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^Knock on the door.","/str","/ev",{"*":".^.c-1","flg":20},{"c-0":["\n","^You ring the doorbell. ","<>","\n",{"->":".^.^.g-0"},{"#f":5}],"c-1":["\n","^You ignore the doorbell and knock on the door. ","<>","\n",{"->":".^.^.g-0"},{"#f":5}],"g-0":["^Immediately, you hear small foosteps running towards you.","\n","^Someone fiddles with the doorhandle on the other side. After a few moments, you hear Banias shout, \"Mommy, help!\" It's a few more moments before the door opens and Youmna stands on the other side, smiling.","\n","^\"Ah, hello!\" She says. \"Please, come in.\"","\n","^\"Yes, please come in!\" Banias repeats, standing behind her.","\n","ev","str","^Step inside.","/str","/ev",{"*":".^.c-2","flg":20},{"c-2":["\n","^You step inside the apartment in that Yousef, Youmna, and Banias share.","\n","^The first thing you note is that it is quite well-kept. Surfaces and floors are clean. The couch, which faces a window, has only pillows and folded blankets on it. Toys are stored in a large bin kept alongside the wall. Even the few boxes that are packed, in preparation for the closing of the housing block, are tucked in a corner and taped shut.","\n","^Banias bounces around excitedly. \"Welcome to my house!\" She exclaims. \"Can I show you around?\"","\n","^Youmna looks on indulgently.","\n",{"->":".^.^.^.repeat"},{"#f":5}],"#f":5}],"repeat":["ev","str","^Accept the tour.","/str","/ev",{"*":".^.c-3","flg":20},"ev","str","^Decline.","/str","/ev",{"*":".^.c-4","flg":20},"ev","str","^You really have to talk to her mom.","/str",{"CNT?":".^.c-4"},"/ev",{"*":".^.c-5","flg":21},{"c-3":["\n","^\"Okay!\" She throws her arms wide excitedly. \"Here is our living room, where I play. And sometimes mommy reads me books there on the couch.\"","\n","^She walks to the left of the living room and opens the door. \"This is our bathroom. It is where we get clean. I love taking baths, especially when I get to bring my favorite toys with me.\"","\n","^She walks over to the right side and opens the door. \"This is our bedroom. Mommy and daddy and I sleep in there! Sometimes it gets too hot with all of us, and daddy sleeps on the couch.\"","\n","^She throws up her hands. \"And that is our house! Thank you for taking my tour.\"","\n",["ev","str","^Thank Banias for the tour.","/str","/ev",{"*":".^.c-0","flg":20},{"c-0":["\n","^You thank Banias for the lovely tour.","\n","^\"Of course! It was my pleasure,\" she says with a big smile.","\n",{"->":".^.^.^.^.^.g-1"},{"#f":5}]}],{"#f":5}],"c-4":["\n","^\"Pleaaase?\" Banias says. \"It will be a short one, I promise.\"","\n",{"->":".^.^"},{"->":".^.^.^.g-1"},{"#f":5}],"c-5":["\n","^Sorry, you say, you don't really have time for the tour. You need to talk to Banias' mom.","\n","^Banias just pouts and looks away, ignoring you.","\n",{"->":".^.^.^.g-1"},{"#f":5}],"#f":5}],"g-1":["^Youmna is smiling warmly. ","ev",{"CNT?":".^.^.repeat.c-5"},"/ev",[{"->":".^.b","c":true},{"b":["^ She shrugs. \"All the apartments are the same, Banias. Our friend here has probably seen them many times.\" Banias keeps pouting and flops down on the couch, arms crossed. ",{"->":".^.^.^.6"},null]}],[{"->":".^.b"},{"b":["^ \"Thank you for showing our guest around, Banias.\" ",{"->":".^.^.^.6"},null]}],"nop","\n","^\"Please, sit,\" Youmna says, addressing you. You take a seat on the couch. \"Is there anything I can get you? A tea, perhaps? Or some melon? We brought some up from the cafeteria the other day. It's not much, I'm sure you've had both before, but still..\" She trails off.","\n","ev","str","^A tea would be lovely.","/str","/ev",{"*":".^.c-6","flg":20},"ev","str","^The melon sounds nice.","/str","/ev",{"*":".^.c-7","flg":20},"ev","str","^Nothing for you, thanks.","/str","/ev",{"*":".^.c-8","flg":20},{"c-6":["\n","^A tea would be lovely, you say.","\n","^Youmna brightens up. She goes over to big jug and pours some tea out of it into a cup. She offers it to you, and you thank her.","\n","^It is indeed bog-standard cafeteria tea, but you sip it politely.","\n","^\"And for you too, my love,\" Youmna says, offering Banias a cup with a very small amount of tea so she doesn't spill it. Banias rather uncharacteristically blows it and waits for it to cool. Seems she's burned her tongue before.","\n",{"->":".^.^.^.g-2"},{"#f":5}],"c-7":["\n","^Youmna brightens up. She goes over a small refrigerator and places some melon slices on a plate. She puts the plate on a side table, and you take a slice.","\n","^It is indeed a completely normal cafeteria melon slice, but you eat it politely. Banias takes one too, eating it with great gusto.","\n",{"->":".^.^.^.g-2"},{"#f":5}],"c-8":["\n","^No thank you, you say politely. You don't need anything right now.","\n","^Youmna nods, a little hesitantly. Banias jumps in: \"Well, I would like a tea, please!\"","\n","^Youmna brightens up. She goes over to big jug and pours a very small amount of tea into a cup. She offers it to Banias, who - surprisingly patiently - blows it and waits for it to cool. Seems she's burned her tongue before.","\n",{"->":".^.^.^.g-2"},{"#f":5}],"#f":5}],"g-2":["^\"I'm afraid Yousef is out right now,\" Youmna says. \"Were you looking for him for anything in particular?\"","\n","ev","str","^Nothing in particular.","/str","/ev",{"*":".^.c-9","flg":20},{"c-9":["\n",{"->":".^.^.^.g-3"},{"#f":5}],"#f":5}],"g-3":["^Nothing in particular, you say. And you're not here to look for Yousef specifically. You're here to check in with the family.","\n","^\"Ah, well, we are doing just fine. All is well. We go to the cafeteria to eat, and we go to the park to walk once in a while. Banias loves watching the fishes.\"","\n","^\"Yesterday we saw a bird!\" Banias says excitedly. Youmna smiles at her.","\n","^\"Ah, and as you can see, we are preparing for... for, the move.\" She gestures to the boxes.","\n",["ev","str","^Ask her about how packing is going.","/str","/ev",{"*":".^.c-10","flg":20},"ev","str","^Ask her about what New Tarnaeum is like.","/str","/ev",{"*":".^.c-11","flg":20},"ev","str","^Ask her about how she's feeling about permanent resettlement.","/str",{"CNT?":".^.c-11"},"/ev",{"*":".^.c-12","flg":21},{"c-10":["\n","^You ask Youmna about how packing for their move to New Tarnaeum is going.","\n","^\"Well, it is hard work. But we do not have many things, so we are almost done. And it is a blessing that we will have somewhere to settle. Especially after...\" She stops ","ev",{"CNT?":".^.^"},1,">","/ev",[{"->":".^.b","c":true},{"b":["^ again",{"->":".^.^.^.11"},null]}],[{"->":".^.b"},{"b":["^for a moment. Then she seems to change her mind about what she was about to say",{"->":".^.^.^.11"},null]}],"nop","^. \"It is a blessing. And we are almost all the way through. We do not have many things to pack, after all.\"","\n",{"->":".^.^"},{"->":".^.^.^.^.g-4"},{"#f":5}],"c-11":["\n","^You ask Youmna what New Tarnaeum is like.","\n","^She thinks for a moment. \"Well, we have not been there, of course. But from what I have heard, it is quite rainy. Not at all like...\" She stops ","ev",{"CNT?":".^.^"},1,">","/ev",[{"->":".^.b","c":true},{"b":["^ again ",{"->":".^.^.^.11"},null]}],[{"->":".^.b"},{"b":["^ for a moment. Then she seems to change her mind about what she was about to say",{"->":".^.^.^.11"},null]}],"nop","^. \"We have not been there. But it is a blessing to have been accepted for permanent resettlement at all. God willing, all others who still wait may be blessed so as well.\"","\n",{"->":".^.^"},{"->":".^.^.^.^.g-4"},{"#f":5}],"c-12":["\n","^You ask Youmna how she's feeling about permanent resettlement. Will she miss Falas?","\n","^\"I will miss Falas.\" Youmna is not the one who says this - it's Banias. She follows this up, with a small voice: \"When will we see aunt and uncle again?\"","\n",{"->":".^.^.^.^.g-4"},{"#f":5}],"#f":5,"#n":"move"}],{"#f":5}],"g-4":["^For a few moments, the room is silent. Banias knows she has done something naughty, you think. She sits quietly on the couch, eyes down.","\n","^Youmna is breathing slowly. You can tell she is controlling it. She breathes, in, and out. She closes her eyes. Then - she seems to make a decision.","\n","ev","str","^Continue","/str","/ev",{"*":".^.c-13","flg":20},{"c-13":["\n",{"->":".^.^.^.g-5"},{"#f":5}],"#f":5}],"g-5":["^\"Banias, my heart,\" Youmna says. \"Is it alright if you leave the room? Go to the bedroom, for a little while. Take your toys with you.\"","\n","^Banias looks sad. \"Are you going to have a cry, mommy?\"","\n","^\"I - no, my love.\" Youmna breathes in and out. \"I simply want to have a chat with our friend here.\"","\n","^Banias nods, and selects a couple of toys to take with her. \"Have a good chat.\" She closes the door.","\n","^Youmna breathes out.","\n","ev","str","^Is Youmna alright?","/str","/ev",{"*":".^.c-14","flg":20},"ev","str","^Stay silent.","/str","/ev",{"*":".^.c-15","flg":20},{"c-14":["\n","^You are concerned. You ask if Youmna is feeling alright.","\n",{"->":".^.^.^.g-6"},{"#f":5}],"c-15":["\n","^You stay silent, and wait for Youmna to speak.","\n",{"->":".^.^.^.g-6"},{"#f":5}],"#f":5}],"g-6":["^She breathes in and out a few more times, then begins speaking.","\n","^\"I don't know if Yousef told you. About me. I did not speak for several months after we got here, from Falas.\" She breathes. \"It wasn't that I couldn't, you know. It's not like I was hysterical. I was very rational.\"","\n","ev","str","^Continue","/str","/ev",{"*":".^.c-16","flg":20},{"c-16":["\n",{"->":".^.^.^.g-7"},{"#f":5}],"#f":5}],"g-7":["^\"No, I could speak. I could speak, but I did not wish to. What would I speak of?\"","\n","^\"The houses, once proud, reduced to rubble?\"","\n","^\"My friends who were sick and could not receive medical attention, because the hospitals had all been bombed?\"","\n","^\"The children I saw, bleeding in the street, shot by snipers?\"","\n","^Her face is cold, a mask. \"I did not speak, because I had nothing good to say. Nothing would come from my mouth, but rage. It seems there is still rage there. I bury it deep. For Yousef, and for Banias, most of all.\"","\n","^\"For you, if you wish, you may ask your questions again, and I will answer. If you wish.\"","\n",["ev","str","^Ask her about how packing is going.","/str","/ev",{"*":".^.c-17","flg":20},"ev","str","^Ask her about what New Tarnaeum is like.","/str","/ev",{"*":".^.c-18","flg":20},"ev","str","^Ask her about how she's feeling about permanent resettlement.","/str","/ev",{"*":".^.c-19","flg":20},"ev","str","^You have no","ev",{"CNT?":".^"},1,">","/ev",[{"->":".^.b","c":true},{"b":["^ more",{"->":".^.^.^.27"},null]}],"nop","^ questions.","/str","/ev",{"*":".^.c-20","flg":20},{"c-17":["\n","^You ask her ","ev",{"CNT?":".^.^.^.^.g-3.move.c-10"},"/ev",[{"->":".^.b","c":true},{"b":["^ again",{"->":".^.^.^.6"},null]}],"nop","^ how packing is going.","\n","^\"In a way, it is good. It reminds me that we will be safe. Our last move. We will not have to return to that war-torn hellscape that we once called home.\"","\n","^Youmna sets her jaw. \"And it is bad. Because it reminds me that we will never return home.\"","\n",{"->":".^.^"},{"->":".^.^.^.^.g-8"},{"#f":5}],"c-18":["\n","^You ask her about her thoughts on New Tarnaeum ","ev",{"CNT?":".^.^.^.^.g-3.move.c-11"},"/ev",[{"->":".^.b","c":true},{"b":["^ again",{"->":".^.^.^.6"},null]}],"nop","^.","\n","^\"New Tarnaeum.\" She shakes her head slowly. \"Sometimes I wonder, whether it was right to leave. Did we truly give in that easily to the oppresor? Run away, like the dogs that they think we are? They have our land now. We will never return to that house, to that land.\"","\n","^\"Instead, we left. The Yisuans won, and they have our home.\"","\n","^\"But -\" she looks at the door to the bedroom, where Banias is playing. \"We lived. We lived.\"","\n",{"->":".^.^"},{"->":".^.^.^.^.g-8"},{"#f":5}],"c-19":["\n","^You ask her about how she's feeling about permanent resettlement.","\n","^She's silent. \"Yousef told you about our relatives.\" She says it almost like an accusation. \"His sisters, my brothers. Our family. All left on Falas.\"","\n","^\"Why were we chosen? Why were we the lucky ones? I just feel an overwhelming sense of guilt. That is all I feel. Guilt, and rage. Rage at the Yisuans. Surely, they must be sub-sentient. To do such a thing to us, to put us through this, they are scum, they are lower than the lowest bacterium or fungus. How could they. How can they feel no empathy.\"","\n","^Youmna stops. You look at her. She is not crying.","\n",{"->":".^.^"},{"->":".^.^.^.^.g-8"},{"#f":5}],"c-20":["\n","^You have no","ev",{"CNT?":".^.^"},1,">","/ev",[{"->":".^.b","c":true},{"b":["^ more",{"->":".^.^.^.8"},null]}],"nop","^ questions.","\n",{"->":".^.^.^.^.g-8"},{"#f":5}],"#f":5,"#n":"rage_questions"}],{"#f":5}],"g-8":["^She looks at you sharply. ","ev",{"CNT?":".^.^.g-7.rage_questions"},1,"==","/ev",[{"->":".^.b","c":true},{"b":["^ Even though you thought it was wise not to pry, it seems she wishes to express some rage anyway.",{"->":".^.^.^.7"},null]}],"nop","^ \"I ask you: what did we do to deserve this? What did we do to deserve losing our home? What did I do to deserve this rage?\"","\n","^It sounds rhetorical, but she waits for a reply.","\n","ev","str","^She does not deserve this. The Yisuans should be stopped.","/str","/ev",{"*":".^.c-21","flg":20},"ev","str","^She may not deserve this, but her family deserves the chance to start over.","/str","/ev",{"*":".^.c-22","flg":20},"ev","str","^You don't know what to say. You're so sorry.","/str","/ev",{"*":".^.c-23","flg":20},{"c-21":["\n","^She does not deserve this. The Yisuans are not in the right here, and Yousef, and Youmna, and Banias, and the Falasi, all deserve their home back.","\n","^Youmna snorts. \"Who will give it to us? You? The Barakhunians, who have their own homeland to return to? I think not. We will never return home, and the Falasi who remain will likely die, and we must make our peace with that, deserve or not.\"","\n","^She sighs, a quiet scream. ","<>","\n",{"->":".^.^.^.g-9"},{"#f":5}],"c-22":["\n","^She and her family did not deserve to be removed from their home. But they have a chance to start over, on New Tarnaeum. Surely they deserve that.","\n","^Youmna grimaces. \"We deserve to start over. Yes, I suppose we do. We shall forget all our family left on Falas. Banias is young. She will forget  her aunts and uncles. And we will simply go on, living with their memory.\"","\n","^She sighs, a quiet scream. ","<>","\n",{"->":".^.^.^.g-9"},{"#f":5}],"c-23":["\n","^You feel this woman's hurt in the depths of your soul. You're sorry. You don't have anything to say, except that - you're so sorry.","\n","^She sighs, a quiet scream. \"I am sorry too.\"","\n",{"->":".^.^.^.g-9"},{"#f":5}],"#f":5}],"g-9":["^\"It not does help, I tell you. To express this rage. It does not help me, nor anyone.\" She sighs deeply.","\n","^You sit in silence for a minute, maybe two. It seems that she's run out of words, out of rage.","\n","ev","str","^Excuse yourself.","/str","/ev",{"*":".^.c-24","flg":20},{"c-24":["\n",{"->":".^.^.^.g-10"},{"#f":5}],"#f":5}],"g-10":["^You decide it's time to leave. You say goodbye to Youmna. She holds up a hand, stands up. She opens the bedroom door.","\n","^As she does, she is smiling. \"Banias, my love. It's time to say goodbye to our guest,\" she says softly.","\n","^Banias runs up to you and gives you a small hug. \"Thank you for coming to visit! I had fun and I hope you had a good chat with mommy.\"","\n","ev","str","^Leave.","/str","/ev",{"*":".^.c-25","flg":20},{"c-25":["\n",{"->":".^.^.^.g-11"},{"#f":5}],"#f":5}],"g-11":["^. . .","\n","ev","str","^train","/str",{"f()":"change_background"},"pop","/ev","\n",{"->t->":"Train"},"^As you listen to the familiar sounds of the train, you naturally start thinking about today's interaction with Youmna. You had no idea she was hiding such rage.","\n","ev","str","^You understand why she hides it.","/str","/ev",{"*":".^.c-26","flg":20},"ev","str","^She shouldn't hide it.","/str","/ev",{"*":".^.c-27","flg":20},"ev","str","^The rage is a waste of energy.","/str","/ev",{"*":".^.c-28","flg":20},{"c-26":["\n","^You understand why she hides the rage. Even if it bubbles up sometimes, and overcomes her, there's no use in bringing it up. She is shielding Banias, and helping Yousef move on. It's a noble thing.","\n",{"->":".^.^.^.g-12"},{"#f":5}],"c-27":["\n","^She shouldn't have to hide her rage. She should have opportunities to express it when she wishes. There is a certain catharsis that she is wrongly denying herself.","\n",{"->":".^.^.^.g-12"},{"#f":5}],"c-28":["\n","^The rage is a waste of energy, you think. There's no reason in holding on to it; she really should just let it go.","\n",{"->":".^.^.^.g-12"},{"#f":5}],"#f":5}],"g-12":[{"->t->":"Visit"},"ev","void","/ev","->->",{"#f":5}]}],{"#f":1}],"Farewell":[["ev","str","^spaceport_departures","/str",{"f()":"change_background"},"pop","/ev","\n","^Yousef is staring at a departures board intently, boring holes into it with his eyes, as you walk up to him.","\n","^He turns his head slightly and notices you. \"Ah, my friend, hello. Please, sit.\"","\n","ev","str","^Sit.","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^Stand.","/str","/ev",{"*":".^.c-1","flg":20},{"c-0":["\n","^You sit next to Yousef. ","ev",{"CNT?":"Yousef.Second.0.g-11.forgive.c-26"},"/ev",[{"->":".^.b","c":true},{"b":["^ You're still not quite sure how things stand between you after Satna market, but you might as well.",{"->":".^.^.^.6"},null]}],"nop","\n",{"->":".^.^.g-0"},{"#f":5}],"c-1":["\n","^You choose to stand nearby. ","ev",{"CNT?":"Yousef.Second.0.g-11.forgive.c-26"},"/ev",[{"->":".^.b","c":true},{"b":["^ You're still not quite sure how things stand between you after Satna market.",{"->":".^.^.^.6"},null]}],"nop","\n",{"->":".^.^.g-0"},{"#f":5}],"g-0":["^Yousef pays you no mind, instead returning his attention to the departures board. \"Look. Do you see what I see?\"","\n","^You take a look. It's a list of departures from the spaceport, arranged in neat orderly rows. You spot the one departing from Nova Station to New Tarnaeum, in just fifteen minutes, from the nearby gate.","\n","ev","str","^It's just a departures board.","/str","/ev",{"*":".^.c-2","flg":20},"ev","str","^Look more closely.","/str","/ev",{"*":".^.c-3","flg":20},{"c-2":["\n","^It's just a departures board, you say. There doesn't seem to be anything out of the ordinary.","\n","^Yousef sighs. \"Perhaps you're right. Nothing at all out of the ordinary.\"","\n",{"->":".^.^.^.g-1"},{"#f":5}],"c-3":["\n","^You look a little closer, reading each of the rows in turn.","\n","^Ah, perhaps it's the flight to Yisua-Falas that he's staring at? It's likely got him thinking of home.","\n","^\"Yes, home, indeed.\" Yousef shakes his head. \"Home. My sisters. My aunts and uncles. All in trouble.\"","\n",{"->":".^.^.^.g-1"},{"#f":5}],"#f":5}],"g-1":["^\"In any case...\" Yousef looks back at you. \"I see you have come to wish me farewell. I appreciate that.\"","\n","ev","str","^It's the least you could do.","/str","/ev",{"*":".^.c-4","flg":20},"ev","str","^It's your job.","/str","/ev",{"*":".^.c-5","flg":20},"ev","str","^You weren't sure if you would, after Satna market.","/str",{"CNT?":"Yousef.Second.0.g-11.forgive.c-26"},"/ev",{"*":".^.c-6","flg":21},{"c-4":["\n","^It's the least you could do, you say. He's been through so much suffering. You're glad to see him go to a place where he can finally settle down.","\n","^\"Yes, a place where we can finally settle down...\" He thinks for a moment.","\n",{"->":".^.^.^.g-2"},{"#f":5}],"c-5":["\n","^It's your job, you say. Not much to it. But you're glad he'll finally have a safe place to stay.","\n","^\"Yes, a safe place to stay...\" He thinks for a moment.","\n",{"->":".^.^.^.g-2"},{"#f":5}],"c-6":["\n","^You weren't sure if you would come, you say, after what happened at Satna market. But you thought you might as well, seeing as this will be the last time you see him.","\n","^He merely says, \"It is no trouble, my friend. We all have our hangups.\" He seems distracted.","\n",{"->":".^.^.^.g-2"},{"#f":5}],"#f":5}],"g-2":["^\"Tell me, my friend,\" Yousef says. \"Pretend you were me. If you had a chance to go home, a slim chance, but a chance nonetheless, would you take it?\"","\n","^His face is elsewhere. \"You could hold your sisters again, see their children. You could help your family find food, or at least suffer alongside them.  And you would be home again! Home! Finally, where I never thought I would return...\"","\n","^\"If you could, would you return?\"","\n","ev","str","^Yes. You'd go back to help your starving family.","/str","/ev",{"*":".^.c-7","flg":20},"ev","str","^Yes. You'd go back to take vengeance on the Yisuans.","/str","/ev",{"*":".^.c-8","flg":20},"ev","str","^No. It's too dangerous. The Yisuans won't let any Falasi back.","/str","/ev",{"*":".^.c-9","flg":20},"ev","str","^No. You deserve to give Youmna and Banias a second chance.","/str","/ev",{"*":".^.c-10","flg":20},{"c-7":["\n","^You think about it, and say - yes, it would be worth it. Your family is starving, and feel a deep guilt, a bone-deep obligation, to help them.","\n",{"->":".^.^.^.g-3"},{"#f":5}],"c-8":["\n","^You think about it, and say - yes, you would go back. You would join the Falasi resistance, and wreak havoc on the Yisuans that made you and your family suffer so.","\n",{"->":".^.^.^.g-3"},{"#f":5}],"c-9":["\n","^No, you say. It's too dangerous. You wouldn't even make it back. The Yisuans wouldn't let you in, and your effort would be wasted.","\n",{"->":".^.^.^.g-3"},{"#f":5}],"c-10":["\n","^No, you say. Youmna needs you, and Banias deserves a second chance to live. Where would they be, without their husband and father? It is far better to live for the living.","\n",{"->":".^.^.^.g-3"},{"#f":5}],"#f":5}],"g-3":["^\"I see.\" Yousef contemplates your words, and nods. \"Thank you for your answer.\"","\n","ev","str","^Continue","/str","/ev",{"*":".^.c-11","flg":20},{"c-11":["\n",{"->":".^.^.^.g-4"},{"#f":5}],"#f":5}],"g-4":["^He seems like he's about to say more, but Banias bounds up. \"Daddy, it's time to board!\" Youmna is not far behind, with her ever-present smile.","\n","^\"Ah, how are you, friend?\" Youmna says. \"I appreciate you coming today.\"","\n","^You think about the talk you had with Youmna the other day, when she dropped her mask.","\n","ev","str","^Bring it up.","/str","/ev",{"*":".^.c-12","flg":20},"ev","str","^Don't bring it up.","/str","/ev",{"*":".^.c-13","flg":20},{"c-12":["\n","^You hesitantly ask if she's alright, after her expression of rage the other day. Her smile turns a little sad.","\n","^\"Yes, I am alright. Thank you for asking. And to be honest... It helped. Perhaps only a little bit, but it helped. It reminded me that some things cannot be kept inside for too long.\" She gives you a hug","ev",{"CNT?":"Yousef.First.0.g-3.c-8"},"/ev",[{"->":".^.b","c":true},{"b":["^, and this time, you accept",{"->":".^.^.^.8"},null]}],"nop","^.","\n",{"->":".^.^.^.g-5"},{"#f":5}],"c-13":["\n","^You don't bring it up. Instead, you say - it's nothing. You're glad to be here to see them off. Youmna gives you a warm hug. ","ev",{"CNT?":"Yousef.First.0.g-3.c-8"},"/ev",[{"->":".^.b","c":true},{"b":["^This time, you accept.",{"->":".^.^.^.6"},null]}],"nop","\n",{"->":".^.^.^.g-5"},{"#f":5}],"#f":5}],"g-5":["^Banias hops up and down. \"Are you coming with us to New Tarnaeum? I would like that!\"","\n","^You smile at her and say no, you aren't.","\n","^\"That's okay! I'm sure I'll see you again.\" She goes running off towards the gate. Youmna tuts. \"Come visit us, sometime. You will be welcome,\" she says as she leaves.","\n","ev","str","^Continue","/str","/ev",{"*":".^.c-14","flg":20},{"c-14":["\n",{"->":".^.^.^.g-6"},{"#f":5}],"#f":5}],"g-6":["^Yousef slings his bag over his shoulder. \"Thank you for looking after us during these last few days. God willing, we will see each other again.\" He walks off without saying anything else.","\n","^You watch as they all approach the gate, marked X15.","\n","ev","str","^Wait a second...","/str","/ev",{"*":".^.c-15","flg":20},{"c-15":["\n",{"->":".^.^.^.g-7"},{"#f":5}],"#f":5}],"g-7":["^You look back at the departures board, the one Yousef was staring at so intently. Wasn't there another flight leaving gate X15? You quickly scan the board, and - yes, there is one.","\n","^A flight headed to Yisua-Falas is leaving X15, about an hour after the flight to New Tarnaeum. You swing your head back towards the gate, and you catch Yousef going through the gate... followed by a Norberian.","\n","^You walk quickly up to the window looking out towards the shuttle. You bump into a couple of folks and apologize. Eventually, make it to the glass, and look out towards the gangway. You catch the back of Youmna's head as she shepherds Banias onto the shuttle, but... You don't see Yousef.","\n","^Perhaps Yousef went ahead of them?","\n","^Or perhaps... He's planning something?","\n","ev","str","^Do nothing.","/str","/ev",{"*":".^.c-16","flg":20},"ev","str","^Notify security.","/str","/ev",{"*":".^.c-17","flg":20},{"c-16":["\n","^Perhaps Yousef is planning something. Let him. You won't be the one to stop him.","\n",{"->":".^.^.^.g-8"},{"#f":5}],"c-17":["\n","^You walk up to the gate agents and let them know that you think there's something suspicious happening. You explain the situation; that you suspect there might be a stowaway on the next flight. They thank you, and call security.","\n","^You stand around for a moment, awkwardly, guiltily, but they quickly move on, and are back to making boarding announcements.","\n","^With nothing else to do, you guess you might as well leave.","\n",{"->":".^.^.^.g-8"},{"#f":5}],"#f":5}],"g-8":["ev","str","^Leave.","/str","/ev",{"*":".^.c-18","flg":20},{"c-18":["\n","ev","void","/ev","->->",{"#f":5}],"#f":5}]}],{"#f":1}],"#f":3}],"LiYan":["ev",{"CNT?":".^"},"/ev",["du","ev",1,"==","/ev",{"->":".^.b","c":true},{"b":["pop","\n",{"->t->":"LiYan.First"},{"->":"LiYan.7"},null]}],["du","ev",2,"==","/ev",{"->":".^.b","c":true},{"b":["pop","\n",{"->t->":"LiYan.Second"},{"->":"LiYan.7"},null]}],["du","ev",3,"==","/ev",{"->":".^.b","c":true},{"b":["pop","\n",{"->t->":"LiYan.Third"},{"->":"LiYan.7"},null]}],[{"->":".^.b"},{"b":["pop","\n","^PROBLEM IN LIYAN! ","done","\n",{"->":"LiYan.7"},null]}],"nop","\n","ev","void","/ev","->->",{"First":[["ev","str","^courtyard","/str",{"f()":"change_background"},"pop","/ev","\n","^You enter a small courtyard. It seems well-tended; plants of various colors are arranged on the edges of the square courtyard, a few climbing up the buildings that border it. Benches are scattered around the inside of the square.","\n","^On one of these benches is hunched a humanoid person. They're unusually tall. Most of the humanoids on Ring Six are around five to six feet tall. You'd guess that this person might be nearly eight feet tall.","\n","^They are staring one of the bushes, a purple-leafed one with a white flower.","\n","^Before you approach, you recall that LiYan does not speak any language you have in common.","\n","ev","str","^Turn on your translator.","/str","/ev",{"*":".^.c-0","flg":20},{"c-0":["\n",{"->":".^.^.g-0"},{"#f":5}],"g-0":["^You tap your wrist, turning on your translator. An image flashes across your eyes - \"Kaldeyn(TM) Universal Translator v1.0\".","\n","^Hopefully this allows you to understand each other.","\n","ev","str","^Approach cautiously.","/str","/ev",{"*":".^.c-1","flg":20},"ev","str","^Approach confidently.","/str","/ev",{"*":".^.c-2","flg":20},{"c-1":["\n","^You approach slowly, without saying anything. You scuff your feet a bit on the plasteel to announce your arrival.","\n","^The person looks up. Their facial features are somewhat elongated, matching their height.","\n","^'LiYan?\" you ask softly.","\n",{"->":".^.^.^.g-1"},{"#f":5}],"c-2":["\n","^You approach with confidence, your steps echoing on the plasteel. \"LiYan?\" you say.","\n","^The person looks up. Their facial features are somewhat elongated - matching their height - at least compared with your human features.","\n",{"->":".^.^.^.g-1"},{"#f":5}],"#f":5}],"g-1":["^LiYan says something in a guttural language. After a moment, you see the text flash across your eyes: \"Yes, that is my name\".","\n","^They look at you stoically. You're not entirely sure if Calanethi facial expressions carry over to human ones.","\n","ev","str","^Introduce yourself.","/str","/ev",{"*":".^.c-3","flg":20},{"c-3":["\n",{"->":".^.^.^.g-2"},{"#f":5}],"#f":5}],"g-2":["^\"Hello, I'm an intern at the housing block, here to check up on you,\" you say ","ev",{"CNT?":".^.^.g-0.c-1"},"/ev",[{"->":".^.b","c":true},{"b":["^ slowly and clearly ",{"->":".^.^.^.6"},null]}],[{"->":".^.b"},{"b":["^ confidently",{"->":".^.^.^.6"},null]}],"nop","^.","\n","^LiYan nods, and remain silent.","\n","^You stand there, awkwardly, for a few moments. LiYan stares at you, expressionless.","\n","ev","str","^Repeat yourself.","/str","/ev",{"*":".^.c-4","flg":20},"ev","str","^Wait.","/str","/ev",{"*":".^.c-5","flg":20},{"c-4":["\n","^\"I'm an intern at the housing block,\" you repeat. \"I'm here to check up on you.\"","\n",{"->":".^.^.^.g-3"},{"#f":5}],"c-5":["\n","^You stay silent. Maybe LiYan is thinking?","\n",{"->":".^.^.^.g-3"},{"#f":5}],"#f":5}],"g-3":["^LiYan slaps their chest with their hand, and then taps their wrist. Ah - their translator must not have been on. Though you're not sure what the hand to the chest was about - a Calanethi gesture, perhaps?","\n","^\"Please repeat yourself,\" LiYan says, text flashing across your eyes.","\n","^You repeat ","ev",{"CNT?":".^.^.g-2.c-4"},"/ev",[{"->":".^.b","c":true},{"b":["^ once again",{"->":".^.^.^.9"},null]}],"nop","^, \"I'm an intern at the housing block. I'm here to check up on you.\"","\n","^LiYan shakes their head. \"Hello. Yes. I am here. Please go on.\"","\n","ev","str","^Ask how LiYan is doing.","/str","/ev",{"*":".^.c-6","flg":20},"ev","str","^Ask if there's anything they need.","/str","/ev",{"*":".^.c-7","flg":20},"ev","str","^Ask how they like Nova Station.","/str","/ev",{"*":".^.c-8","flg":20},{"c-6":["\n","^LiYan looks back at the flower and hunches over more. They do a hand gesture, rotating their wrist with their hand outstretched. \"Well, it is a challenge,\" they say. \"The ------ is great.\"","\n",{"->":".^.^.^.g-4"},{"#f":5}],"c-7":["\n","^LiYan looks back at the flower and hunches over more. They shake their head. \"Yes,\" they say. \"Is there a chance of accessing a ----- lightener? The ----- is great.\"","\n",{"->":".^.^.^.g-4"},{"#f":5}],"c-8":["\n","^LiYan looks back at the flower and hunches over more. They do a hand gesture, rotating their wrist with their hand outstretched. \"Well. It is okay. The -------- is much, so I am very tired.\"","\n",{"->":".^.^.^.g-4"},{"#f":5}],"#f":5}],"g-4":["^You blink. What was that in the middle there? You've never seen the translator fail like that.","\n",["ev","str","^Ask LiYan to repeat.","/str","/ev",{"*":".^.c-9","flg":20},"ev","str","^Debug the translator.","/str","/ev",{"*":".^.c-10","flg":20},{"*":".^.c-11","flg":24},{"c-9":["\n","^You ask LiYan to repeat what they said. They shake their head, and repeat, very precisely: ","ev",{"CNT?":".^.^.^.^.g-3.c-6"},"/ev",[{"->":".^.b","c":true},{"b":["^ \"Well, it is a challenge. The ------ is great.\" ",{"->":".^.^.^.6"},null]}],"nop","^ ","ev",{"CNT?":".^.^.^.^.g-3.c-7"},"/ev",[{"->":".^.b","c":true},{"b":["^ \"Yes. Is there a chance of accessing a ------- lightener? The ------ is great. ",{"->":".^.^.^.12"},null]}],"nop","^ ","ev",{"CNT?":".^.^.^.^.g-3.c-8"},"/ev",[{"->":".^.b","c":true},{"b":["^ Well, it is okay. The ------- is much, so I am very tired. ",{"->":".^.^.^.18"},null]}],"nop","\n","^You blink. There it is again. What's happening?","\n",{"->":".^.^"},{"->":".^.^.^.^.g-5"},{"#f":5}],"c-10":["\n","^You tap your wrist a few times to turn the translator off and on, and double-check a few menus to ensure that it's working.","\n",{"->":".^.^"},{"->":".^.^.^.^.g-5"},{"#f":5}],"c-11":["\n",{"->":".^.^.^.^.g-5"},{"#f":5}],"#f":5,"#n":"repeat"}],{"#f":5}],"g-5":["^LiYan notices your surprise. They ","ev",{"CNT?":".^.^.g-3.c-6"},{"CNT?":".^.^.g-3.c-8"},"||","/ev",[{"->":".^.b","c":true},{"b":["^ make the hand gesture again ",{"->":".^.^.^.8"},null]}],[{"->":".^.b"},{"b":["^ make a hand gesture",{"->":".^.^.^.8"},null]}],"nop","^, rotating their wrist with their hand outstretched. \"I know this problem,\" the text flashing across your eyes says. \"It is always this way with your technology. The ------ peoples are invisible.\"","\n","^The... what people? You heard LiYan say something close to \"Calanethi\", but with a slight difference. And that hand gesture... perhaps a sign of frustration?","\n","ev","str","^Continue","/str","/ev",{"*":".^.c-12","flg":20},{"c-12":["\n",{"->":".^.^.^.g-6"},{"#f":5}],"#f":5}],"g-6":["^LiYan continues, \"It is not enough for our ------ to step on us. It is not enough for the Calanethi ----- to be overwhelming. Or for me to change homes constantly.\" They straighten their back, making a pained sound. \"And now I am here dealing with this heavy --------!\"","\n","^You're realizing that those untranslated bits correspond to specific phrases. You're pretty sure you hadn't heard the first two before, but that third one is the same as before.","\n",["ev","str","^Try to figure out what is paining LiYan.","/str","/ev",{"*":".^.c-13","flg":20},"ev","str","^Ask LiYan to describe the phrase in different words.","/str",{"CNT?":".^.c-13"},"/ev",{"*":".^.c-14","flg":21},"ev","str","^Ask LiYan to use the phrase in another sentence.","/str",{"CNT?":".^.c-13"},"/ev",{"*":".^.c-15","flg":21},"ev","str","^Ask LiYan to act out the phrase.","/str",{"CNT?":".^.c-13"},"/ev",{"*":".^.c-16","flg":21},"ev","str","^You have a guess as to what is paining them.","/str","/ev",{"*":".^.c-17","flg":4},"ev","str","^You know exactly what the problem is.","/str",{"CNT?":".^.c-14"},{"CNT?":".^.c-15"},"&&",{"CNT?":".^.c-16"},"&&","/ev",{"*":".^.c-18","flg":21},{"c-13":["\n","^Surely there's a way you can figure out what LiYan means by this \"heavy\" thing that is paining them.","\n","^You say, sympathetically: \"I'm sorry I can't understand, and I'd like to understand what is paining you. Can we try to figure out what you mean that is heavy?\"","\n","^LiYan shakes their head, cautiously, and makes a small hand gesture. \"Yes.\"","\n",{"->":".^.^"},{"->":".^.^.^.^.after_gravity"},{"#f":5}],"c-14":["\n","^You ask LiYan to describe the phrase using some other words.","\n","^LiYan pauses for a moment, ","ev",{"CNT?":".^.^.c-15"},"/ev",[{"->":".^.b","c":true},{"b":["^ once again ",{"->":".^.^.^.8"},null]}],"nop","^ putting their hand to their chest. \"----- is a pull. I am used to feeling less pull on Calaneth, my home.\"","\n",{"->":".^.^"},{"->":".^.^.^.^.after_gravity"},{"#f":5}],"c-15":["\n","^You ask LiYan to use the phrase in another sentence.","\n","^LiYan ","ev",{"CNT?":".^.^.c-14"},"/ev",[{"->":".^.b","c":true},{"b":["^ once again ",{"->":".^.^.^.8"},null]}],"nop","^ puts their hand to their chest. Then, after a few moments, they say, \"I feel heavy because of ------\".","\n",{"->":".^.^"},{"->":".^.^.^.^.after_gravity"},{"#f":5}],"c-16":["\n","^You ask them to act the phrase out.","\n","^LiYan stands up, seemingly with great difficulty. Their knees crack a little bit. They raise their hands - also with difficulty - then slowly lower themselves, and lay flat on the ground.","\n","^You notice that their entire body seems a little more relaxed while they're laying on the ground.","\n",{"->":".^.^"},{"->":".^.^.^.^.after_gravity"},{"#f":5}],"c-17":["\n","^You have a guess as to what LiYan is having trouble with:","\n",["ev","str","^INPUT_TEXT LiYan_Guess_1 Type in your guess.","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^DEBUG! Guess correctly","/str",{"VAR?":"debug"},"/ev",{"*":".^.c-1","flg":21},{"c-0":["\n",{"->":".^.^.g-0"},{"#f":5}],"c-1":["\n","ev","str","^gravity","/str","/ev",{"VAR=":"LiYan_Guess_1","re":true},{"->":".^.^.g-0"},{"#f":5}],"g-0":["ev",{"VAR?":"LiYan_Guess_1"},"str","^gravity","/str","==","/ev",[{"->":".^.b","c":true},{"b":["\n","^You ask LiYan if they are having trouble with the gravity on Nova Station.","\n",{"->":"LiYan.First.0.after_gravity"},{"->":".^.^.^.8"},null]}],"nop","\n","ev",{"VAR?":"LiYan_Guess_1"},"str","^gravity","/str","!=","/ev",[{"->":".^.b","c":true},{"b":["^ You ask LiYan if their troubles have to do with ","ev",{"VAR?":"LiYan_Guess_1"},"out","/ev","^. They nod their head. \"No.\"",{"->":".^.^.^.18"},null]}],"nop","\n",{"->":".^.^.^.^"},{"->":".^.^.^.^.^.^.after_gravity"},{"#f":5}]}],{"#f":5}],"c-18":["\n","^From all the clues you've gathered, you know exactly what's going wrong. You ask LiYan: \"Is the gravity that is giving you trouble?\"","\n",{"->":".^.^.^.^.after_gravity"},{"#f":5}],"#f":5,"#n":"figure_out_repeat"}],{"#f":5}],"after_gravity":["^\"Yes!\" LiYan says. \"That's it.\"","\n","^From your research before coming to the housing block, you know that Ring Six spins at a specific rotation, reproducing the gravity that specific species - including humans - expect. And you also know that, because of this, the housing block typically only accepts the species that are used to this gravity.","\n","^If LiYan is used to some lower gravity, then their spine must be in incredible pain all day from the downward pull on them. It can't be easy for them just to exist on Ring Six.","\n","^You feel a little guilty about meeting them outside. It probably would have been easier to meet them somewhere where they could be laying down, instead.","\n",["ev","str","^Apologize for meeting them outside.","/str","/ev",{"*":".^.c-19","flg":20},"ev","str","^Move on, and promise to find a solution.","/str","/ev",{"*":".^.c-20","flg":20},{"c-19":["\n","^You apologize for meeting them outside. It probably would have been easier for them to stay laying down.","\n","^LiYan nods. \"No. The flower was worth it.\" They gesture at the flower they were staring at.","\n",{"->":".^.^"},{"->":".^.^.^.^.g-7"},{"#f":5}],"c-20":["\n",{"->":".^.^.^.^.g-7"},{"#f":5}],"#f":5,"#n":"apology"}],{"#f":5}],"g-7":["^You stand up and promise that you'll think about how to solve their gravity problem. For now, it's probably best that they go to lay down.","\n","^LiYan shakes his head gravely. \"Thank you.\"","\n","ev","str","^Leave.","/str","/ev",{"*":".^.c-21","flg":20},{"c-21":["\n",{"->":".^.^.^.g-8"},{"#f":5}],"#f":5}],"g-8":["^You part ways.","\n","^. . .","\n","ev","str","^train","/str",{"f()":"change_background"},"pop","/ev","\n",{"->t->":"Train"},"^You think about today's interaction with LiYan. About how difficult it must be for them to navigate the labyrinthian refugee system without even being able to communicate properly. Not to mention the crushing weight of the gravity they feel on Ring six.","\n","^You feel...","\n","ev","str","^Admiration for their strength.","/str","/ev",{"*":".^.c-22","flg":20},"ev","str","^Sorry for them.","/str","/ev",{"*":".^.c-23","flg":20},"ev","str","^Sorry that you can't do more.","/str","/ev",{"*":".^.c-24","flg":20},{"c-22":["\n","^You admire LiYan. Though their back is bowed from the gravity, they clearly have incredible mental strength.","\n",{"->":".^.^.^.g-9"},{"#f":5}],"c-23":["\n","^You feel sorry for LiYan. Enduring a gravity that's greater than what you're used to can grind down even the strongest person. You hope you can find a solution to them.","\n",{"->":".^.^.^.g-9"},{"#f":5}],"c-24":["\n","^You feel sorry that you can't do more. You wish you had studied Calaneth in school so that you could help them communicate more easily.","\n",{"->":".^.^.^.g-9"},{"#f":5}],"#f":5}],"g-9":["^You open your messages, and send a quick message to the head of the housing block, explaining LiYan's predicament. You wonder if there would be some way, even a small one, to lighten the weight of the gravity that they're feeling.","\n",{"->t->":"Visit"},"ev","void","/ev","->->",{"#f":5}]}],{"#f":1}],"Second":[["ev","str","^gymnasium_outdoor","/str",{"f()":"change_background"},"pop","/ev","\n","^In front of you is a large rectangular building. At the top is one word in large block lettering: \"Gymnasium.\"","\n","^It was a short train ride to arrive here, just one stop down from the housing block. Apparently this building was part of a Barakhunian school not too long ago, but the kids have already packed up, preparing to leave for Barakhun.","\n","ev","str","^Enter the Gymnasium.","/str","/ev",{"*":".^.c-0","flg":20},{"c-0":["\n","ev","str","^pool","/str",{"f()":"change_background"},"pop","/ev","\n",{"->":".^.^.g-0"},{"#f":5}],"g-0":["^You enter the Gymnasium through the pool entrance. It's quite a large, echoing space; a little eerie. It appears that the pool has been left intact for now, water and all.","\n","^Inside the pool is LiYan, floating on their back. They hear you coming in, and look at you, stoic as ever. They greet you in their language, and make elaborate hand gestures towards you.","\n","^Text appears across your vision from your translator: \"Hello. A happy ------ day. This pool of water is a much needed relief from the great ------. I thank you very much for accomodating my request.\"","\n","^Although your translator is not picking up on it, you feel like the hand gestures are probably a sign of enthusiasm.","\n","ev","str","^Be humble: this really was the least you could do.","/str","/ev",{"*":".^.c-1","flg":20},"ev","str","^Joke: LiYan seems to take to water just like a fish.","/str","/ev",{"*":".^.c-2","flg":20},"ev","str","^You're just glad they have some relief.","/str","/ev",{"*":".^.c-3","flg":20},{"c-1":["\n","^You shake your head, and say, no, this really was the least you could do. You wish there was some better way to accomodate them.","\n",{"->":".^.^.^.g-1"},{"#f":5}],"c-2":["\n","^You smile. They seem to be taking to the water like a fish! You say as much, and LiYan makes a hand gesture back at you. The translator, as usual, doesn't pick it up - you hope that was the equivalent of a laugh.","\n",{"->":".^.^.^.g-1"},{"#f":5}],"c-3":["\n","^You're very glad that they're enjoying the pool, and glad that you could help.","\n",{"->":".^.^.^.g-1"},{"#f":5}],"#f":5}],"g-1":["^LiYan and returns to floating. \"I have a matter I would like to discuss with you, but we did not have much time to talk before. Do you have any questions for me first?\"","\n","^Well, you were wondering...","\n",["ev","str","^Why did they leave Calaneth, their homeworld?","/str","/ev",{"*":".^.c-4","flg":20},"ev","str","^Is LiYan not Calanethi?","/str",{"CNT?":".^.c-4"},"/ev",{"*":".^.c-5","flg":21},"ev","str","^What were the Malakethi like, before the fighting?","/str",{"CNT?":".^.c-5"},"/ev",{"*":".^.c-6","flg":21},"ev","str","^What was LiYan's role among his community?","/str",{"CNT?":".^.c-5"},"/ev",{"*":".^.c-7","flg":21},"ev","str","^If ","ev",{"CNT?":".^.c-5"},"/ev",[{"->":".^.b","c":true},{"b":["^they",{"->":".^.^.^.35"},null]}],[{"->":".^.b"},{"b":["^the Malakethi",{"->":".^.^.^.35"},null]}],"nop","^ didn't have spacecraft, how did LiYan leave?","/str",{"CNT?":".^.c-4"},"/ev",{"*":".^.c-8","flg":21},"ev","str","^How did LiYan end up on a ring with mismatched gravity?","/str",{"CNT?":".^.c-4"},"/ev",{"*":".^.c-9","flg":21},"ev","str","^Why can they always understand you?","/str",{"CNT?":".^.c-5"},"/ev",{"*":".^.c-10","flg":21},"ev","str","^You don't have any more questions.","/str",{"CNT?":".^.c-5"},"/ev",{"*":".^.c-11","flg":21},{"c-4":["\n","^You ask LiYan why they left Calaneth.","\n","^LiYan nods his head. \"Great fighting,\" they say. \"Battles beyond my comprehension, great weapon sounds in the sky. Through all this, we -------\" - again, the word that sounds like Calanethi, but with a twist - \"are maligned, and lost, dropped like --------\".","\n","^LiYan stops, seeming to realize that the last bit might not have come through in translation. They nod, and try again. \"We... the ------, we were, how to say... forgotten. A small group in a large world, with no technology of our own. These higher beings that fly their great air craft, they do not care about us.\"","\n",["ev","str","^Continue","/str","/ev",{"*":".^.c-0","flg":20},{"c-0":["\n","^Wait, LiYan is saying they are \"a small group\". You're pretty sure that the Calanethi make up the majority on Calaneth. So they're not Calanethi?","\n","^\"When the higher beings come to take our land to build a great space craft station, we fought.\" LiYan nods their head. Their expression twists, their face strained. \"Their weapons are too great. Many people return to the dirt. My friends. Some of my family.\"","\n","^\"Our people were displaced. We, the ------, had no where to go. And now I am here.\"","\n",{"->":".^.^.^.^"},{"->":".^.^.^.^.^.^.g-2"},{"#f":5}]}],{"#f":5}],"c-5":["\n","^You ask LiYan why they identify as \"a small group\". Are they not Calanethi?","\n","^LiYan twists their hand, a gesture you've come to read as frustration. \"Not Calanethi. -------.\"","\n","^You fit your mouth around the unknown word. \"Malakethi?\" LiYan shakes their head in assent.","\n","^So, LiYan is Malakethi. You'll mentally substitue this word in from now on.","\n",{"->":".^.^"},{"->":".^.^.^.^.g-2"},{"#f":5}],"c-6":["\n","^You ask for more information on the Malakethi.","\n","^\"We... how say...\" LiYan pauses to think about a translation. \"We hooked the aquatic creatures for food.\" Ah, primarily fishers, then. \"We kept some, sold some to Calanethi. Over time, more and more dependent on Calanethi goods.\"","\n","^\"We were a community,\" LiYan continues. \"Not like the Calanethi, separated and soulless. We -\" they thump their chest with their fist, a strangely human gesture - \"took care of each other.\"","\n",{"->":".^.^"},{"->":".^.^.^.^.g-2"},{"#f":5}],"c-7":["\n","^You ask LiYan what their role among the Malakethi was.","\n","^\"Net gatherer. I am very good at swimming.\" LiYan thumps their chest again.","\n",["ev","str","^Ask for a demonstration.","/str","/ev",{"*":".^.c-0","flg":20},{"c-0":["\n","^\"Of course.\" LiYan dives into the pool, and takes off. They are a [i]very[/i] fast swimmer, especially considering the mismatched gravity. You watch LiYan do a couple of laps in what would probably be record time for a Barakhunian. At the end, they shake their head, droplets flying everywhere, and look back up at you.","\n","^For the first time, you see LiYan wearing an expression of something other than stoicism. They look... relaxed. Maybe even happy.","\n",{"->":".^.^.^.^"},{"->":".^.^.^.^.^.^.g-2"},{"#f":5}]}],{"#f":5}],"c-8":["\n","^How did LiYan leave without a spacecraft, you ask?","\n","^LiYan explains that their family stayed in a refugee camp on Calaneth run by a different species - they don't know the name. Conditions at the camp were horrible; they had to eat moldy food, and shivered every night from the cold, never getting the extra blankets they requested.","\n","^\"Not the camp owners' fault,\" they say. \"I believe Calanethi were oppressing us. The camp did their best.\"","\n","^Eventually, that camp was shut down by the Calanethi for no reason. They were able to join the camp runners' shuttle, bound for another refugee camp. They stayed there for a time, and have been in limbo ever since.","\n",{"->":".^.^"},{"->":".^.^.^.^.g-2"},{"#f":5}],"c-9":["\n","^You wonder: how did LiYan end up on Ring Six, where the gravity is so clearly mismatched?","\n","^LiYan nods their head. \"I am placed at six camps before this one, within one solar cycle.\"","\n","^Wait, are you understanding them correctly? They've been moved from camp to camp [i]six[/i] times within one year?","\n","^LiYan shakes their head. \"Yes. One before here, unbearably hot. Before that, unbearably bright. And now, unbearably heavy.\"","\n","^\"Our kind, too unknown. No right place for us, other than home. Or if there is, I do not know it.\" They nod. \"I miss home.\"","\n",{"->":".^.^"},{"->":".^.^.^.^.g-2"},{"#f":5}],"c-10":["\n","^You've been wondering how LiYan can always seem to understand you, even though your translator can't translate Malakethi very well.","\n","^LiYan twists their hand. \"This device -\" they tap their wrist - \"can only do translating to Calanethi. Well known language. Malakethi language, not well known.\"","\n","^\"We Malakethi were forced to learn Calanethi. But I was not a good student. Can understand but not speak.\"","\n",{"->":".^.^"},{"->":".^.^.^.^.g-2"},{"#f":5}],"c-11":["\n",{"->":".^.^.^.^.g-2"},{"#f":5}],"#f":5,"#n":"questions"}],{"#f":5}],"g-2":["^You thank LiYan for letting you ask so many questions. They said earlier that they wanted to ask you something; what was it?","\n","^LiYan shakes their head. \"Yes. I have a request. I have a meeting for --------- ---------- soon. Very important.\"","\n","^You say that the purpose of the meeting was untranslated, and LiYan nods. \"Ah... I want to have a place to stay. Forever. Not this moving between places constantly. This meeting is with a people that may grant me a home.\"","\n","^It seems LiYan is applying for permanent settlement. That's great! But LiYan nods again. \"Applied many times, many different people. Always denied. But this is the first time I have a meeting.\"","\n","^\"You have already seen the problems with the translator. Many problems with speaking Malakethi. I try hard to make it understandable, but it is still problematic.\"","\n","^\"Will you... come and help me with this meeting? To translate for me?\"","\n",["ev","str","^Absolutely. Express confidence.","/str","/ev",{"*":".^.c-12","flg":20},"ev","str","^You're not sure if this is a good idea.","/str","/ev",{"*":".^.c-13","flg":20},"ev","str","^Say yes, but with hesitance.","/str",{"CNT?":".^.c-13"},"/ev",{"*":".^.c-14","flg":21},"ev","str","^You'll try to find a Malakethi speaker to translate for LiYan instead.","/str",{"CNT?":".^.c-13"},"/ev",{"*":".^.c-15","flg":21},{"c-12":["\n","^Absolutely, you say. You will come to the meeting with them and plead their case.","\n","^LiYan's body relaxes. It looks as if a weight is lifted from them. \"Thank you. You are truly a friend.\"","\n","ev",true,"/ev",{"VAR=":"LiYan_Translate","re":true},{"->":".^.^.^.^.g-3"},{"#f":5}],"c-13":["\n","^You're... not sure that you'll be able to help. You're not sure if you can understand them well enough to translate at a resettlement hearing. And you've never been to a meeting like that before...","\n","^LiYan twists their hand. \"I cannot think of any other alternative. You took the time to understand my story. There is no one else I can trust.\"","\n",{"->":".^.^"},{"->":".^.^.^.^.g-3"},{"#f":5}],"c-14":["\n","^You're not sure if you can properly translate for LiYan, but if they need someone dependable... You might as well try. You say as much.","\n","^LiYan shakes their head. \"That is all I ask. For you to try.\"","\n","ev",true,"/ev",{"VAR=":"LiYan_Translate","re":true},{"->":".^.^.^.^.g-3"},{"#f":5}],"c-15":["\n","^You say, well, perhaps you can see about finding another person to translate instead? Perhaps someone who speaks Malakethi? You'll message your mentor after this to find someone. Surely that will be better than you translating for them.","\n","^\"If you think that is the best course of action... then you may try,\" LiYan expresses with some doubt. \"Will you at least come after the meeting to meet me?\"","\n","^Of course. That's the least you can do.","\n","^LiYan shakes their head. \"Thank you.\"","\n","ev",false,"/ev",{"VAR=":"LiYan_Translate","re":true},{"->":".^.^.^.^.g-3"},{"#f":5}],"#f":5,"#n":"translate_choices"}],{"#f":5}],"g-3":["^With that, LiYan bids you farewell. \"I have used much of your time already. I will return to swimming for a while and then return to the camp.\"","\n","^\"Thank you for coming to check on me. I will see you ","ev",{"CNT?":".^.^.g-2.translate_choices.c-15"},"/ev",[{"->":".^.b","c":true},{"b":["^ after ",{"->":".^.^.^.8"},null]}],[{"->":".^.b"},{"b":["^ at",{"->":".^.^.^.8"},null]}],"nop","^ the meeting.\"","\n",["^You bid LiYan farewell, and exit the gymnasium.","\n","ev","str","^Leave.","/str","/ev",{"*":".^.c-16","flg":20},"ev","str","^Anxious for LiYan.","/str","/ev",{"*":".^.c-17","flg":20},"ev","str","^Angry that they are having translation issues.","/str",{"VAR?":"LiYan_Translate"},"/ev",{"*":".^.c-18","flg":21},"ev","str","^Sorry that you couldn't help more.","/str",{"VAR?":"LiYan_Translate"},"!","/ev",{"*":".^.c-19","flg":21},{"c-16":["\n","^. . .","\n","ev","str","^train","/str",{"f()":"change_background"},"pop","/ev","\n",{"->t->":"Train"},"^You think about the promise you made to LiYan, ","<>","\n","ev",{"VAR?":"LiYan_Translate"},"/ev",[{"->":".^.b","c":true},{"b":["^ to translate for them at their permanent resettlement meeting.",{"->":".^.^.^.20"},null]}],[{"->":".^.b"},{"b":["^to find someone to translate for them at their permanent resettlement meeting.",{"->":".^.^.^.20"},null]}],"nop","^ You feel...","\n",{"->":".^.^.^.^.g-5"},{"#f":5}],"c-17":["\n","^You feel anxious for LiYan. ","ev",{"VAR?":"LiYan_Translate"},"/ev",[{"->":".^.b","c":true},{"b":["^ You hope that you'll be able to help them translate, and not mess it up.",{"->":".^.^.^.7"},null]}],[{"->":".^.b"},{"b":["^You hope that the person you find to help translate can help them get through the meeting.",{"->":".^.^.^.7"},null]}],"nop","^ They deserve permanent resettlement to somewhere that they're comfortable.","\n",{"->":".^.^.^.^.g-5"},{"#f":5}],"c-18":["\n","^You feel angry that LiYan has this problem at all. With billions of people passing through Nova Station, you would think that there would be one or two that speak Malakethi and would be willing to help out.","\n",{"->":".^.^.^.^.g-5"},{"#f":5}],"c-19":["\n","^You feel sorry that you couldn't help more. You really do think that you made the right decision in not translating for them, though. You probably would have made the resettlement meeting even more confusing.","\n",{"->":".^.^.^.^.g-5"},{"#f":5}],"#f":5,"#n":"g-4"}],{"#f":5}],"g-5":["ev",{"VAR?":"LiYan_Translate"},"!","/ev",[{"->":".^.b","c":true},{"b":["\n","^Before you forget, you bring up your messages, and send a message to the head of the housing block. You ask them to find a Malakethi translator for LiYan. You make sure to emphasize that you need a Malakethi translator, not a Calanethi one.","\n","^You sigh. Hopefully they can find someone.","\n",{"->":".^.^.^.5"},null]}],"nop","\n",{"->t->":"Visit"},"ev","void","/ev","->->",{"#f":5}]}],{"#f":1}],"Third":[["ev","str","^courthouse_outdoor","/str",{"f()":"change_background"},"pop","/ev","\n","^\"Galatean Courthouse,\" the PA announces, as the doors open. You step off the maglev train. [i]So[/i] much faster and smoother than the old railcar they have at the housing block.","\n","^You exit the maglev station to a wide plaza. You take a look at your feet, and note that the plaza is stone rather than plasteel. Usually, stone is impractical on the station because of the weight. The plaza must have some incredible structural reinforcement. And are those real trees bordering the plaza? Wow. The Galateans are clearly a wealthy species.","\n","ev","str","^Continue","/str","/ev",{"*":".^.c-0","flg":20},{"c-0":["\n",{"->":".^.^.g-0"},{"#f":5}],"g-0":["^Across the plaza is a great, severe cylinder of a building. Gigantic pillars stretch all the way up to a simulated sky. Elaborate carvings, murals and archways dot the facade. It's a beautiful piece of architecture","ev",{"CNT?":"Fanias.Second"},"/ev",[{"->":".^.b","c":true},{"b":["^, nothing like the Urun Embassy you visited with Fanias",{"->":".^.^.^.5"},null]}],"nop","^.","\n","^At the top of the building are some Galatean words, over which your translator helpfully overlays:","\n","^\"Justice is the Highest Form of Life.\"","\n","ev","str","^Approach the courthouse.","/str","/ev",{"*":".^.c-1","flg":20},{"c-1":["\n",{"->":".^.^.^.g-1"},{"#f":5}],"#f":5}],"g-1":["^You walk across the wide plaza to the courthouse. You pass various people wandering the plaza, or hurrying across it to their destination. There is a panoply of galactic civilization on display here; humanoids, insectoids, gases, and plant creatures all occupy the space together.","\n","^You reach the massive door to the courthouse, and ignore it, instead entering through the smaller wicket gate next to it. You wonder if the massive door is ever used for anything, or if it's just a decoration.","\n","ev","str","^Continue","/str","/ev",{"*":".^.c-2","flg":20},{"c-2":["\n","ev","str","^courthouse_indoor","/str",{"f()":"change_background"},"pop","/ev","\n",{"->":".^.^.^.g-2"},{"#f":5}],"#f":5}],"g-2":["^You find yourself in a cavernous space. The interior is just as elaborate as the exterior; the Galateans really spared no expense.","\n","^It's not as busy in here as it was out in the plaza, but there are still some people inside, speaking in groups. Though the wide open space hushes the voices of those speaking, the stone surfaces produce echoes, giving the whole space an eerie, liminal quality.","\n","^You check in at the front desk and allow yourself to be scanned for security. Then you step in, and follow the directions to the room where LiYan's resettlement meeting ","ev",{"VAR?":"LiYan_Translate"},"/ev",[{"->":".^.b","c":true},{"b":["^ will take ",{"->":".^.^.^.10"},null]}],[{"->":".^.b"},{"b":["^ should be taking",{"->":".^.^.^.10"},null]}],"nop","^ place.","\n",["ev",{"VAR?":"LiYan_Translate"},"/ev",{"->":".^.b","c":true},{"b":["\n",{"->t->":"LiYan.Third_TranslateInMeeting"},"ev","str","^courthouse_indoor","/str",{"f()":"change_background"},"pop","/ev","\n","^LiYan follows you out of the room.","\n",{"->":".^.^.^.15"},null]}],[{"->":".^.b"},{"b":["\n","^But wait... Is that LiYan, sitting on a stone bench, outside the room? You thought the meeting would still be going.","\n",{"->":".^.^.^.15"},null]}],"nop","\n","ev","str","^Check in on LiYan.","/str","/ev",{"*":".^.c-3","flg":20},{"c-3":["\n",{"->":".^.^.^.g-3"},{"#f":5}],"#f":5}],"g-3":["ev",{"CNT?":"LiYan.Third_TranslateInMeeting_UhOh.0.g-0.choices.c-6"},"/ev",[{"->":".^.b","c":true},{"b":["^ LiYan is still wearing that unidentifiable expression, and is still shaking. ",{"->":".^.^.^.5"},null]}],[{"->":".^.b"},{"b":["^ LiYan looks... strained. You're not sure how to interpret this expression. Their muscles are tense, especially in their hands, and they're shaking, almost vibrating. Their face, while stoic, is tensed up, their jaw clenched. ",{"->":".^.^.^.5"},null]}],"nop","\n","^They look up at you. Their eyes are a little wild. \"I... am angry. Leave.\"","\n",["ev","str","^What happened in the meeting?","/str",{"VAR?":"LiYan_Translate"},"!","/ev",{"*":".^.c-4","flg":21},"ev","str","^Wait, let's talk about it.","/str",{"VAR?":"LiYan_Translate"},{"CNT?":".^.c-4"},"||","/ev",{"*":".^.c-5","flg":21},"ev","str","^Leave.","/str","/ev",{"*":".^.c-6","flg":20},{"c-4":["\n","^You ask LiYan what happened.","\n","^They nod sharply, and do a gesture you've never seen before - they punch a closed fist into the palm of their other hand.","\n","^\"The meeting is delayed. There was no translator person available. Requested for next time. But there is no next time. The housing block is closing, and I will not be able to return.\"","\n","^They punch their hand again. \"Now leave.\"","\n",{"->":".^.^"},{"#f":5}],"c-5":["\n","^\"Talk what? No more talk.\" ","ev",{"CNT?":".^.^.c-4"},"/ev",[{"->":".^.b","c":true},{"b":["^ They repeatedly punch their fist into their other hand. ",{"->":".^.^.^.7"},null]}],[{"->":".^.b"},{"b":["^ They do a gesture you've never seen before: they punch their closed fist into the palm of the other hand, several times. ",{"->":".^.^.^.7"},null]}],"nop","^ It makes a loud smacking sound, echoing down the hallway.","\n","^\"This ------- judge. This ------- system. It would see me stranded for another ------- ------ solar cycles. --------. -----------.\" LiYan follows this with a guttural sound, a kind of bark. The translator does not translate this.","\n","^Before you can do anything else, they stalk down the hallway towards the exit. People stare at them and mutter as they leave.","\n",{"->":".^.^"},{"#f":5}],"c-6":["\n","^. . .","\n","ev","str","^train","/str",{"f()":"change_background"},"pop","/ev","\n",{"->t->":"Train"},"^You sigh. Today's meeting at the courthouse could not have gone worse. ","<>","\n",["ev",{"VAR?":"LiYan_Translate"},"/ev",{"->":".^.b","c":true},{"b":["\n",{"->t->":"LiYan.Third_TranslateAfterOptions"},{"->":".^.^.^.17"},null]}],[{"->":".^.b"},{"b":["\n",{"->t->":"LiYan.Third_NoTranslateAfterOptions"},{"->":".^.^.^.17"},null]}],"nop","\n",{"->t->":"Visit"},"ev","void","/ev","->->",{"#f":5}],"#f":5,"#n":"choices"}],{"#f":5}]}],{"#f":1}],"Third_TranslateAfterOptions":[["^You ruminate on the incredible indifference that the judge displayed. What could have gone differently?","\n","ev","str","^You should have pushed the judge harder.","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^You should have pushed the judge less hard.","/str","/ev",{"*":".^.c-1","flg":20},"ev","str","^Nothing. It's the system's fault.","/str","/ev",{"*":".^.c-2","flg":20},"ev","str","^Nothing. LiYan needs to follow the system.","/str","/ev",{"*":".^.c-3","flg":20},{"c-0":["\n","^You should have pushed the judge harder to keep the hearing going. Surely, if you had a chance to explain LiYan's entire situation, the judge would have seen why you needed to be there.","\n",{"->":".^.^.g-0"},{"#f":5}],"c-1":["\n","^You should have pushed the judge less hard to keep the hearing going. Maybe they would have been more merciful and heard LiYan out.","\n",{"->":".^.^.g-0"},{"#f":5}],"c-2":["\n","^You couldn't have done anything differently. Push the judge hard or less hard, get an official translator or not, you suspect the outcome would have been the same. The utter uncaringness is a result of the system functioning as expected, and reforms are needed to correct the entire thing.","\n",{"->":".^.^.g-0"},{"#f":5}],"c-3":["\n","^Unfortunately, you think, this is just how things work. LiYan simply needs to follow the refugee system, and eventually, once they do everything right, they'll find a place to stay. You're pretty sure that's how it works.","\n",{"->":".^.^.g-0"},{"#f":5}],"g-0":["ev","void","/ev","->->",{"#f":5}]}],{"#f":1}],"Third_NoTranslateAfterOptions":[["^You wonder if things would have gone differently had you been there to translate.","\n","ev","str","^You should have been there.","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^It wouldn't have gone any differently.","/str","/ev",{"*":".^.c-1","flg":20},"ev","str","^It's the system's fault.","/str","/ev",{"*":".^.c-2","flg":20},{"c-0":["\n","^You should have been there, you think. Maybe things would have gone differently. You wish you could go back in time and say yes.","\n",{"->":".^.^.g-0"},{"#f":5}],"c-1":["\n","^You comfort yourself with the thought that it wouldn't have gone any differently. The judge probably would have thrown you out for a different reason anyway.","\n",{"->":".^.^.g-0"},{"#f":5}],"c-2":["\n","^Be there or not, you doubt it would have made a difference. Surely this is the refugee system's fault. Why does LiYan have to go through this big process, anyway? You comfort yourself with this thought.","\n",{"->":".^.^.g-0"},{"#f":5}],"g-0":["ev","void","/ev","->->",{"#f":5}]}],{"#f":1}],"Third_TranslateInMeeting":[["^LiYan is sitting outside the room on a stone bench. Although they're hunched over from the gravity, they greet you enthusiastically, with an excited gesture. \"So glad to see you, friend. How are you doing?\"","\n","ev","str","^You're a little nervous about translating for LiYan.","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^You're excited. This meeting has been a long time coming.","/str","/ev",{"*":".^.c-1","flg":20},{"c-0":["\n","^You admit to LiYan that you're a little nervous. What happens if you mess up? You hope you're not the reason that LiYan doesn't find a permanent home.","\n","^LiYan nods their head. They hold out their hand, seemingly expectantly. You're unsure of what they expect, so you hold your hand out too. They grab it, and hold it hard. \"Friend, it is alright. Just do your best. I trust you.\"","\n",{"->":".^.^.g-0"},{"#f":5}],"c-1":["\n","^You're excited for LiYan. You're sure that the Galatean judge will see LiYan's side of it, and you'll do everything in your power to help them through this meeting.","\n","^LiYan shakes their head. They hold out their hand, seemingly expectantly. You're unsure of what is expected, so you hold your hand out too. They grab it, and hold it hard. \"I am glad of your trust in me. ----- willing, they will be on our side.\"","\n",{"->":".^.^.g-0"},{"#f":5}],"g-0":["^The door to the room opens, and a small face peers out. \"They're ready for you,\" the Galatean says.","\n","ev","str","^Enter the room.","/str","/ev",{"*":".^.c-2","flg":20},{"c-2":["\n","ev","str","^courthouse_room","/str",{"f()":"change_background"},"pop","/ev","\n",{"->":".^.^.^.g-1"},{"#f":5}],"#f":5}],"g-1":["^You enter the room first, and LiYan follows.","\n","^The interior of the room, just like the outside, is entirely stone, with one main difference - it's a black stone. Onyx, or obsidian. As the door shuts behind you, you realize just how dark the space is. Just two spotlights illuminate the room. One shines onto the short Galatean atop a podium at the back of the room. They must be the judge.","\n","^The other spotlight shines down on an empty space on the floor. The attendant directs you to stand in the spotlight.","\n","ev","str","^Stand in the spotlight.","/str","/ev",{"*":".^.c-3","flg":20},"ev","str","^Direct LiYan to stand in the spotlight.","/str","/ev",{"*":".^.c-4","flg":20},{"c-3":["\n","^You take the initiative, moving forward into the spotlight.","\n",{"->":".^.^.^.g-2"},{"#f":5}],"c-4":["\n","^You direct LiYan to stand in the spotlight. They do so.","\n",{"->":".^.^.^.g-2"},{"#f":5}],"#f":5}],"g-2":["^The Galatean judge glares down at ","ev",{"CNT?":".^.^.g-1.c-3"},"/ev",[{"->":".^.b","c":true},{"b":["^you",{"->":".^.^.^.6"},null]}],[{"->":".^.b"},{"b":["^LiYan",{"->":".^.^.^.6"},null]}],"nop","^. \"Name?\"","\n","ev","str","^Give your name.","/str",{"CNT?":".^.^.g-1.c-3"},"/ev",{"*":".^.c-5","flg":21},"ev","str","^Give LiYan's name.","/str",{"CNT?":".^.^.g-1.c-3"},"/ev",{"*":".^.c-6","flg":21},{"*":".^.c-7","flg":24},{"c-5":["\n","ev",{"VAR?":"podium"},1,"+",{"VAR=":"podium","re":true},"/ev","^You give your name instead of LiYan's.","\n","^The judge blinks, and looks at something behind her podium. \"That's not who this meeting is for.\"","\n",["ev","str","^Explain that you're translating for LiYan.","/str","/ev",{"*":".^.c-0","flg":20},{"c-0":["\n","^You explain that you're translating for LiYan, whom you gesture to.","\n",{"->":"LiYan.Third_TranslateInMeeting_UhOh"},"ev","void","/ev","->->",{"->":".^.^.^.^.^.g-3"},{"#f":5}]}],{"#f":5}],"c-6":["\n","^LiYan, you say.","\n",{"->":".^.^.^.g-3"},{"#f":5}],"c-7":["\n","^LiYan carefully pronounces their name.","\n",{"->":".^.^.^.g-3"},{"#f":5}],"#f":5}],"g-3":["^\"And what are you here for?\" The judge asks.","\n","ev","str","^Say LiYan is here for permanent resettlement.","/str",{"CNT?":".^.^.g-1.c-3"},"/ev",{"*":".^.c-8","flg":21},"ev","str","^Say you're translating for LiYan, who is here for permanent resettlement.","/str",{"CNT?":".^.^.g-1.c-3"},"/ev",{"*":".^.c-9","flg":21},{"*":".^.c-10","flg":24},{"c-8":["\n","^You gesture at LiYan. They are here to obtain permanent resettlement, you say.","\n","^The judge looks confused. \"Are you... translating for LiYan?\"","\n",{"->":"LiYan.Third_TranslateInMeeting_UhOh"},"ev","void","/ev","->->",{"->":".^.^.^.g-4"},{"#f":5}],"c-9":["\n","^You gesture at LiYan. You're here to translate for them, you explain. They are requesting permanent resettlement.","\n",{"->":"LiYan.Third_TranslateInMeeting_UhOh"},"ev","void","/ev","->->",{"->":".^.^.^.g-4"},{"#f":5}],"c-10":["\n",{"->":".^.^.^.g-4"},{"#f":5}],"#f":5}],"g-4":["^LiYan says, \"I am here to request -------- ---------.\"","\n","^You know that LiYan said \"permanent resettlement\", but the judge looks confused.","\n","ev","str","^Quickly jump in and translate.","/str","/ev",{"*":".^.c-11","flg":20},"ev","str","^Allow the judge to continue.","/str","/ev",{"*":".^.c-12","flg":20},{"c-11":["\n","^You jump in and clarify: LiYan means to say, they're requesting permanent resettlement.","\n","^The judge remains confused. \"Are you... supposed to be LiYan's translator?\"","<>","\n",{"->":"LiYan.Third_TranslateInMeeting_UhOh"},"ev","void","/ev","->->",{"->":".^.^.^.g-5"},{"#f":5}],"c-12":["\n","ev",true,"/ev",{"VAR=":"assistant","re":true},"^The judge looks down at her podium ","ev",{"VAR?":"podium"},0,"==","/ev",[{"->":".^.b","c":true},{"b":["^ again",{"->":".^.^.^.12"},null]}],"nop","^. \"That... What?\" They call over their assistant, and they confer in hushed tones. After a short bit, they ask:","\n",{"->":".^.^.^.g-5"},{"#f":5}],"#f":5}],"g-5":["^\"You are Calanethi, correct?\"","\n","ev","str","^Jump in and explain that LiYan is Malakethi.","/str","/ev",{"*":".^.c-13","flg":20},"ev","str","^Stay quiet.","/str","/ev",{"*":".^.c-14","flg":20},{"c-13":["\n","^The judge looks confused. \"And who are you?\"","\n",[["ev","str","^You're here to translate for LiYan.","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^You're just a friend.","/str","/ev",{"*":".^.c-1","flg":20},{"c-0":["\n",{"->":"LiYan.Third_TranslateInMeeting_UhOh"},"ev","void","/ev","->->",{"#f":5}],"c-1":["\n","^Just a friend of LiYan's, you say.","\n","^The judge shakes her head. \"I'm sorry, but friends are not allowed in the courtroom. Please escort this person out.\" The last bit is said to the assistant.","\n","^The assistant moves to escort you out of the room.","\n","^Wait, you say...","\n",{"->":".^.^"},{"#f":5}],"#f":5,"#n":"wait"}],null],{"#f":5}],"c-14":["\n","^LiYan shakes their head. \"No. I am ---------.\"","\n","^You know that they said they are Malakethi, but the judge clearly does not understand. They confer once again with their assistant.","\n","^\"Clearly,\" the judge says, \"there are some translation issues. Since you did not request a translator, we will need to delay this hearing to another time.\"","\n","^LiYan turns and looks back at you. They twist their hand.","\n",["ev","str","^Now is clearly the time to jump in.","/str","/ev",{"*":".^.c-0","flg":20},{"c-0":["\n","^You're incredibly nervous, but clearly you have to jump in. You say you're here to translate for LiYan.","\n",{"->":"LiYan.Third_TranslateInMeeting_UhOh"},"ev","void","/ev","->->",{"#f":5}]}],{"#f":5}],"#f":5}]}],{"#f":1}],"Third_TranslateInMeeting_UhOh":[["^The judge looks down at her podium ","ev",{"VAR?":"podium"},0,"==","/ev",[{"->":".^.b","c":true},{"b":["^ again",{"->":".^.^.^.7"},null]}],"nop","^ ","ev",{"VAR?":"podium"},1,"==","/ev",[{"->":".^.b","c":true},{"b":["^ once more",{"->":".^.^.^.15"},null]}],"nop","^. ","ev",{"VAR?":"assistant"},"/ev",[{"->":".^.b","c":true},{"b":["^ She looks at her assistant, and they confer once more. ",{"->":".^.^.^.22"},null]}],[{"->":".^.b"},{"b":["^ She calls her assistant up, and they confer in hushed tones. ",{"->":".^.^.^.22"},null]}],"nop","\n","ev","str","^Wait.","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^Give LiYan a smile.","/str","/ev",{"*":".^.c-1","flg":20},{"c-0":["\n","^You wait for them to finish speaking.","\n",{"->":".^.^.g-0"},{"#f":5}],"c-1":["\n","^You turn around and give LiYan a quick smile. Everything will be fine.","\n",{"->":".^.^.g-0"},{"#f":5}],"g-0":["^They finish talking, and judge looks up at ","ev",{"CNT?":"LiYan.Third_TranslateInMeeting.0.g-1.c-3"},"/ev",[{"->":".^.b","c":true},{"b":["^you",{"->":".^.^.^.6"},null]}],[{"->":".^.b"},{"b":["^LiYan",{"->":".^.^.^.6"},null]}],"nop","^. \"You did not request or record any translator. Unfortunately, we must delay this hearing until another time, when an official translator can be found. Hearing adjourned.\" They close their notes and make to stand up.","\n","^LiYan looks at you, confused. They're tense, hunched over, and their hand is twisting. This clearly isn't okay.","\n","^You call out, wait! The judge stops. You ask...","\n",["ev",{"CNT?":".^"},2,"==","/ev",[{"->":".^.b","c":true},{"b":["^ The judge is clearly impatient to leave.",{"->":".^.^.^.6"},null]}],"nop","\n","ev",{"CNT?":".^"},3,"==","/ev",[{"->":".^.b","c":true},{"b":["^ The assistant is edging closer to you, their expression thunderous. They don't appreciate this breach in courthouse etiquitte.",{"->":".^.^.^.14"},null]}],"nop","\n","ev",{"CNT?":".^"},4,"==","/ev",[{"->":".^.b","c":true},{"b":["\n","^\"Now then. I have places to be. Meeting adjourned.\" The judge slams their notes, quite definitively, and quickly walks out of the room.","\n","^The assistant shoos you out. You walk out, frustrated.","\n",{"->t->":"LiYan.continue_hack"},"ev","void","/ev","->->",{"->":".^.^.^.22"},null]}],"nop","\n","ev","str","^Why does LiYan need an official translator?","/str","/ev",{"*":".^.c-2","flg":20},"ev","str","^Point out that LiYan couldn't read the Galatean Law codes without a translator.","/str",{"CNT?":".^.c-2"},"/ev",{"*":".^.c-3","flg":21},"ev","str","^Until when will the meeting be delayed?","/str","/ev",{"*":".^.c-4","flg":20},"ev","str","^The Barakhunian housing block is closing this week. Can't the judge make an exception?","/str",{"CNT?":".^.c-4"},"/ev",{"*":".^.c-5","flg":21},"ev","str","^Look at LiYan. Do they have any questions?","/str","/ev",{"*":".^.c-6","flg":20},"ev","str","ev",{"CNT?":".^"},1,"==","/ev",[{"->":".^.b","c":true},{"b":["^ Actually, best not to agitate.",{"->":".^.^.^.65"},null]}],[{"->":".^.b"},{"b":["^ Best not to agitate any further.",{"->":".^.^.^.65"},null]}],"nop","/str","/ev",{"*":".^.c-7","flg":20},{"c-2":["\n","^Why does LiYan need an official translator? You're already here. Isn't it best to get on with the hearing?","\n","^The judge sighs. \"Code 731, subsection 8a, amendment B. All official Galatean business must be conducted through an official translator for note-taking purposes. A translator will be provided by the authorities upon request.\"","\n",{"->":".^.^"},{"#f":5}],"c-3":["\n","^You point out that, without a translator, LiYan couldn't even read the Galatean law codes to know that they would need a translator.","\n","^The judge shrugs dismissively. ",{"->t->":"LiYan.Judge_Da_Law"},"\n",{"->":".^.^"},{"#f":5}],"c-4":["\n","^When will the meeting be delayed until, you ask?","\n","^The judge shakes their head. \"That's not my job. Schedule with the front desk. We'll process the request as soon as possible.\"","\n",{"->":".^.^"},{"#f":5}],"c-5":["\n","^Soon, LiYan will be transferred to a faraway planet, you say. They won't have a chance to come back to this courthouse. Can't the judge grant an exception in this case?","\n","^The judge merely looks annoyed. ",{"->t->":"LiYan.Judge_Da_Law"},"\n",{"->":".^.^"},{"#f":5}],"c-6":["\n","^You look at LiYan to see if they have a question.","\n","^They look... strained. You're not sure how to interpret this expression. Their muscles are tense, especially in their hands, and they're shaking, almost vibrating. Their face, while stoic, is tensed up, their jaw clenched.","\n","^They don't say a thing.","\n",{"->":".^.^"},{"#f":5}],"c-7":["\n","^You decide it's best not to push the issue any further, and you shake your head. ","ev",{"CNT?":".^.^"},1,"==","/ev",[{"->":".^.b","c":true},{"b":["^ Nevermind, you say. ",{"->":".^.^.^.9"},null]}],[{"->":".^.b"},{"b":["^ No further questions. ",{"->":".^.^.^.9"},null]}],"nop","\n","^The assistant shoos you off, and you hurry out of the room.","\n",["ev","str","^Continue","/str","/ev",{"*":".^.c-0","flg":20},{"c-0":["^ ","ev","void","/ev","->->","\n",{"#f":5}]}],{"#f":5}],"#f":5,"#n":"choices"}],{"#f":5}]}],{"#f":1}],"Judge_Da_Law":["ev",{"CNT?":".^"},1,"==","/ev",[{"->":".^.b","c":true},{"b":["^ \"The law applies to us all. It does not discriminate by species. And I am not dismissing your suit, I am merely delaying it.\" ",{"->":".^.^.^.7"},null]}],[{"->":".^.b"},{"b":["^ They say, as if to a child:  \"Once again, the law applies to us all. This is the basis for all galactic society. If we make an exception for one person, then what results next? Lawlessness!\" ",{"->":".^.^.^.7"},null]}],"nop","\n","ev","void","/ev","->->",{"#f":1}],"continue_hack":[["ev","str","^Continue","/str","/ev",{"*":".^.c-0","flg":20},{"c-0":["\n",{"->":".^.^.g-0"},{"#f":5}],"g-0":["ev","void","/ev","->->",{"#f":5}]}],{"#f":1}],"Farewell":[["^You head towards the far end of the spaceport, for gate X8, where LiYan will board their shuttle.","\n","^Given how your last encounter with LiYan ended, with them stalking off, you're pretty sure they were angry. You're feeling...","\n","ev","str","^Apprehensive.","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^Resolute.","/str","/ev",{"*":".^.c-1","flg":20},{"c-0":["\n","^You're apprehensive. You're not sure what to expect when you see them. You almost turn around, but the shame stops you, and you keep walking.","\n",{"->":".^.^.g-0"},{"#f":5}],"c-1":["\n","^You're resolute. You might not be sure what to expect, but you know you shouldn't avoid them. You'll face them and whatever they have to say.","\n",{"->":".^.^.g-0"},{"#f":5}],"g-0":["^It takes a while for you to walk to the gate, but finally, you spot LiYan, with their stoic expression. A single bag is at their feet. Their long back is bowed, fighting the gravity of this artificial place.","\n","ev","str","^Say hello.","/str","/ev",{"*":".^.c-2","flg":20},{"c-2":["\n",{"->":".^.^.^.g-1"},{"#f":5}],"#f":5}],"g-1":["^You walk up and say hello. You brace yourself for anger.","\n","^LiYan shakes their head. They don't look at you, but they say, \"Hello, my friend. It is good to see you.\"","\n","^With these words, you feel yourself relax a little bit. But they're still not looking at you.","\n","ev","str","^Ask how they are feeling.","/str","/ev",{"*":".^.c-3","flg":20},"ev","str","^Ask whether they are angry with you.","/str","/ev",{"*":".^.c-4","flg":20},"ev","str","^Apologize that you couldn't have done more.","/str","/ev",{"*":".^.c-5","flg":20},{"c-3":["\n","^You ask, cautiously, how LiYan is feeling.","\n","^LiYan nods. \"I feel... frustrated.\" Their face tightens a little bit.","\n","ev",{"VAR?":"LiYan_Translate"},"!","/ev",[{"->":".^.b","c":true},{"b":["^ \"Frustrated, first, with you. For not helping translate.\" They shake their hand. \"Frustrated. But I know you felt there was no good choice.",{"->":".^.^.^.10"},null]}],"nop","\n",{"->":".^.^.^.g-2"},{"#f":5}],"c-4":["\n","^You figure you might as well ask directly. Are they still feeling angry with you?","\n","^LiYan nods. \"Not you... Not you. Angry at system.\"","\n","ev",{"VAR?":"LiYan_Translate"},"!","/ev",[{"->":".^.b","c":true},{"b":["^ \"With you... Disappointment. For not helping translate.\" They shake their hand. \"Disappointed. I know you felt there was no good choice.",{"->":".^.^.^.10"},null]}],"nop","\n",{"->":".^.^.^.g-2"},{"#f":5}],"c-5":["\n","^You immediately apologize. You wish you could have done more, at every step. LiYan deserved better.","\n","ev",{"VAR?":"LiYan_Translate"},"!","/ev",[{"->":".^.b","c":true},{"b":["^ LiYan shakes their head. \"You could have. You could have translated.\" They shake their hand. \"Disappointed. But I have thought. I know you felt there was no good choice.",{"->":".^.^.^.8"},null]}],"nop","\n",{"->":".^.^.^.g-2"},{"#f":5}],"#f":5}],"g-2":["^Finally, they look you.","\n","ev","str","^Continue","/str","/ev",{"*":".^.c-6","flg":20},{"c-6":["\n",{"->":".^.^.^.g-3"},{"#f":5}],"#f":5}],"g-3":["^\"I have thought many thoughts. About many things. Why I was banished. Why I continue to find no home.\"","\n","^In the background, the shuttle boarding call goes out. LiYan stands up. Their hands clench, but then relax.","\n","^\"No one wishes for me to exist. Not the Calanethi. Not the Galateans. I am inconvenient to exist.\" Something in their gaze becomes more resolute. \"Well then. My existence is inconvenient for them? I will go to this eighth camp. And the next. And the next. I will be inconvenient. I will exist, and resist.\"","\n","ev","str","^Continue","/str","/ev",{"*":".^.c-7","flg":20},{"c-7":["\n",{"->":".^.^.^.g-4"},{"#f":5}],"#f":5}],"g-4":["^LiYan stands up, picking up their bag.","\n","^\"I am unsure if see each other again. I am still angry, inside, but I will not part with anger. I would call you a friend.\" They hold their hand to you.","\n","ev","str","^Grasp their hand.","/str","/ev",{"*":".^.c-8","flg":20},"ev","str","^Grasp their hand and apologize","ev",{"CNT?":".^.^.g-1.c-5"},"/ev",[{"->":".^.b","c":true},{"b":["^ again",{"->":".^.^.^.17"},null]}],"nop","^.","/str","/ev",{"*":".^.c-9","flg":20},{"c-8":["\n","^You clasp their hand tightly. You wish them luck in their travel, and wherever they end up next.","\n","^\"Thank you. I wish the same for us all.\"","\n",{"->":".^.^.^.g-5"},{"#f":5}],"c-9":["\n","^You clasp their hand, and apologize","ev",{"CNT?":".^.^.^.g-1.c-5"},"/ev",[{"->":".^.b","c":true},{"b":["^ again",{"->":".^.^.^.6"},null]}],"nop","^. You're so sorry.","\n","^\"Do not be. Existence is a gift.\"","\n",{"->":".^.^.^.g-5"},{"#f":5}],"#f":5}],"g-5":["^With that, LiYan straightens their back and boards the shuttle, head held high.","\n","ev","str","^Find Yousef in the spaceport.","/str","/ev",{"*":".^.c-10","flg":20},{"c-10":["\n",{"->":".^.^.^.g-6"},{"#f":5}],"#f":5}],"g-6":["ev","void","/ev","->->",{"#f":5}]}],{"#f":1}],"#f":3}],"Cafeteria":["ev",{"CNT?":".^"},1,"==","/ev",[{"->":".^.b","c":true},{"b":["\n","^You cross a threshold into a brightly lit space. The glare of the overhead lights is harsh. Tables and benches are arranged messily, filled with of people - mostly humanoids - chatting amongst themselves. At the far end of the room there is a short line along an open window. Staff spoon out servings of lukewarm food for the people in line.","\n","^It's loud in here. The ceiling doesn't give anywhere for chatter to escape, and so here it stays, a clamor. You muse upon the exponential effect of a crowd; few people, and you can chat in a normal voice. But in a crowd, you speak more loudly to be heard over others, and they speak more loudly to be heard over you, until suddenly everyone is shouting.","\n",{"->":".^.^.^.6"},null]}],"nop","\n","ev",{"CNT?":".^"},1,">","/ev",[{"->":".^.b","c":true},{"b":["^ You once again enter the Barakhunian housing block's cafeteria. It's just as bustling as last time, and the ceiling is just as low as you remember it.",{"->":".^.^.^.14"},null]}],"nop","\n","ev","void","/ev","->->",{"#f":1}],"Visit":[[["ev",{"CNT?":"Fanias"},3,">=",{"CNT?":"Yousef"},3,">=","&&",{"CNT?":"LiYan"},3,">=","&&","/ev",{"->":".^.b","c":true},{"b":["\n",{"->t->":"Spaceport_Intro"},"ev","void","/ev","->->",{"->":".^.^.^.1"},null]}],"nop","\n",["ev","visit",9,"MIN","/ev","ev","du",0,"==","/ev",{"->":".^.s0","c":true},"ev","du",1,"==","/ev",{"->":".^.s1","c":true},"ev","du",2,"==","/ev",{"->":".^.s2","c":true},"ev","du",3,"==","/ev",{"->":".^.s3","c":true},"ev","du",4,"==","/ev",{"->":".^.s4","c":true},"ev","du",5,"==","/ev",{"->":".^.s5","c":true},"ev","du",6,"==","/ev",{"->":".^.s6","c":true},"ev","du",7,"==","/ev",{"->":".^.s7","c":true},"ev","du",8,"==","/ev",{"->":".^.s8","c":true},"ev","du",9,"==","/ev",{"->":".^.s9","c":true},"nop",{"s0":["pop",{"->":".^.^.65"},null],"s1":["pop","^You lean back in your train seat and think about who you'll visit tomorrow...",{"->":".^.^.65"},null],"s2":["pop","^Your thoughts move on. You think about who you'll visit tomorrow.",{"->":".^.^.65"},null],"s3":["pop","^You bring up your calendar. Six days left before you leave for Barakhun. Who will you check in on tomorrow?",{"->":".^.^.65"},null],"s4":["pop","^You lean forward in your seat. Now then - who will you visit tomorrow?",{"->":".^.^.65"},null],"s5":["pop","^A PA announcement for the station breaks you out of your reverie. Who to visit next?",{"->":".^.^.65"},null],"s6":["pop","^Your thoughts move on. Who will you see tomorrow?",{"->":".^.^.65"},null],"s7":["pop","^You're almost back to your apartment. You should decide who you'll visit tomorrow.",{"->":".^.^.65"},null],"s8":["pop","^The train reaches your stop. You stand up, and think about who you'll visit tomorrow.",{"->":".^.^.65"},null],"s9":["pop","^Your head is a little heavy from the week. One last check-in, and you'll be done for the week.",{"->":".^.^.65"},null],"#f":5}],"\n","ev",{"CNT?":"Fanias"},3,">=","/ev",[{"->":".^.b","c":true},{"b":["^ You've spoken to Fanias ","ev",{"CNT?":"Yousef"},3,">=","/ev",[{"->":".^.b","c":true},{"b":["^ and Yousef",{"->":".^.^.^.7"},null]}],"nop","^ ","ev",{"CNT?":"LiYan"},3,">=","/ev",[{"->":".^.b","c":true},{"b":["^ and LiYan",{"->":".^.^.^.15"},null]}],"nop","^ enough this week.",{"->":".^.^.^.11"},null]}],"nop","^ ","<>","\n","ev",{"CNT?":"Yousef"},3,">=",{"CNT?":"Fanias"},3,"<","&&","/ev",[{"->":".^.b","c":true},{"b":["^ You've visited Yousef ","ev",{"CNT?":"LiYan"},3,">=","/ev",[{"->":".^.b","c":true},{"b":["^ and LiYan",{"->":".^.^.^.7"},null]}],"nop","^ enough times this week.",{"->":".^.^.^.25"},null]}],"nop","^ ","<>","\n","ev",{"CNT?":"LiYan"},3,">=","/ev",[{"->":".^.b","c":true},{"b":["^ You've visited LiYan a few times this week already. Better to see someone else.",{"->":".^.^.^.35"},null]}],"nop","^ ","<>","\n","ev",{"VAR?":"next_visit"},{"^->":"Fanias"},"==",{"CNT?":"Fanias"},3,"<","&&","/ev",[{"->":".^.b","c":true},{"b":["^ You just visited Fanias.",{"->":".^.^.^.49"},null]}],"nop","\n","ev",{"VAR?":"next_visit"},{"^->":"Yousef"},"==",{"CNT?":"Yousef"},3,"<","&&","/ev",[{"->":".^.b","c":true},{"b":["^ You just visited Yousef.",{"->":".^.^.^.61"},null]}],"nop","\n","ev",{"VAR?":"next_visit"},{"^->":"LiYan"},"==",{"CNT?":"LiYan"},3,"<","&&","/ev",[{"->":".^.b","c":true},{"b":["^ You just visited LiYan.",{"->":".^.^.^.73"},null]}],"nop","\n",["ev","str","^Perhaps Fanias...","/str",{"CNT?":"Fanias"},3,"<",{"VAR?":"next_visit"},{"^->":"Fanias"},"!=",{"CNT?":"Yousef"},3,">=",{"CNT?":"LiYan"},3,">=","&&","||","&&","/ev",{"*":".^.c-0","flg":5},"ev","str","^Maybe Yousef...","/str",{"CNT?":"Yousef"},3,"<",{"VAR?":"next_visit"},{"^->":"Yousef"},"!=",{"CNT?":"Fanias"},3,">=",{"CNT?":"LiYan"},3,">=","&&","||","&&","/ev",{"*":".^.c-1","flg":5},"ev","str","^Consider LiYan...","/str",{"CNT?":"LiYan"},3,"<",{"VAR?":"next_visit"},{"^->":"LiYan"},"!=",{"CNT?":"Fanias"},3,">=",{"CNT?":"Yousef"},3,">=","&&","||","&&","/ev",{"*":".^.c-2","flg":5},{"c-0":["\n","ev",{"CNT?":"Fanias"},0,"==","/ev",[{"->":".^.b","c":true},{"b":["^ You think about checking in on Fanias, the minor lord of the Khas who comes to petition the Urun for help against his ancestral enemies.",{"->":".^.^.^.7"},null]}],"nop","\n","ev",{"CNT?":"Fanias"},1,"==","/ev",[{"->":".^.b","c":true},{"b":["^ Your father came through. His connection with the Urun set up a meeting at the Urunian Embassy, and you promised to meet Fanias there.",{"->":".^.^.^.15"},null]}],"nop","\n","ev",{"CNT?":"Fanias"},2,"==","/ev",[{"->":".^.b","c":true},{"b":["^ The head of the housing block managed to locate another of Fanias' people from back home, one of the Khas. They're going to meet up in the housing block's cafeteria, and invited you to join them.",{"->":".^.^.^.23"},null]}],"nop","\n",["ev","str","^I'll visit Fanias.","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Maybe someone else.","/str","/ev",{"*":".^.c-1","flg":4},{"c-0":["\n","ev",{"CNT?":"Visit"},1,"==","/ev",[{"->":".^.b","c":true},{"b":["^ You decide you will pay Fanias a visit first.",{"->":".^.^.^.7"},null]}],"nop","\n","ev",{"CNT?":"Visit"},1,">",{"CNT?":"Fanias"},0,"==","&&","/ev",[{"->":".^.b","c":true},{"b":["^ You decide it's time to visit Fanias.",{"->":".^.^.^.19"},null]}],"nop","\n","ev",{"CNT?":"Visit"},1,">",{"CNT?":"Fanias"},1,"==","&&","/ev",[{"->":".^.b","c":true},{"b":["^ Fanias' appointment at the Urunian embassy is tomorrow. You'll meet him there.",{"->":".^.^.^.31"},null]}],"nop","\n","ev",{"CNT?":"Visit"},1,">",{"CNT?":"Fanias"},2,"==","&&","/ev",[{"->":".^.b","c":true},{"b":["^ You message Fanias, telling him you'll see him at the housing block's cafeteria tomorrow.",{"->":".^.^.^.43"},null]}],"nop","\n","ev",{"^->":"Fanias"},"/ev",{"VAR=":"next_visit","re":true},{"->":"Visit.0.g-0"},{"#f":5}],"c-1":["\n","^You put aside the thought of visiting Fanias.","\n",{"->":".^.^.^.^"},{"->":"Visit.0.g-0"},{"#f":5}]}],{"#f":5}],"c-1":["\n","ev",{"CNT?":"Yousef"},0,"==","/ev",[{"->":".^.b","c":true},{"b":["^ You think about checking in on Yousef, the refugee of the Yisua-Falas conflict, who left his family in Falas to save his wife and daughter.",{"->":".^.^.^.7"},null]}],"nop","\n","ev",{"CNT?":"Yousef"},1,"==","/ev",[{"->":".^.b","c":true},{"b":["^ Last time you met, Yousef wanted help delivering a package to his sisters in Falas. He asked to meet at Satna Market.",{"->":".^.^.^.15"},null]}],"nop","\n","ev",{"CNT?":"Yousef"},2,"==","/ev",[{"->":".^.b","c":true},{"b":["^ It might be a good idea to check in on Yousef after your adventure at Satna Market. You can drop by his family's apartment.",{"->":".^.^.^.23"},null]}],"nop","\n",["ev","str","^I'll visit Yousef.","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Maybe someone else.","/str","/ev",{"*":".^.c-1","flg":4},{"c-0":["\n","ev",{"CNT?":"Visit"},1,"==","/ev",[{"->":".^.b","c":true},{"b":["^ You decide to visit Yousef first.",{"->":".^.^.^.7"},null]}],"nop","\n","ev",{"CNT?":"Visit"},1,">",{"CNT?":"Yousef"},0,"==","&&","/ev",[{"->":".^.b","c":true},{"b":["^ You decide it's time to visit Yousef.",{"->":".^.^.^.19"},null]}],"nop","\n","ev",{"CNT?":"Visit"},1,">",{"CNT?":"Yousef"},1,"==","&&","/ev",[{"->":".^.b","c":true},{"b":["^ You message Yousef. You'll meet him at Satna Market tomorrow.",{"->":".^.^.^.31"},null]}],"nop","\n","ev",{"CNT?":"Visit"},1,">",{"CNT?":"Yousef"},2,"==","&&","/ev",[{"->":".^.b","c":true},{"b":["^ You decide to drop in on Yousef and Youmna at their apartment in the housing block tomorrow.",{"->":".^.^.^.43"},null]}],"nop","\n","ev",{"^->":"Yousef"},"/ev",{"VAR=":"next_visit","re":true},{"->":"Visit.0.g-0"},{"#f":5}],"c-1":["\n","^Perhaps you'll visit Yousef another time.","\n",{"->":".^.^.^.^"},{"->":"Visit.0.g-0"},{"#f":5}]}],{"#f":5}],"c-2":["\n","ev",{"CNT?":"LiYan"},0,"==","/ev",[{"->":".^.b","c":true},{"b":["^ You consider visiting LiYan, the Calanethi of unknown origin who is having trouble with the universal translator.",{"->":".^.^.^.7"},null]}],"nop","\n","ev",{"CNT?":"LiYan"},1,"==","/ev",[{"->":".^.b","c":true},{"b":["^ LiYan was having gravity problems, but the head of the housing block was able to find a temporary solution for them.",{"->":".^.^.^.15"},null]}],"nop","\n","ev",{"CNT?":"LiYan"},2,"==","/ev",[{"->":".^.b","c":true},{"b":["^ LiYan wanted your help with translation at their permanent resettlement hearing at the Galatean Courthouse. ","ev",{"VAR?":"LiYan_Translate"},"!","/ev",[{"->":".^.b","c":true},{"b":["^ Although you declined, you still promised to meet them there.",{"->":".^.^.^.6"},null]}],"nop",{"->":".^.^.^.23"},null]}],"nop","\n",["ev","str","^I'll visit LiYan.","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Maybe someone else.","/str","/ev",{"*":".^.c-1","flg":4},{"c-0":["\n","ev",{"CNT?":"Visit"},1,"==","/ev",[{"->":".^.b","c":true},{"b":["^ You decide to visit LiYan first.",{"->":".^.^.^.7"},null]}],"nop","\n","ev",{"CNT?":"Visit"},1,">",{"CNT?":"LiYan"},0,"==","&&","/ev",[{"->":".^.b","c":true},{"b":["^ You decide it's time to check in on LiYan.",{"->":".^.^.^.19"},null]}],"nop","\n","ev",{"CNT?":"Visit"},1,">",{"CNT?":"LiYan"},1,"==","&&","/ev",[{"->":".^.b","c":true},{"b":["^ You message LiYan. You'll meet them tomorrow.",{"->":".^.^.^.31"},null]}],"nop","\n","ev",{"CNT?":"Visit"},1,">",{"CNT?":"LiYan"},2,"==","&&","/ev",[{"->":".^.b","c":true},{"b":["^ LiYan's permanent resettlement meeting is tomorrow, so you'll meet them there.",{"->":".^.^.^.43"},null]}],"nop","\n","ev",{"^->":"LiYan"},"/ev",{"VAR=":"next_visit","re":true},{"->":"Visit.0.g-0"},{"#f":5}],"c-1":["\n","^You decide to visit someone other than LiYan.","\n",{"->":".^.^.^.^"},{"->":"Visit.0.g-0"},{"#f":5}]}],{"#f":5}],"#f":5,"#n":"visit"}],{"g-0":["ev","str","^Continue","/str","/ev",{"*":".^.c-3","flg":4},{"c-3":["\n",{"->":".^.^.^.g-1"},{"#f":5}],"#f":5}],"g-1":["ev","void","/ev","->->",{"#f":5}]}],{"#f":1}],"Train":[["ev","visit",8,"MIN","/ev","ev","du",0,"==","/ev",{"->":".^.s0","c":true},"ev","du",1,"==","/ev",{"->":".^.s1","c":true},"ev","du",2,"==","/ev",{"->":".^.s2","c":true},"ev","du",3,"==","/ev",{"->":".^.s3","c":true},"ev","du",4,"==","/ev",{"->":".^.s4","c":true},"ev","du",5,"==","/ev",{"->":".^.s5","c":true},"ev","du",6,"==","/ev",{"->":".^.s6","c":true},"ev","du",7,"==","/ev",{"->":".^.s7","c":true},"ev","du",8,"==","/ev",{"->":".^.s8","c":true},"nop",{"s0":["pop","^\"Barakhunian Refugee Housing Block.\" The train doors slide open, and you board, taking a seat. [i]Badunk, badunk, badunk.[/i] The rhythmic sound of the railcar starts up as the train leaves from the housing block station.",{"->":".^.^.59"},null],"s1":["pop","^[i]Badunk, badunk, badunk.[/i] You find yourself annoyed by the sound of the train. You really wish that they'd replaced this thing with a maglev.",{"->":".^.^.59"},null],"s2":["pop","^[i]Badunk, badunk, badunk.[/i] You sniff. The interior of the railcar smells like fried food today. You wonder who would be so rude as to eat on the train.",{"->":".^.^.59"},null],"s3":["pop","^[i]Badunk, badunk, badunk.[/i] Another day, another check-in.",{"->":".^.^.59"},null],"s4":["pop","^[i]Badunk, badunk, badunk.[/i] You look out the window of the railcar, mesmerized by the flames of Nova Station's dying star.",{"->":".^.^.59"},null],"s5":["pop","^[i]Badunk, badunk, badunk.[/i] Train's full to bursting today, for some reason. Must be the construction on maglev line 4. You stand, holding onto a handle.",{"->":".^.^.59"},null],"s6":["pop","^[i]Badunk, badunk, badunk.[/i] You find that you're no longer annoyed by the sound of the train on the rail. It's almost nostalgic to you, at this point.",{"->":".^.^.59"},null],"s7":["pop","^[i]Badunk, badunk, badunk.[/i] You wonder idly about what is causing that sound. You resolve to ask the assistant at the station before you board next time.",{"->":".^.^.59"},null],"s8":["pop","^[i]Badunk, badunk, badunk.[/i] You sit on the train, head bowed. You find yourself a little sad, worn down from all the support you've given this week. It's almost over, and you're not sure how much good you've done.",{"->":".^.^.59"},null],"#f":5}],"\n","ev","void","/ev","->->",{"#f":1}],"Spaceport_Intro":[["^You lean back, and put your head on the window of the railcar.","\n","ev","str","^That was your last meeting.","/str","/ev",{"*":".^.c-0","flg":20},{"c-0":["\n",{"->":".^.^.g-0"},{"#f":5}],"g-0":["^That's it, then. That was your last meeting with the residents of the housing block. Only one thing left to do.","\n","^Tomorrow morning, you'll see each of them off at the spaceport, and then - it's off to Barakhun, to finally reunite with your father.","\n","ev","str","^You're nervous about the residents.","/str","/ev",{"*":".^.c-1","flg":20},"ev","str","^You're eager to get home.","/str","/ev",{"*":".^.c-2","flg":20},{"c-1":["\n","^Did you do enough? Will they be okay? You feel nervous about the fate of each of the residents. You owe it to them to see them off.","\n",{"->":".^.^.^.g-1"},{"#f":5}],"c-2":["\n","^You think about Barakhun, and your father. You can't wait to see them again.","\n",{"->":".^.^.^.g-1"},{"#f":5}],"#f":5}],"g-1":["ev","str","^One last thing to do.","/str","/ev",{"*":".^.c-3","flg":20},{"c-3":["\n",{"->":".^.^.^.g-2"},{"#f":5}],"#f":5}],"g-2":["ev","str","^spaceport","/str",{"f()":"change_background"},"pop","/ev","\n","^The next day, you enter the Nova Station spaceport.","\n","^With millions of travelers passing through the station at any given time, the port is busy at all times of the day. Right now is no exception. The crowd is like a living thing, pushing you this way and that.","\n","ev","void","/ev","->->",{"#f":5}]}],{"#f":1}],"Finale":[["^. . .","\n","ev","str","^Four weeks later...","/str","/ev",{"*":".^.c-0","flg":20},{"c-0":["\n","ev","str","^car","/str",{"f()":"change_background"},"pop","/ev","\n",{"->":".^.^.g-0"},{"#f":5}],"g-0":["^Four weeks later, after some packing and a long space journey, you find yourself on Barakhun.","\n","^You're in a small ground-based vehicle. Outside the window, you see the newly terraformed plains of Barakhun. The lake is placid. The grass waves in the soft breeze. The sky - a [i]real[/i] sky - is a shade of blue you've never seen.","\n","^Your father drives the vehicle. You've already gotten the hugs and the pleasantries out of the way earlier. He keeps his eyes on the road, and asks:","\n","^\"So, how was your time at the refugee housing block? Tell me about it.\"","\n","ev","str","^It was difficult.","/str","/ev",{"*":".^.c-1","flg":20},"ev","str","^You handled it.","/str","/ev",{"*":".^.c-2","flg":20},{"c-1":["\n","^It was difficult, you say. You have no idea how the folks there do that kind of work on a regular basis.","\n","^He smiles softly. \"I imagine it doesn't really get much easier, over time. Tell me about the people you met.\"","\n",{"->":".^.^.^.people"},{"#f":5}],"c-2":["\n","^You handled it, you say. It was nothing.","\n","^\"Oh really?\" He arches one eyebrow. \"That easy, huh? Tell me about the people you met.\"","\n",{"->":".^.^.^.people"},{"#f":5}],"#f":5}],"people":["ev","str","^Talk about LiYan, the stoic Malakethi.","/str","/ev",{"*":".^.c-3","flg":20},"ev","str","^Talk about Fanias, the prince of the Khas.","/str","/ev",{"*":".^.c-4","flg":20},"ev","str","^Talk about Yousef, Youmna, and Banias.","/str","/ev",{"*":".^.c-5","flg":20},{"c-3":["\n","^You met a person named LiYan.","\n",["ev","str","^They struggled with the gravity.","/str","/ev",{"*":".^.c-0","flg":20},{"c-0":["\n",{"->":".^.^.g-0"},{"#f":5}],"g-0":["^They struggled with the gravity on the station, but you helped them to find a place of respite, a pool of water where they could be themselves.","\n","ev","str","^You translated for them, or tried.","/str",{"VAR?":"LiYan_Translate"},"/ev",{"*":".^.c-1","flg":21},"ev","str","^They had to fend for themselves at their resettlement hearing.","/str",{"VAR?":"LiYan_Translate"},"!","/ev",{"*":".^.c-2","flg":21},{"c-1":["\n","^You attempted to translate for them at their resettlement hearing, but the judge wouldn't allow it.","\n",{"->":".^.^.^.g-1"},{"#f":5}],"c-2":["\n","^You tried to find someone to translate for them at their resettlement hearing. Unfortunately, no translator could be found, and they had to try to translate for themselves. The judge wouldn't allow it.","\n",{"->":".^.^.^.g-1"},{"#f":5}],"#f":5}],"g-1":["^When you saw them off at the spaceport, they were...","\n","ev","str","^Angry.","/str","/ev",{"*":".^.c-3","flg":20},"ev","str","^Spiteful.","/str","/ev",{"*":".^.c-4","flg":20},{"c-3":["\n","^They were angry when you saw them off at the spaceport. It seemed that they would use that anger to fuel them for the rest of their life, to get a kind of revenge on those who wronged them.","\n",{"->":".^.^.^.g-2"},{"#f":5}],"c-4":["\n","^They were spiteful when you saw them off at the spaceport. It seemed that they would try to use that spite to fuel them for the rest of their life, to get a kind of revenge on those who wronged them.","\n",{"->":".^.^.^.g-2"},{"#f":5}],"#f":5}],"g-2":["^Your father thinks about the story you've told. \"There is strength in anger,\" he says, a little hesitantly. His voice gets stronger as he goes on. \"It can motivate you to do terrible, horrible things, but used properly, it can also drive you to keep going, to fight for a just cause.\"","\n","^\"It's to be seen whether they can continue using it as a fuel, or if it burns them out.\"","\n",{"->":".^.^.^.^"},{"->":"Finale.0.g-1"},{"#f":5}]}],{"#f":5}],"c-4":["\n","^You met Fanias, prince of the Khas, of Nidaroen.","\n",["ev","str","^He was attempting to save his people.","/str","/ev",{"*":".^.c-0","flg":20},{"c-0":["\n",{"->":".^.^.g-0"},{"#f":5}],"g-0":["^Fanias tried to save his people from their enemies, who took his lands, captured his family. But the enemy wasn't who he thought they were.","\n","ev","str","^He petitioned the Urun.","/str","/ev",{"*":".^.c-1","flg":20},{"c-1":["\n",{"->":".^.^.^.g-1"},{"#f":5}],"#f":5}],"g-1":["^He went to petition the Urun, who were supposed to take care of his people. They wouldn't meet with him. It turns out that they were the betrayers all along, that they had chosen profit over justice. Despite knowing this, Fanias wouldn't give up the fight.","\n","^Earlier, you told Tress that ","ev",{"CNT?":"Fanias.Third.0.g-5.questions.c-9.7.g-0.situation.c-2"},"/ev",[{"->":".^.b","c":true},{"b":["^Fanias should fight for the people that he loves.",{"->":".^.^.^.7"},null]}],"nop","^ ","ev",{"CNT?":"Fanias.Third.0.g-5.questions.c-9.7.g-0.situation.c-3"},"/ev",[{"->":".^.b","c":true},{"b":["^Fanias should fight the Urun because it is the right thing to do.",{"->":".^.^.^.13"},null]}],"nop","^ ","ev",{"CNT?":"Fanias.Third.0.g-5.questions.c-9.7.g-0.situation.c-4"},"/ev",[{"->":".^.b","c":true},{"b":["^Fanias should give up, and begin a new life.",{"->":".^.^.^.19"},null]}],"nop","\n","^He chose to become more radical instead of giving up. And you think that was...","\n","ev","str","^An admirable thing to do.","/str","/ev",{"*":".^.c-2","flg":20},"ev","str","^A foolish thing to do.","/str","/ev",{"*":".^.c-3","flg":20},{"c-2":["\n","^You think that Fanias, in the end, is an admirable figure. That he would follow his moral compass to its logical conclusion, rather than to give up the fight.","\n",{"->":".^.^.^.g-2"},{"#f":5}],"c-3":["\n","^You think that Fanias made a foolish choice. That he should have given up the fight when he saw that the odds were stacked against him. Or perhaps that he should have found a different way to fight, rather than direct confrontation.","\n",{"->":".^.^.^.g-2"},{"#f":5}],"#f":5}],"g-2":["^Your father sighs, and looks sad. \"As much as we want to believe that peaceful means can always prevail, I don't think it's always the case. Sometimes direct resistance is warranted, and necessary. It seems that Fanias is on his way to learning that.\"","\n","^\"But he won't get anywhere by himself.\" He shakes his head. \"I hope he learns, too, to find the allies he needs to properly fight the Urun.\"","\n",{"->":".^.^.^.^"},{"->":"Finale.0.g-1"},{"#f":5}]}],{"#f":5}],"c-5":["\n","^You met a Falasi family. Their names were Yousef, Youmna, and Banias.","\n",["ev","str","^They escaped Falas.","/str","/ev",{"*":".^.c-0","flg":20},{"c-0":["\n",{"->":".^.^.g-0"},{"#f":5}],"g-0":["^They were lucky enough to escape Falas, but they had to leave family behind, family that is now starving.","\n",["ev","str","^Yousef tried to find a way to help.","/str","/ev",{"*":".^.c-1","flg":20},"ev","str","^Youmna was filled with rage.","/str","/ev",{"*":".^.c-2","flg":20},"ev","str","^Banias wanted to see her family.","/str","/ev",{"*":".^.c-3","flg":20},{"*":".^.c-4","flg":24},{"c-1":["\n","^Yousef paid some smugglers to try to send food to their family. He tricked you into coming with him for safety, ","<>","\n","ev",{"CNT?":"Yousef.Second.0.g-11.forgive"},"/ev",[{"->":".^.b","c":true},{"b":["\n","ev",{"CNT?":"Yousef.Second.0.g-11.forgive.c-24"},{"CNT?":"Yousef.Second.0.g-11.forgive.c-25"},"||",{"CNT?":"Yousef.Second.0.g-11.forgive.c-23"},"||","!","/ev",[{"->":".^.b","c":true},{"b":["^but you forgave him immediately, because you saw the depth of his grief.",{"->":".^.^.^.11"},null]}],[{"->":".^.b"},{"b":["^and you forgave him, after investigating his motives.",{"->":".^.^.^.11"},null]}],"nop","\n",{"->":".^.^.^.8"},null]}],"nop","\n","ev",{"CNT?":"Yousef.Second.0.g-11.forgive"},"!","/ev",[{"->":".^.b","c":true},{"b":["^ and you could not bring yourself to forgive him, despite the depths of his grief.",{"->":".^.^.^.15"},null]}],"nop","\n",{"->":".^.^"},{"->":".^.^.^.^.g-1"},{"#f":5}],"c-2":["\n","^Youmna was filled with rage. Rage that she felt she could not let out, lest she upset those around her. She wanted to move on, to let go of it, but instead, she couldn't keep it from spilling out.","\n",{"->":".^.^"},{"->":".^.^.^.^.g-1"},{"#f":5}],"c-3":["\n","^Banias was just a child. She understood what was happening, but denied it. She wanted to see her aunts and uncles again. You suspect she never will; Yisua has denied her that chance. Eventually, she will grow up, and she will fill that hole in her heart with sorrow, or regret, or perhaps - rage, like her mother.","\n",{"->":".^.^"},{"->":".^.^.^.^.g-1"},{"#f":5}],"c-4":["\n",{"->":".^.^.^.^.g-1"},{"#f":5}],"#f":5,"#n":"repeat"}],{"#f":5}],"g-1":["^You wonder, in the end, whether Yousef boarded the shuttle to New Tarnaeum, or whether he tried to return to Falas.","\n","ev","str","^You think Yousef moved on.","/str","/ev",{"*":".^.c-5","flg":20},"ev","str","^You think Yousef went back.","/str","/ev",{"*":".^.c-6","flg":20},{"c-5":["\n","^You think that Yousef went with Youmna and Banias to New Tarnaeum. Surely he would have seen that they needed him. Surely he would have looked forward, to the future, rather than back, to his past.","\n",{"->":".^.^.^.g-2"},{"#f":5}],"c-6":["\n","^You think that Yousef tried to go back to Falas. That overwhelming guilt he expressed, at not being able to help his family - you think that was eating him up inside, so much so that he had to go back and do what he could.","\n",{"->":".^.^.^.g-2"},{"#f":5}],"#f":5}],"g-2":["^Your father's face looks stricken. He cannot imagine having to make that choice. \"I wonder which choice he made. I wonder which choice I would make.\"","\n",{"->":"Finale.0.g-1"},{"#f":5}]}],{"#f":5}],"#f":5}],"g-1":["^You ride in silence for a minute. Then, your father asks:","\n","^\"Do you wish you could have done more for them?\"","\n","ev","str","^You should have done more.","/str","/ev",{"*":".^.c-6","flg":20},"ev","str","^You're relieved that it's over.","/str","/ev",{"*":".^.c-7","flg":20},{"c-6":["\n","^Yes, you say. You should have done more. There simply wasn't enough time to really help. You did good, you think you had an impact, but you think - there was so much more you wish you could have done.","\n","^Your father nods. \"Keep that feeling burning. The fight is never over. There will be more opportunities in the future.\"","\n",{"->":".^.^.^.g-2"},{"#f":5}],"c-7":["\n","^Sure, perhaps you could have done more, but... You're mainly relieved that it's over. Absorbing their stories, trying to help - it took a toll on you. It was good that you stopped when you did.","\n","^Your father nods. \"There's no shame in that. Take a break. Reflect on the experience. Perhaps you'll return to the work again, or perhaps you'll find a different way to help those in need.\"","\n",{"->":".^.^.^.g-2"},{"#f":5}],"#f":5}],"g-2":["^He looks over at you briefly, and smiles. \"I'm proud of you. You did a good job.\"","\n","^You smile back at him. You say, thanks, Dad.","\n","^You look back out the window, and see the towers of the Barakhunian capitol approaching. You're almost home.","\n","^You feel...","\n","ev","str","^Hopeful.","/str","/ev",{"*":".^.c-8","flg":20},"ev","str","^Anxious.","/str","/ev",{"*":".^.c-9","flg":20},"ev","str","^At peace.","/str","/ev",{"*":".^.c-10","flg":20},"ev","str","^Angry.","/str","/ev",{"*":".^.c-11","flg":20},{"c-8":["\n","^You feel hopeful. You're confident things can will get better, and that the future is bright.","\n","^Only you can say whether this hope energizes you to do more in the future, or if it will keep you complacent.","\n",{"->":".^.^.^.g-3"},{"#f":5}],"c-9":["\n","^You feel anxious. You wonder how many more untold refugee stories there are, how much more suffering there is in this universe.","\n","^Only you can say whether this anxiety fuels you, or whether it paralyzes you.","\n",{"->":".^.^.^.g-3"},{"#f":5}],"c-10":["\n","^For now, you feel at peace. You've done what you can; helped those in need.","\n","^Only you can say whether being at peace energizes you to do more in the future, or if it will keep you complacent.","\n",{"->":".^.^.^.g-3"},{"#f":5}],"c-11":["\n","^Despite your peaceful surroundings, you can't help but feel angry at the world. How can you be coming home when so many people do not have a home?","\n","^Only you can say whether this anger fuels you, or whether it paralyzes you.","\n",{"->":".^.^.^.g-3"},{"#f":5}],"#f":5}],"g-3":["^It is with this feeling that you approach your new home.","\n","ev","str","^Fin.","/str","/ev",{"*":".^.c-12","flg":20},{"c-12":["\n",{"->":".^.^.^.g-4"},{"#f":5}],"#f":5}],"g-4":["ev","str","^tmp-background","/str",{"f()":"change_background"},"pop","/ev","\n","^. . . . . . . .","\n","^Thank you for playing. The below button will take you back to the main menu.","\n","ev","str","^Main Menu","/str","/ev",{"*":".^.c-13","flg":20},{"c-13":["\n",{"->":".^.^.^.g-5"},{"#f":5}],"#f":5}],"g-5":["ev",{"x()":"finish"},"pop","/ev","\n","^The end...","\n","end",{"#f":5}]}],{"#f":1}],"global decl":["ev",true,{"VAR=":"debug"},false,{"VAR=":"finished_intro"},{"^->":"Intro"},{"VAR=":"next_visit"},"str","^none","/str",{"VAR=":"LiYan_Guess_1"},true,{"VAR=":"LiYan_Translate"},"str","^none","/str",{"VAR=":"last_background"},0,{"VAR=":"podium"},false,{"VAR=":"assistant"},false,{"VAR=":"passive"},"/ev","end",null],"#f":1}],"listDefs":{}}